{"nodes": [{"dept_code": "BUSORG", "id": "1020", "course_title": "ORGANIZATIONAL BEHAVIOR", "description": "Provides an overview of topics and concepts in the field of organizational behavior. Emphasis is on developing a theoretical grasp of issues and problems as well as an understanding of the practical implications of various theories of human behavior at work. Specific topics include leadership, motivation, teamwork, career issues, work roles, job enrichment, employee participation, and work and non-work integration.", "completed": false}, {"dept_code": "BUSORG", "id": "1021", "course_title": "ORGANIZATIONAL BEHAVIOR HONORS +1", "description": "", "completed": false}, {"dept_code": "BUSORG", "id": "1101", "course_title": "FUNDAMENTALS OF BUSINESS COMMUNICTION", "description": "Provides conceptual foundations and training in key communication skills essential for a business professional's effectiveness. Develops skills in oral presentation, interpersonal communication, and communication in teams as applied in business settings.", "completed": false}, {"dept_code": "BUSORG", "id": "1640", "course_title": "THE ENTREPRENEURSHIP PROCESS", "description": "Emphasis will be placed on business principles vital to the entrepreneurship process, including idea generation, feasibility analysis, the integration of the functional areas of business (strategy, marketing, finance and accounting), building a new venture team, securing financing and protecting intellectual property. Through case studies, video clips and visiting entrepreneurs, these principles will be contextualized with real-life entrepreneurial successes and failures.", "completed": false}, {"dept_code": "BUSORG", "id": "1655", "course_title": "INTERNATIONAL DIMENSIONS OF ORGANIZATIONAL BEHAVIOR", "description": "Provides an introduction to organizational behavior in a global context. Emphasis is on applying core organizational behavior concepts such as leadership, motivation, and group processes, as well as more contemporary topics such as cultural diversity and expatriation to workers in Europe, Asia, and the Americas. Develops an understanding of culture and cross-cultural differences and an awareness of the key skills needed to interact effectively in cross-cultural settings.", "completed": false}, {"dept_code": "BUSORG", "id": "1660", "course_title": "MANAGING DIVERSTIY IN ORGANIZATIONS", "description": "Examines the similarities and differences in the work experiences of men and women within organizations. Also examines some of the individual and organizational consequences of gender and work. Topics include gender role attitudes, occupational segregation, gender and leadership, sexual behavior within the workplace, career mobility and workforce diversity.", "completed": false}], "links": [{"source": "1020", "target": "1655"}, {"source": "1020", "target": "1660"}]}