{"nodes": [{"dept_code": "NUTR", "id": "1000", "course_title": "INTRODUCTION TO RESEARCH", "description": "The study of the nature of research and the applications of the scientific approach in the research procedures. The course focuses on concepts, design techniques and interpretations, as well as limiting factors and ethical considerations.", "completed": false}, {"dept_code": "NUTR", "id": "1006", "course_title": "INTRO TO HUMAN NUTRITION", "description": "This course will cover an overview of the scientific principles of nutrition and application of these principles to humans throughout the life cycle. Major focuses of the course are the classification and function of the six major nutrients, review of current nutrition standards, safety of the food supply, and nutrition misinformation.", "completed": false}, {"dept_code": "NUTR", "id": "1600", "course_title": "INTRODUCTION TO DIETETICS", "description": "This is an introduction to the profession of dietetics. Emphasis will be placed on the scope of the profession of dietetics practice, the role and functions of registered dietitian nutritionists, and the education requirements for entry into practice.", "completed": false}, {"dept_code": "NUTR", "id": "1602", "course_title": "NUTRITION ASSESSMENT", "description": "This course will focus on the rationale for and the use of a variety of standards used in assessing and planning the quality and quantity of the food and nutrient intake of individuals and groups. It will include in-depth study and application of commonly used reference standards and tools used for evaluating levels and proportions of macronutrients, micronutrients and various dietary food components. Assessment of health indicators in individuals and populations will also be addressed.", "completed": false}, {"dept_code": "NUTR", "id": "1620", "course_title": "NUTRIENT METABOLISM", "description": "This course will introduce the basic concepts of biochemistry at the macro- and micro-level. At the macro-level, the structures and functions of the major biomolecules, carbohydrates, lipids, nucleic acids, and proteins will be discussed and their metabolism integrated. A similar approach will be directed at the micronutrients, vitamins, and minerals, which will be introduced with the macromolecules.", "completed": false}, {"dept_code": "NUTR", "id": "1622", "course_title": "LIFE CYCLE NUTRITION", "description": "The study of the physiological, developmental, sociological, and environmental factors that affect nutrient requirements and recommendations at various stages of the life cycle.", "completed": false}, {"dept_code": "NUTR", "id": "1626", "course_title": "PUBLIC HEALTH NUTRITION", "description": "This course focuses on the application of nutrition knowledge to improve the health of populations through public health efforts.", "completed": false}], "links": []}