{"nodes": [{"dept_code": "NPHS", "id": "1520", "course_title": "STATE AND LOCAL FRAMEWORK FOR EMERGENCY PREPAREDNESS", "description": "All response to crisis begins locally. NPHS 1520 presents ways in which states, regions and localities have implemented response planning for their jurisdictions. It also explores boundaries between federal and state law, and how, for example, decisions are made for evacuation versus sheltering in place. Case studies and models for drafting response plans will be offered and rehearsed, as well as templates for planning and allocation of resources.", "completed": false}, {"dept_code": "NPHS", "id": "1530", "course_title": "ANALYSIS, INTELLIGENCE AND DECISION TOOLS FOR EMERGENCY PREPAREDNESS", "description": "Efforts to professionalize the emergency management workforce include familiarizing the next generation with modern decision support software and analytical tools now used in planning and responding to crises. These include discrete- and agent-based simulation, geographical information systems, pattern recognition, virtual reality and predictive modeling tools. This course will offer introductory experience with these tools in realistic crisis scenarios. NPHS 1530 also will explore realities that are changing the delivery of emergency services to a model based on distributed versus centralized operations.", "completed": false}, {"dept_code": "NPHS", "id": "1900", "course_title": "INTERNSHIP", "description": "Students registered for NPHS 1900 pursue an internship involving work related to national preparedness and emergency management. Students are responsible for securing internships and a faculty member to sponsor the internship. Students should produce academic work in conjunction with their internship, which the faculty sponsor will evaluate and grade. Faculty permission is required prior to enrollment. Consult an advisor for further information.", "completed": false}, {"dept_code": "NPHS", "id": "1901", "course_title": "INDEPENDENT STUDY", "description": "Students registered for NPHS 1901 pursue research on a project related to national preparedness and emergency management under the direction of a faculty member. Students develop a study plan with the faculty member, typically working independently on a paper or report, with occasional meetings. Faculty permission is required prior to enrollment. Consult an advisor for further information.", "completed": false}], "links": []}