{"nodes": [{"dept_code": "QUECH", "id": "0101", "course_title": "QUECHUA 1", "description": "The greatest part of the first term will be devoted to the presentation and practice of the basic sound patterns of the language, its fundamental sentence patterns, and sufficient vocabulary to illustrate and practice them. An introduction to the writing system will be offered together with the opportunity to acquire elementary writing and reading skills.", "completed": false, "prereq_count": 0}, {"dept_code": "QUECH", "id": "0103", "course_title": "QUECHUA 3", "description": "The first term of the second year will concentrate on the further development of fluency in oral production and the improvement in the student's ability to understand the flow of speech as uttered by a native speaker. Increased attention will be paid to reading as a means of augmenting a recognition vocabulary and writing as a drill and as a means of consolidating and communicating the knowledge gained.", "completed": false, "prereq_count": 0}, {"dept_code": "QUECH", "id": "0105", "course_title": "QUECHUA 5", "description": "With around 10 million speakers, Quechua is the most commonly spoken of the indigenous languages in South America. In this class, you will learn intermediate Language skills in order to further your communication in Quechua. You will also continue to learn about Quechua culture and Andean realities, building off of two previous years of Quechua study as well as the summer Pitt in Bolivia program. In addition to focusing on Quechua language and culture, we also will dedicate substantial time to Quechua linguistics. You will participate in the structure of the class, as this is a tailored course. The main goal of this intermediate course is for you to continue to develop the skills necessary to communicate in Quechua. These skills include listening, reading, speaking, and writing. Equally important for communication, you will also deepen your understanding of the various cultural, historical, and political contexts in which Quechua is situated. We will continue our exploration of the multiple Quechua varieties. You will develop your knowledge of Quechua linguistics to complement your research plans.", "completed": false, "prereq_count": 0}], "links": []}