{"nodes": [{"dept_code": "RUSS", "id": "0090", "course_title": "RUSSIAN FAIRY TALES", "description": "This course introduces students to Russian folklore through the oral genre of fairy tales so as to acquaint them with popular structures of thought underpinning modes of Russian behavior. A significant component of the course will consist of visual and audio representations of scenes from fairy tales.", "completed": false}, {"dept_code": "RUSS", "id": "0101", "course_title": "ELEMENTARY RUSSIAN 1", "description": "This proficiency-based hybrid language course (3 face-to-face + 1 online hours) is designed for novice level students with basic knowledge of Russian who would like to further enhance their ability to communicate in Russian in real-life situations and to understand and appreciate Russian culture with the focus on vocabulary and language fluency and accuracy. Students will be presented with various opportunities to perform uncomplicated communicative tasks in typical social situations in all three modes of communication (Interpretive, Presentational, and Interpersonal) by integrating all four skills (listening, speaking, reading, and writing) on predictable, everyday topics, such as hobbies, holidays, vacation, at the doctor's office, going shopping, at the restaurant, traveling, and many more.", "completed": false}, {"dept_code": "RUSS", "id": "0103", "course_title": "INTERMEDIATE RUSSIAN 1", "description": "The continuation of Russian 0020, this course completes the introduction to basic Russian grammatical structures. The dative case, participles and gerunds, verbs of motion, and questions of verbal government are dealt with systematically. Extra-textbook material introduces the student to samples of unedited real-language texts. In developing spoken language ability, topics related to cross-cultural comparison receive prominence.", "completed": false}, {"dept_code": "RUSS", "id": "0325", "course_title": "THE SHORT STORY", "description": "This course will be devoted to reading short stories from 19th and 20th century Russian literature. The authors include 19th century masters Pushkin, Gogol, Dostoevsky, Tolstoy, and Chekhov--to 20th century favorites Babel, Zamyatin and Zoshchenko, right up to contemporary writers Solzhenitsyn, Shalamov, Petrusheuskaya, Tolstaya, and Tokareuy.", "completed": false}, {"dept_code": "RUSS", "id": "0400", "course_title": "ADVANCED RUSSIAN 1", "description": "This is a proficiency-based and culture-based language course. It is designed for intermediate level language students who want to improve and master their vocabulary, pronunciation, language fluency, as well as their grammatical accuracy of Russian to be able to perform a large number of communicative tasks in informal and some formal situations and to further enhance their knowledge of Russian culture. The goal of the course is to present students with opportunities to practice and perform in a range of authentic contexts by integrating all four skills (listening, speaking, reading and writing) on a variety of topics relating to events of current, public, and personal interest, such as education, city life, youth culture, life style, politics, economy, health issues, and many more.", "completed": false}, {"dept_code": "RUSS", "id": "0590", "course_title": "FORMATIVE MASTERPIECES", "description": "This course will be devoted to reading formative literary masterpieces from the 19th century. The authors include Tolstoy, Dostoevsky and Chekhov and others such as Pushkin, Gogol, Turgenev and Ostrovsky.", "completed": false}, {"dept_code": "RUSS", "id": "0670", "course_title": "CRIME, PUNISHMENT, AND KANYE WEST", "description": "The first half of this course will introduce you to the Russian masterpiece Crime and Punishment (1866), as well as its literary, social, and philosophical contexts. We will read Fyodor Dostoevsky's novel in its entirety alongside many of the most famous critical analyses that it inspired. We will discuss Dostoevsky's depiction of a murderer's psychology in light of his conservative nationalism, his devout Christianity, his acute sense of social injustice, his sexual politics, his relationship to mental illness and medicine, and his radical narrative innovations. The second half will be devoted to the work of the contemporary American rap artist Kanye West, as well as the context of his media presence and celebrity status. We will chart Crime and Punishment's themes throughout the rap artist's career. Is there something specifically Dostoevskian about Kanye's depiction of the American criminal justice system? What about his struggle with mental illness? Can we find traces of Dostoevsky's prostitutes in Kanye's porn stars? In addition to major themes, we will discuss the specific literary devices employed by each writer, and their philosophical and ethical consequences. Can rhyme, rhythm, voice, and irony represent a certain experience of time and space? Can they represent racism? Can they dismantle it?", "completed": false}, {"dept_code": "RUSS", "id": "0798", "course_title": "READING RUSSIAN LITERATURE IN THE ORIGINAL 1", "description": "This course is a one-credit add-on module for students who would like to read authentic materials in Russian.", "completed": false}, {"dept_code": "RUSS", "id": "0811", "course_title": "MADNESS AND MADMEN IN RUSS CULTURE", "description": "This course explores the theme of madness in Russian literature from its medieval period through our days. The emphasis will be placed not only on literacy works, but also on painting, music, and cinema, as well as on nonfictional documents, such as Russian medical, judicial, political, and religious treatises and essays on madness. Reading assignments will draw from theoretical (Foucault), cultural history (Billington, Rzhevsky), and literary sources.", "completed": false}, {"dept_code": "RUSS", "id": "0850", "course_title": "EARLY RUSSIAN CULTURE", "description": "This course introduces the student to the development of Russian culture from 988 through 1825, including Russia's religious, artistic, and ideological writings. Readings will include the chronicles, vitae, apocrypha, epistolary polemics, secular tales, autobiography, and early prose fiction. Visual art and architecture of the Kievan, Novgorod, and Romanov periods of Russian history provide a larger artistic context for the literary works.", "completed": false}, {"dept_code": "RUSS", "id": "0870", "course_title": "RUSSIAN FILM: EISENSTEIN AND COMPANY", "description": "The course presents the history of Russian and Soviet films, filmmaking, and the film industry from the coronation of Tsar Nicholas II to the death of Stalin.", "completed": false}, {"dept_code": "RUSS", "id": "1420", "course_title": "FOURTH-YEAR RUSSIAN 1", "description": "The course provides an extensive practice in oral communication at the advanced level. It includes discussions of readings on topics of general sociocultural interest, analysis of interviews with native speakers, and discussions of audio- and video-recordings. Home essays, oral presentations, and mock interviews are designed to emphasize students' management of the Russian discourse.", "completed": false}, {"dept_code": "RUSS", "id": "1900", "course_title": "RUSSIAN INTERNSHIP", "description": "This course places the student in a work setting where they can gain practical experience in a supervised training environment.", "completed": false}, {"dept_code": "RUSS", "id": "1910", "course_title": "READING HISTORICAL RUSSIAN", "description": "This 1-credit mini-course is designed to improve students' ability to read and understand Russian-language texts from the Russian Empire and Soviet Union. It focuses on texts that have never been translated, thus offering a unique glimpse into the past made possible only through investment in language study. It is targeted at students who have completed equivalent of at least 4 semesters of Russian language study, as well as heritage speakers.", "completed": false}], "links": []}