{"nodes": [{"dept_code": "URBNST", "id": "0010", "course_title": "INTRODUCTION TO URBAN STUDIES", "description": "This course serves as the required introduction into the Urban Studies major or as a general course in the social sciences for the non-major. The course explores the problems and potentials of cities by combining the various disciplinary perspectives--economics, Africana studies, history, political science, sociology, and anthropology. As the course is providing the students with the necessary concepts and information to understand cities, the students will be developing their own skills through field trips, debates, group presentations and journal writing.", "completed": false}, {"dept_code": "URBNST", "id": "0030", "course_title": "INTRODUCTION TO GIS", "description": "Geospatial data are digital representations of our physical world. As such, many public policy programs are critically informed by applications of geospatial data. This course will teach students how to acquire, manage, analyze, and visualize spatial data using ArcGIS Desktop. Students will also be introduced to applied data analysis using R. R is powerful, free, and flexible software used in many \"big data\" application. Assignments, applications, and course discussion will emphasize contemporary issues in public policy. Upon completing this course, students should expect to be proficient in basic GIS analysis and prepared for more advanced statistical coursework.", "completed": false}, {"dept_code": "URBNST", "id": "0050", "course_title": "INTRODUCTION TO URBAN RESEARCH", "description": "In this course students will learn and apply a set of basic research and communication skills relevant to work in urban settings. After active participation in the course, students will be able to locate data, analyze in thorough and theory based fashion, and present clearly and persuasively. Skills include defining a research question, questionnaire design and interviewing, finding and interpreting secondary data, using pc based spreadsheet, database and presentation software and participating on a team. Coursework is organized around real world problems.", "completed": false}, {"dept_code": "URBNST", "id": "0100", "course_title": "WORLD URBAN PATTERNS", "description": "On May 23, 2007, for the first time in human history, more of the world's population became urban than rural. This course explores two related aspects of global urbanization: changing patterns of urban growth and urbanization, and similarities and differences in the nature of urban processes at the regional level. This course begins by exploring the causes of urbanization, factors driving urban growth, impacts of globalization, and regional variations in urbanization levels at a variety of scales including the global north and global south. In contrast, the second part of the course focuses on the differences and similarities in the characteristics of the economic, social, demographic, and cultural processes that shape urban places and urban life in different regions of the world. The optics covered include, but are not limited to, residential and commercial gentrification, residential segregation, gates communities, common interest developments, and sustainability.", "completed": false}, {"dept_code": "URBNST", "id": "0108", "course_title": "URBAN ECONOMIC GEOGRAPHY", "description": "Participants in this course will learn about the evolving forms of metropolitan government and governance in the United States, with a special focus on the post-1992 period. Course units examine the history and contemporary shape of urban politics, and the opportunities and challenges facing local communities during the 21st century. By the end of the course students will be able to appraise how the contemporary landscape of regional governance in the United States is affecting specific cities.", "completed": false}, {"dept_code": "URBNST", "id": "0112", "course_title": "SOCIAL JUSTICE AND THE CITY", "description": "Social justice and economic justice are popular buzz-words that are closely tied to urban environments: but what do they really mean, and how can we understand them? URBNST 1612 uses critical social geography to interrogate both historical and contemporary social justice movements that claim to protect human rights, fair housing, or to expand definitions of public space and citizenship. Taken together these agendas form a powerful prescription for social action, one often emerging in urban settings. Using a combination of lectures, Concept Mapping exercises, and case studies, we will examine the historical and theoretical context for social justice in the city and then evaluate different geographies of social change. By the end of the course students will be able to use a critical perspective to understand how the rhetoric of social justice is changing the urban geographies of specific cities worldwide.", "completed": false}, {"dept_code": "URBNST", "id": "0120", "course_title": "URBAN GEOGRAPHY", "description": "The course introduces students to urban geography by addressing both theoretical and empirical areas of interest. Students will engage with material relating to the economic, social and cultural, and historical geographies of urban areas. Students will gain a grounding in the historical and contemporary geographies of city-regions, drawing primarily upon case studies taken from Europe and North America, but also engaging with urbanization and urbanism in from the global South. The course will provide the foundations for advanced Urban Studies modules, field courses and research within the Urban Studies Program. On completion of the module, students will have a clear understanding of the diversity of urban geography as a field of study, will be able to connect theories and concepts with real world case studies and examples, and will be familiar with the approaches and sources used within the subdiscipline.", "completed": false}, {"dept_code": "URBNST", "id": "0140", "course_title": "CRIME, PUNISHMENT, JUSTICE, REINTEGRATION", "description": "This course will focus on the concept of punishment as a response to a criminal act. While in religiously-grounded societies punishment is seen as a retribution for an evil act, tendencies in modernity (and post-modernity) privilege the use of punishment as a tool for social reintegration. With the rise of human rights-based doctrines, the characterization of punishment as retribution has proven to be more and more difficult to justify. Even if sayings such as \"paying my debt to society\" are still in use, it is becoming more and more evident - especially in a time of mass incarceration - how incarceration as punishment cannot be the only solution. This course exposes students to ideas of justice as a process aimed at reintegrating wrong-doers in society through a path of reconciliation and re-socialization, so that the end of the process will produce fellow citizens rather than ex-felons.", "completed": false}, {"dept_code": "URBNST", "id": "0340", "course_title": "URBAN MOBILITY AND TRANSPORTATION ANALYSIS", "description": "This is an issue-oriented course with an emphasis on building transportation planning skills. Students become familiar with the effect of transportation systems on patterns of metropolitan development. Reading assignments discuss theories of transportation geography and planning, methods of empirical analysis, and policy issues as a foundation for skill-building exercises. Students distinguish between different modes of transportation and analyze implications of modal split for urban planning. Class discussions sharpen rhetorical skills while written assignments develop the ability to analyze literature through scholarly criticism.", "completed": false}, {"dept_code": "URBNST", "id": "0900", "course_title": "URBAN RESEARCH SEMINAR", "description": "The Urban Research Seminar focuses the knowledge and skills, which the student has gained through the program, on a particular topic. The specific topic varies from term to term and faculty member to faculty member, but it always concerns an issue of relevance to the immediate Pittsburgh environment. Examples include riverfront development, the impact of Reagan's cutbacks, the redevelopment of East Liberty, etc. To investigate the topic students will review secondary sources as well as collect and analyze their own information through interviews, field trips, surveys, etc.", "completed": false}], "links": [{"source": "0010", "target": "0120"}]}