{"nodes": [{"dept_code": "BUSACC", "id": "0030", "course_title": "FINANCIAL ACCOUNTING", "description": "Helps students become informed users of firms' external financial accounting reports. The basic structure and contents of such reports and the process by which they are prepared will be studied. Discussion will involve what items are included in financial accounting reports, how such items are measured, and how various economic events affect the reports. An understanding of what can be inferred from the reports about the past performance, present position, and future prospects of the firm will be developed.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSACC", "id": "0040", "course_title": "MANAGERIAL ACCOUNTING", "description": "Introduces students to the basic terminology and concepts of cost accounting, including product costing, budgetary control, responsibility accounting, and the use of cost information in resource allocation and other managerial decisions. Textbook material and various applications in actual organizations are used to engage students in applying the concepts and methods that have been developed.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1204", "course_title": "INTERMEDIATE FINANCIAL REPORTING 1", "description": "Covers the conceptual framework of financial accounting and its influence on Generally Accepted Accounting Principles (GAAP), with special emphasis on the valuation of assets and measurement of income.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSACC", "id": "1205", "course_title": "INTERMEDIATE FINANCIAL REPORTING 2", "description": "Topics covered include valuation of liabilities, owners' equity, cash flow statements, and disclosure outside the primary financial statements. Like intermediate financial reporting 1, this course also engages students as active participants in the learning process. Required for all accounting majors.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1210", "course_title": "FINANCIAL STATEMENT ANALYSIS", "description": "Financial statement analysis focuses on the evaluation of publicly traded company financial statements and related note disclosures as well as the correlation of this historic financial performance to the company's stock prices. This course will assist students' development of a systematic approach to analyzing reported financial data and understanding the underlying risks and possible inconsistencies among comparative companies. Requirements of the course include interim exams and written and oral presentations of analysis.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1216", "course_title": "ADVANCED FINANCIAL ACCOUNTING", "description": "Covers topics that are of particular interest to financial report preparers and auditors. Special emphasis placed on accounting for business combinations and consolidated financial reporting. Other topics include international accounting, accounting for partnerships, and accounting by fiduciaries. Required for all accounting majors pursuing the CPA track.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1221", "course_title": "STRATEGIC COST MANAGEMENT", "description": "Topics covered include how product cost measurement affects resource allocation decisions; how to design modern cost systems; the strategic role of cost information and the relationship between process improvement and cost reduction; performance measurement and organizational transformation for value creation.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSACC", "id": "1236", "course_title": "ACCOUNTING INFORMATION SYSTEMS", "description": "Focuses on the design and implementation of accounting information systems and their ability to: collect data on the activities of an organization, accumulate and summarize the data, and make the information available to managers for analysis, decision-making and control.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSACC", "id": "1238", "course_title": "AUDITING", "description": "Introduces auditing process and profession. Main topics include nature and purpose of auditing, auditing standards, professional conduct, auditor legal liability and approaches in auditing financial statements. Emphasizes a risk-based approach to selecting appropriate auditing techniques. Examines auditor's decision process relating to internal control assessment, audit decision process relating to internal control assessment, audit sampling and obtaining audit evidence about financial accounts. Examines extent of auditor's responsibility to uncover fraud.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1242", "course_title": "INDIVIDUAL TAX ACCOUNTING AND PLANNING", "description": "This course focuses on individual tax return preparation and planning. Students will learn how to calculate the taxes associated with a variety of personal, investment, property, and sole-proprietorship transactions. Concepts will be reinforced through the preparation of actual tax returns that reflect different combinations of such transactions. Students will develop tax planning skills by considering how various transactions can be restructured to minimize the current or future tax liability.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSACC", "id": "1296", "course_title": "ACCOUNTING INTERNSHIP", "description": "The accounting internship provides business credits for project assignments that augment a professional accounting work experience.", "completed": false, "prereq_count": 1}], "links": [{"source": "0030", "target": "0040"}, {"source": "1204", "target": "1205"}, {"source": "1205", "target": "1210"}, {"source": "1205", "target": "1216"}, {"source": "1205", "target": "1238"}, {"source": "1205", "target": "1242"}, {"source": "1205", "target": "1296"}]}