{"nodes": [{"dept_code": "BUSHRM", "id": "1050", "course_title": "HUMAN RESOURCES MANAGEMENT", "description": "Provides an introduction to the management of human resources at the organizational level. HRM is viewed as an integral part of the basic management process and the orientation of the course is toward developing managerial skills useful in establishing organizational personnel policy. Specific topics include the role of HR in the management process, HR planning and forecasting, job information systems, recruitment and selection, HR development, compensation, legal framework and evaluation.", "completed": false}, {"dept_code": "BUSHRM", "id": "1670", "course_title": "GLOBAL WORKFORCE MANAGEMENT AND CHANGE", "description": "This course provides a framework for understanding business and legal challenges associated with effective workforce management around the world. We will examine how labor markets in the Americas, Europe and Asia compare in terms of labor costs and supply, workplace culture, and employment law. News events will be used to illustrate the complex cultural and regulatory environment that multi-international firms face in such areas as talent and performance management, offshore outsourcing, downsizing and industrial relations. Finally, we will focus on successful expatriate assignments and globally-oriented careers.", "completed": false}, {"dept_code": "BUSHRM", "id": "1675", "course_title": "HUMAN RESOURCES STAFFING", "description": "Provides an in-depth examination of the organizational staffing process. Procedures for human resource needs assessment such as personnel audits and forecasting are discussed. Recruitment strategies and recruitment sources are explored. The process of organizational choice by candidates may be covered. Emphasis on understanding basic types of assessment tools and procedures for choosing new employees. Core concepts in measurement and validity are discussed. Issues relating to organizational entry and socialization may also be covered.", "completed": false}, {"dept_code": "BUSHRM", "id": "1677", "course_title": "TRAINING AND DEVELOPMENT", "description": "In 2012 U.S. Firms spent $62 billion on training and development programming for their employees. Such programs address the diversity of skills and demographic characteristics of the workforce, the complex technologies that workforce utilizes in the workplace and the competition resulting from ongoing globalization. This course is designed to provide students with an understanding of the strategic advantage gained by a firm as it designs and implements training and development programs. Topics covered include needs assessment, training design, training methods, and evaluation of training. In addition, employee, career and management development and the use of technology in training will be examined.", "completed": false}, {"dept_code": "BUSHRM", "id": "1686", "course_title": "SPORTS MANAGEMENT PROJECT COURSE", "description": "The objective of this course is to provide the student a meaningful experience with a real-world client and problem. Each project is distinct and generally will afford opportunities for a team of students to apply conceptual and analytical skills taught in the CBA major and core classes and to report to the client the result of all assessments. While particular projects may have a primary focus on one functional area (marketing, finance, accounting, human resources, supply chain, business information systems or global management), each will also feature cross functional dimensions.", "completed": false}, {"dept_code": "BUSHRM", "id": "1689", "course_title": "SPORTS MANAGEMENT", "description": "Many students aspire to careers in the NFL, NBA, and major league baseball. But, as we all know, employment prospects in those organizations are decidedly limited. However, a February, 2014 forbes.Com post indicates that the sports industry as a whole will grow by $145.3 billion between 2010 and 2015. This course recognizes that the sports industry is much broader than just professional sports teams including firms in sports clothing, sports equipment, sports drink, sports medicine, venue management, food and beverage, sports media, and sports marketing. The sports industry is a labor intensive industry with human resource and project management skills as key success factors. This class is designed to examine these administrative skills which will serve well you in any of your career pursuits while satisfying your passion for sports. Planned topics, exercises and activities in the course include a look at game day preparations, facilities management including a behind the scenes tour of a facility, player selection (through a draft simulation) and retention, coaching, licensing, sports media, and sports marketing.", "completed": false}, {"dept_code": "BUSHRM", "id": "1690", "course_title": "HUMAN RESOURCES MANGEMENT INTERNSHIP", "description": "The human resources management internship provides business credits for project assignments that augment a professional HRM work experience.", "completed": false}], "links": [{"source": "1050", "target": "1670"}, {"source": "1050", "target": "1675"}, {"source": "1050", "target": "1677"}, {"source": "1050", "target": "1690"}]}