{"nodes": [{"dept_code": "NUR", "id": "0002", "course_title": "NURSING ANATOMY AND PHYSIOLOGY LABORATORY 1", "description": "This laboratory course is designed to provide students with hands-on experience related to the anatomy and physiology of the human body. Laboratory sessions complement the lecture component of NUR 0012. Laboratory instruction emphasizes structure and how it relates to function and the maintenance of homeostasis in the whole body.", "completed": false}, {"dept_code": "NUR", "id": "0005", "course_title": "HONORS FRESHMAN SEMINAR", "description": "Using a flexible format, this course is designed to provide beginning nursing students with an overview of the University Honors College and the honors track within the school of nursing. The purpose of this course is to facilitate the students' exposure to the University of Pittsburgh Honors College environment, and to acquaint them with the opportunities and resources that are available to promote success in the honors track in the school of nursing.", "completed": false}, {"dept_code": "NUR", "id": "0012", "course_title": "HUMAN ANATOMY AND PHYSIOLOGY 1", "description": "This course is designed to present students with a basic foundation in normal human anatomy and physiology. Topics covered are: cell physiology, histology, integumentary, skeletal, muscular, nervous and sensory systems. Emphasis is on the interaction of structure and function and the mechanisms which maintain homeostasis in the human body.", "completed": false}, {"dept_code": "NUR", "id": "0020", "course_title": "PATHOPHYSIOLOGIC FOUNDATIONS OF NURSING CARE", "description": "This course will examine mechanisms that produce disease and injury, the ways in which the body responds to these mechanisms, and the clinical manifestations produced by the body's response.", "completed": false}, {"dept_code": "NUR", "id": "0031", "course_title": "MICROBIOLOGY", "description": "This lecture course will introduce students to the basic properties of bacteria, archaea, eukaryotic microorganisms and viruses, with an emphasis on bacteria. The diversity within the microbial world will be emphasized, as well as their relevance to the health and diseases of humans. Approaches for controlling the growth of microbes in the environment and for preventing the spread of infectious diseases will also be discussed. In addition, students will also become familiar with host-microorganism interactions and host-immune responses.", "completed": false}, {"dept_code": "NUR", "id": "0032", "course_title": "MICROBIOLOGY LABORATORY", "description": "This laboratory course will provide students with hands-on experience in terms of the techniques used to detect, grow, isolate and identify microorganisms.", "completed": false}, {"dept_code": "NUR", "id": "0051", "course_title": "INTRODUCTION TO PROFESSIONAL NURSING", "description": "This course provides a broad overview and synthesis of the issues and trends most relevant to the practice of professional nursing. Historical, contemporary and potential influences on professional nursing practice are reviewed. An emphasis on the unique and varied roles of nurses in today's interdisciplinary health care environment are examined within the context of individual, family, community, and global health. Characteristics and major changes in health care delivery systems (federal, state, and local) are discussed. Components of professional nursing values and core practice competencies are presented. The concept of an evidence-based approach to clinical practice is introduced. Critical thinking strategies are introduced in the context of the nursing process.", "completed": false}, {"dept_code": "NUR", "id": "0066", "course_title": "NUTRITION FOR CLINICAL PRACTICE", "description": "This course focuses on nutrition for clinical practice for nurses. Food for energy and the major nutrients are considered for the promotion of health and for medical nutrition therapy for selected disruptions of health. Emphasis is placed on nutrition assessment and interventions in relation to the goals of the current healthy people document and dietary guidelines for Americans.", "completed": false}, {"dept_code": "NUR", "id": "0067", "course_title": "NURSING RESEARCH: AN INTRODUCTION TO CRITICAL APPRAISAL AND EVIDENCE-BASED PRACTICE", "description": "This course is designed to provide the opportunity for students to become consumers of research and to provide the basis for evidence-based practice and the provision of culturally-congruent care. Students gain an understanding of research processes to the development of nursing knowledge and the contributions of research to evidence based practice Students are expected to critically appraise research articles, to identify useful, valid research that can be applied to nursing practice.", "completed": false}, {"dept_code": "NUR", "id": "0082", "course_title": "NURSING MANAGEMENT OF ADULT WITH ACUTE/CHRONIC HEALTH PROBLEMS", "description": "This course focuses on the nursing care of adults, including older adults, with acute and/or chronic illnesses. Students will be guided in critical thinking exercises and the use of therapeutic interventions and research findings in the management of adults. Nursing process, critical thinking, and decision-making serve as the framework for acquisition of knowledge for the management of patients. Societal and cultural influences will be emphasized.", "completed": false}, {"dept_code": "NUR", "id": "0086", "course_title": "NURSING INFORMATICS", "description": "This course focuses on concepts relevant to the practice of nursing informatics. The course emphasizes information technology applications and the principles of nursing informatics from a current and historical perspective. Learners will examine the analysis of healthcare data and its transformation to nursing knowledge. Nursing language concepts and their importance in clinical information system development will be identified. Learners will examine information technologies that manage clinical information and support patient care. Social and ethical issues in the context of clinical information systems will be examined. The impact of evolving/emerging information technologies on healthcare provider and consumer roles will be discussed.", "completed": false}, {"dept_code": "NUR", "id": "0087", "course_title": "PHARMACOLOGY AND THERAPEUTICS ACROSS THE LIFESPAN", "description": "This course provides an introduction to pharmacology that integrates the concepts of physiology, pathophysiology, chemistry, and nursing fundamentals to build a foundation for administering drug therapy to patients. Using a simple to complex approach, key content areas are presented to help conceptualize the important components related to pharmacology. The basic concepts of pharmacology, such as drug testing and approval, pharmacokinetics and pharmacodynamics, pharmacotherapeutics and toxic effects, dosage calculations, and challenges related to drug therapy, provide the foundation from which drug therapy associated with specific body systems can be addressed. Discussion of the major drug groups focuses on therapeutic actions and indications, mechanism of action, pharmacokinetics, contraindications and precautions, adverse effects, clinically important drug-drug interactions and nursing implications which emphasize the nursing process and focus on patient care and education. Prototypes of the major drug groups are emphasized. Lifespan considerations, evidence for best practice, patient safety, and critical thinking are integrated throughout the course.", "completed": false}, {"dept_code": "NUR", "id": "0088", "course_title": "INTRODUCTION TO BASIC STATISTICS FOR EVIDENCE-BASED PRACTICE", "description": "This course introduces students to descriptive statistics and parametric and nonparametric statistical tests that are commonly used by researchers in the health sciences and appear in published research reports. Emphasis is placed on student mastery of concepts and principles that are fundamental to descriptive and inferential statistics, as well as interpretation and critical appraisal of their use in research studies. Opportunities are provided to manipulate data, perform basic statistical tests, and summarize findings in tabular, graphical, and narrative form.", "completed": false}, {"dept_code": "NUR", "id": "0090", "course_title": "FOUNDATIONS OF NURSING PRACTICE 1 CLINICAL", "description": "This course is designed to provide clinical experiences related to the theory provided in Foundations of Nursing Practice 1. Techniques used in the assessment of the physical, psychological and development dimensions of the individual within an acute care setting are demonstrated. Variations of findings based on influences such as age and culture are identified. Emphasis is placed on the therapeutic interventions of safety, hygiene and comfort, health assessment and health promotion.", "completed": false}, {"dept_code": "NUR", "id": "1020", "course_title": "ADVANCED NURSING MANAGEMENT OF THE ADULT WITH ACUTE/COMPLEX HEALTH PROBLEMS CLINICAL", "description": "This clinical course focuses on the nursing care of adults with acute and complex illnesses in a hospital setting. Emphasis is placed on using the nursing process to assist students with the development of priority nursing goals and in applying critical thinking skills to patient care. The clinical nursing responsibilities include interpretation of diagnostic studies, medical/surgical patient management, evaluation of outcomes, health promotion, and support for individuals and families experiencing acute and complex health problems. This course includes application of cultural diversity awareness training to the nursing process. Clinical learning is focused on developing and refining the knowledge and skills to manage patient care as part of inter-professional teams. Clinical experiences are offered in acute care, critical care, and monitored units.", "completed": false}, {"dept_code": "NUR", "id": "1021C", "course_title": "ADVANCED CLINICAL PROBLEM SOLVING CLINICAL", "description": "This course focuses on the management of the adult who experiences an acute or complex illness with an alteration in multiple body systems. The students' ability to apply the nursing process, using critical thinking skills, is expanded through clinical activities. Collaboration with interdisciplinary health professionals in health promotion and restoration is fostered.", "completed": false}, {"dept_code": "NUR", "id": "1042", "course_title": "NURSING CARE OF CHILDREN AND THEIR FAMILIES CLINICAL", "description": "This course focuses on nursing practice for restoration and maintenance of health in children in various stages of development within their families and the broader social contexts in which children grow and develop. Nursing approaches used in the clinical setting are based on the use of best evidence, developmental perspectives, and cultural competence. The nursing process is applied to the child and family to minimize the effects of stressors which have resulted in a disruption of health. There is an emphasis on critical thinking and decision making as the student applies theory to nursing care.", "completed": false}, {"dept_code": "NUR", "id": "1054", "course_title": "NURSING CARE OF OLDER ADULTS", "description": "This course is designed to ensure competency in providing evidence-based nursing care to older adults and their families, across a continuum of health care settings. Attention is given to the complex interaction of acute and chronic co-morbid conditions, interdisciplinary collaboration, the recognition of risk factors, valid and reliable health assessment, and individualized and evidence-based care for older adults across a continuum of health care settings. The influence of attitudes, age, gender, race, culture, religion, language, lifestyle, technology, and health care policy on the biological, psychological, and social functioning of older adults is considered.", "completed": false}, {"dept_code": "NUR", "id": "1057", "course_title": "NURSING CARE OF MOTHERS, NEWBORNS AND FAMILIES CLINICAL", "description": "This course provides an introduction to the process of childbirth and the dynamics of the childbearing family. It explores the areas of health promotion, physiologic changes associated with pregnancy, high risk conditions associated with pregnancy and the development of the fetus and newborn. Emphasis is on adaptation to the biopsychosocial needs of the childbearing family with sensitivity to the cultural needs and ethical issues of a diverse population. Critical thinking, problem solving, stress adaptation, role, family and nursing theories provide a major focus for understanding childbearing. Clinical experiences reflect a diversity of settings including outpatient, inpatient, and community programs that provide services to the childbearing family.", "completed": false}, {"dept_code": "NUR", "id": "1066", "course_title": "NURSING CARE OF CLIENTS WITH PSYCHIATRIC MENTAL HEALTH PROBLEMS CLINICAL", "description": "This course focuses on nursing practice of health promotion and restoration in individuals with mental health problems. Application of theoretical concepts and nursing interventions is the focus of the clinical experience in acute, chronic, and community mental health settings. Emphasis is placed on understanding the unique contributions of social and cultural factors in the development of treatment plans for clients experiencing psychiatric problems.", "completed": false}, {"dept_code": "NUR", "id": "1074", "course_title": "PROFESSIONAL DEVELOPMENT AND PRACTICUM 1", "description": "This course enables the registered nurse student to further develop critical thinking, leadership abilities, communication and decision-making skills in the development and implementation of an evidence-based clinical capstone project to enhance patient care quality. A systematic approach is used to identify a clinical topic for evidence-based literature review, presentation, and evaluation. Each student identifies specific learning activities for the practicum, which relate directly to a selected culturally diverse environment. Under the guidance of faculty and a clinical preceptor, didactic seminars, assignments, and mentored clinical practicum are used to foster independence and self-direction for all students.", "completed": false}, {"dept_code": "NUR", "id": "1085", "course_title": "ETHICS IN NURSING AND HEALTH CARE", "description": "This course introduces students to the domain of clinical ethics as a foundation for developing ethical expertise in nursing practice. The course focuses on contemporary nursing and health care issues that raise personal and professional ethical concerns. Emphasis is placed on cultural differences, current legislation, political and religious controversy, economic constraints, and professional commitment related to the resolution of the identified ethical dilemmas. The process of ethical analysis and reasoning is used to resolve representative patient and health care situations.", "completed": false}, {"dept_code": "NUR", "id": "1121", "course_title": "ADVANCED CLINICAL PROBLEM SOLVING", "description": "This course focuses on the nursing management of the adult who experiences an acute or complex illness with an alteration in multiple body systems. The students' ability to apply the nursing process, using critical thinking skills, is expanded through classroom and case study activities. Professional competence is enhanced through the utilization of high fidelity human simulation technology.", "completed": false}, {"dept_code": "NUR", "id": "1121C", "course_title": "ADVANCED CLINICAL PROBLEM SOLVING CLINICAL", "description": "This course focuses on the nursing management of the adult who experiences an acute or complex illness with an alteration in multiple body systems. The students' ability to apply the nursing process, using critical thinking skills, is expanded through clinical activities. Collaboration with interdisciplinary health professionals in health promotion and restoration is fostered", "completed": false}, {"dept_code": "NUR", "id": "1134", "course_title": "TRANSITION INTO PROFESSIONAL NURSING PRACTICE", "description": "Students synthesize knowledge about the professional nursing roles and increase their understanding of their responsibility and accountability for the nursing care of individuals, families and aggregates. Theory related to professional nursing roles, patient care management, and leadership is presented. In addition, health care policy related to specific nursing issues is examined.", "completed": false}, {"dept_code": "NUR", "id": "1138", "course_title": "COMMUNITY HEALTH NURSING CLINICAL", "description": "The overall objective of this course is to provide the student with a broad introduction to community health and the role of nursing within this context. Students will experience independence and collaboration with community-based clinicians in a variety of settings. Students will have opportunities to apply epidemiology; health promotion and disease prevention within groups; individual and family case management; community assessment and intervention; environmental hazards; and factors influencing the delivery of and access to community health services at the individual, family, and aggregate levels.", "completed": false}, {"dept_code": "NUR", "id": "1141", "course_title": "HEALTH DISPARITIES IN VULNERABLE POPULATIONS AND ETHNIC CULTURAL GROUPS", "description": "The primary focus of this course is to explore a set of major health disparities affecting diverse racial and ethnic groups (Black or African American, Asian American, Native American, Hispanic or Latinos, American Indian or Alaska Natives and White) living in urban, suburban, and rural settings. Students will learn about the specific health conditions affecting each group, social justice and environmental justice issues affecting their health, and stress-related issues whether it be military, community violence or community environmental issues locally or in the state. The course is designed for undergraduate juniors and seniors and honor students.", "completed": false}, {"dept_code": "NUR", "id": "1142", "course_title": "PROFESSIONAL ISSUES IN ADVANCED PRACTICE NURSING: NURSE ANESTHESIA", "description": "This course is designed to provide the undergraduate nursing student with an understanding of the role of the nurse anesthetist as an advanced practice nurse. Emphasis will be placed on exploring 1) the advanced practice role as a nurse anesthetist, 2) health care policies affecting nurse anesthesia practice, and 3) evidence based practice in nurse anesthesia practice. Students will describe the opportunities and barriers for nurse anesthetists in a variety of practice settings. Students will also explore the implications of health care policies at the national, state and local level on practice.", "completed": false}, {"dept_code": "NUR", "id": "1143", "course_title": "FOUNDATIONS OF PERSONALIZED HEALTH: TRANSLATION FROM BASIC RESEARCH TO CLINICAL PRACTICE", "description": "This course is designed to provide the undergraduate nursing student with a Foundation in Personalized Health Care and to introduce students to many facets of this emerging field. Emphasis will be placed on exploring 1) nursing implications of personalized and precision health care, 2) ethical issues of importance to the field of nursing, 3) next generation methods to tailor precise and personalized treatments, and 4) evidence-based interventions in personalized health care. Students will immerse themselves in the clinical settings and research areas related to personalized health care. Student will explore the implementations of personalized health care, a predictive, preventive, and patient-centered approach treatment.", "completed": false}, {"dept_code": "NUR", "id": "1221C", "course_title": "ADVANCED CLINICAL PROBLEM SOLVING CLINICAL", "description": "This course focuses on the nursing management of the adult who experiences an acute or complex illness with an alteration in multiple body systems. The students' ability to apply the nursing process, using critical thinking skills, is expanded through clinical activities. Collaboration with interdisciplinary health professionals in health promotion and restoration is fostered.", "completed": false}, {"dept_code": "NUR", "id": "1234C", "course_title": "TRANSITION INTO PROFESSIONAL NURSING PRACTICE CLINICAL", "description": "This course is designed to facilitate the transition into professional practice through the preceptorship with registered nurses in a variety of settings. Students synthesize knowledge about the professional nursing roles and increase their responsibility and accountability for the nursing care of individuals, families and aggregates.", "completed": false}, {"dept_code": "NUR", "id": "1250C", "course_title": "NURSING CARE OF MOTHERS, NEWBORNS AND FAMILIES CLINICAL", "description": "This course provides an introduction to the process of childbirth and the dynamics of the childbearing family. It explores the areas of health promotion, physiologic changes associated with pregnancy, high risk conditions associated with pregnancy and the development of the fetus and newborn. Emphasis is on adaptation to the biopsychosocial needs of the childbearing family with sensitivity to the cultural needs and ethical issues of a diverse population. Critical thinking, problem solving, stress adaptation, role, family and nursing theories provide a major focus for understanding childbearing. Clinical experiences reflect a diversity of settings including outpatient, inpatient, and community programs that provide services to the childbearing family.", "completed": false}, {"dept_code": "NUR", "id": "1252C", "course_title": "NURSING CARE OF CHILDREN AND THEIR FAMILIES CLINICAL", "description": "This course focuses on nursing practice for restoration and maintenance of health in children in various stages of development within their families and the broader social contexts in which children grow and develop. Nursing approaches used in the clinical setting are based on the use of best evidence, developmental perspectives, and cultural competence. The nursing process is applied to the child and family to minimize the effects of stressors which have resulted in a disruption of health. There is an emphasis on critical thinking and decision making as the student applies theory to nursing care.", "completed": false}, {"dept_code": "NUR", "id": "1640", "course_title": "LEADERSHIP IN MILITARY NURSING", "description": "This elective course is designed to enhance nurse cadets' leadership ability and technical competence. This course has two components: leadership training and precepted clinical experience.", "completed": false}, {"dept_code": "NUR", "id": "1680", "course_title": "INTRODUCTION TO GENETICS AND MOLECULAR THERAPEUTICS", "description": "This is an introductory course that focuses on the fundamentals of genetics. The course is designed to give the student a basic understanding of genetic concepts so that this knowledge can be utilized to understand current and future genetic theories and therapeutics.", "completed": false}, {"dept_code": "NUR", "id": "1710", "course_title": "APPLIED ADULT CARDIOPULMONARY CRITICAL CARE", "description": "The purpose of this course is to provide students with the opportunity to synthesize and apply concepts related to the cardiopulmonary assessment and multidisciplinary management of critically ill adults. Through the use of presentations and laboratory sessions, the student will explore the pathophysiologic basis of critical cardiopulmonary instability, physical and technologic assessment parameters, and treatment modalities commonly utilized in the care of these patients in the intensive care unit. Interactive laboratory demonstration of vasoactive drugs, arterial, central venous and pulmonary artery monitoring, artificial airways, mechanical ventilation and rhythm strip interpretation will be provided. Critical clinical decision making and nursing responsibilities specific to dysrhythmia interpretation are addressed, including institution of appropriate immediate nursing intervention, pharmacological, and electrical therapeutic interventions based on advanced cardiac life support (ACLS) algorithms. Further, students will have the opportunity to synthesize and apply this information within patient care scenarios of respiratory and cardiac instability.", "completed": false}, {"dept_code": "NUR", "id": "1765", "course_title": "RISK FACTORS AND HEALTH", "description": "The overall objective of this course is to provide the student with a broad description of risk factors and health promotion for individuals, families and communities. Current federal, state and professional organization guidelines and recommendations for health promotion and disease prevention are applied. Current research on the efficiency of health promotion activities is presented.", "completed": false}, {"dept_code": "NUR", "id": "1829", "course_title": "CONTEM ISSUES CROSS CULTL HEALTH", "description": "Purpose of course is to increase awareness of how delivery and acceptance of health care may be influenced by social, cultural, and environmental factors. It will provide an overview of how these factors influence a person's response to stressors, daily health and living needs. Goal is to help students increase their understanding of culturally congruent care by utilizing cultural concepts, theories, and research. Students will analyze factors that facilitate/ hinder communication about health needs, acceptance of the health care regimen, and access to health care systems.", "completed": false}, {"dept_code": "NUR", "id": "1990", "course_title": "SENIOR SEMINAR", "description": "The goal of this course is to support the senior student's successful progression to entry-level professional nursing practice. Classroom activities and self-directed learning will prepare students to attain the benchmarks associated with professional licensure and provide a foundation for the continuous self-evaluation and life-long learning required to support professional nursing practice (AACN, 2008).", "completed": false}], "links": [{"source": "0020", "target": "0067"}, {"source": "0020", "target": "0082"}, {"source": "0020", "target": "0087"}, {"source": "0031", "target": "0032"}, {"source": "0067", "target": "1074"}, {"source": "0082", "target": "1054"}, {"source": "0082", "target": "1085"}, {"source": "1121", "target": "1121C"}, {"source": "1121", "target": "1221C"}, {"source": "1134", "target": "1234C"}]}