{"nodes": [{"dept_code": "CHIN", "id": "0001", "course_title": "FIRST YEAR CHINESE 1", "description": "This is the first term of first year chin language course intended for those who have no or little experience in this language. This course helps students to develop basic oral and written proficiency and understand the basics of chin language and culture. Students are expected to be able to converse in limited daily life situations and write short paragraphs on personal topics. Class activities will consist of pair work, group work, and presentations on the course materials and other level appropriate authentic materials.", "completed": false}, {"dept_code": "CHIN", "id": "0003", "course_title": "SECOND YEAR CHINESE 1", "description": "The course aims to enhance student's abilities for speaking accurately and appropriately in increasingly challenging situations, reading and understanding narrative and descriptive texts and the relevant cultural aspects, writing short narrative paragraphs with proper discourse connectors, and conversing on a wider range of personal topics with some sophistication. This course includes recognition and production of 350 characters presented in both traditional and simplified versions. Students should have control of a cumulative total of 1,000 characters by the end of the term.", "completed": false}, {"dept_code": "CHIN", "id": "1009", "course_title": "THIRD-YEAR CHINESE 1", "description": "The course aims to enhance student's abilities for speaking accurately and appropriately in challenging situations, reading and understanding original texts of different types, writing short essays on various topics with discourse connectors and idiomatic expressions, and conversing on both personal and non-personal topics with sophistication at discourse level. Students in this course should be aware of relevant Chinese traditions and perspectives and be able to make comparisons and connections with other cultures.", "completed": false}, {"dept_code": "CHIN", "id": "1040", "course_title": "LITERARY CHINESE 1 CLASSICAL", "description": "This is a course in classical Chinese whose purpose is to acquaint the student with the language and syntax of classical Chinese.", "completed": false}, {"dept_code": "CHIN", "id": "1050", "course_title": "FOURTH YEAR CHINESE 1", "description": "This is an advanced language course which concentrates on reading current journalistic writings such as news reports, periodicals, articles and editorials.", "completed": false}, {"dept_code": "CHIN", "id": "1085", "course_title": "INTRODUCTION TO EAST ASIAN CINEMA", "description": "This course investigates the ways in which film addresses and treats the major socio-cultural issues in modern society through a critical study of the works of Chinese and Japanese master filmmakers. The course focuses on changes in marriage and family patterns, women's roles and the plight of youth.", "completed": false}, {"dept_code": "CHIN", "id": "1088", "course_title": "NEW CHINESE CINEMA", "description": "Students will study Chinese films made by filmmakers of mainland China and Taiwan. They will learn about origins, development, themes, and styles with major directors and important films of new Chinese cinema being studied. Students will have an opportunity to understand contemporary Chinese culture and society.", "completed": false}, {"dept_code": "CHIN", "id": "1089", "course_title": "THE WORLD OF CHINA", "description": "This course will survey the wax and wane of pop culture through disparate phases of social and political developments of modern china. The readings will introduce students to works of literature, art, and film to see how tradition and modernity, elite and mass cultures, East and West conflict and converge; how china absorbs, adapts as well as resists capitalistic modernity while embracing global market economy; how china grapples with urban alienation, social flux, moral laxity and other negative aspects of industrialization and urbanization. The course will make available to students a host of art images, dvd clips and e-texts to enhance and expand their perception of modern china.", "completed": false}, {"dept_code": "CHIN", "id": "1090", "course_title": "GREAT MINDS OF CHINA", "description": "First segment on Confucianism, including the Analects and Menicus, will be studied with relevant commentaries, stressing implications for Chinese culture, especially in ethical and socio-political dimensions. Second segment on Taoism, lao Tzu and Chuang Tzu, will be studied with emphasis on impact on the arts and literature. Final segment on Buddhism will concentrate on representative sutras of the tradition, diamond sutra and texts from the Chan (Zen) master's.", "completed": false}, {"dept_code": "CHIN", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false}], "links": [{"source": "1009", "target": "1040"}]}