{"nodes": [{"dept_code": "ADMJ", "id": "0100", "course_title": "INTRODUCTION TO LAW, CRIMINAL JUSTICE, & SOCIETY", "description": "This course introduces students to socio-legal theory related to the nature of crime, criminalization, and the purpose of punishment in the American criminal justice system. We use theory to explore and evaluate the workings of criminal justice institutions in a broader societal context, including how criminal justice compares with other institutions of social control/welfare (e.g. the education system). We also learn and apply major approaches to law & society in order to interrogate broader issues concerning law's intersection with societal values, power, and inequality. In so doing, we explore the nature, strengths, and limitations of legal reasoning and its application to the criminal justice issues examined throughout the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "0500", "course_title": "INTRODUCTION TO ADMINISTRATION OF JUSTICE", "description": "Introductory course designed to provide the student with basic information on the criminal justice system. Views the criminal justice system as consisting of six sub-systems; police, prosecution, courts, corrections, probation and parole. Explores law and society in general, the history, structure, function and contemporary problems in each major sub-system. Also explores the trend of the criminal justice system and the directions and implications involved.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "0600", "course_title": "INTRODUCTION TO CRIMINOLOGY", "description": "This course provides an overview of the study of the causes and social responses to crime. It examines legal definitions and elements of crime; surveys major categories of crime, i.e., Predatory and non-predatory acts; reviews major measures of crime; identifies major correlates and theories of crime; differentiates types of offenders and evaluates the working of the criminal justice system.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1100", "course_title": "CRIME SCENE INVESTIGATION", "description": "This course provides students with an overview of crime scene investigative issues and problems, as well as techniques used in the collection, preservation, analysis, and utilization of physical and testimonial evidence in criminal prosecutions. Topics include forensic photography, crime scene collection equipment, canvassing, and interrogation techniques in investigations of robbery, burglary, assault, and homicide crimes.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1115", "course_title": "CRIMINALISTICS", "description": "This course introduces students to the scientific tools of analysis of crime scene evidence. Topics include toxicology, hair, fiber, blood, DNA, fingerprint, and firearms analysis, as well as cause of death issues such as sexual homicides, suicides, and assisted suicides, drug and carbon monoxide poisoning, accidental deaths, and blunt force trauma deaths. The class consists of integrated lecture and lab each week. The laboratory activities require only basic calculations.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1118", "course_title": "CRIMINALISTICS LAB", "description": "This is an optional lab for students enrolled in administration of justice 1115. Designed for non-science majors, the lab will introduce students to the basic principles of chemistry, biology, and physics as they are used on a daily basis in criminal investigations. Topics include: identification of hair and fibers, DNA, and chromatography. These and other techniques are then applied to a simulated drug bust, a kidnapping case, and a suicide/homicide investigation.", "completed": false, "prereq_count": 1}, {"dept_code": "ADMJ", "id": "1200", "course_title": "INTRODUCTION TO LAW ENFORCEMENT", "description": "Introduces various historical and philosophical approaches to law enforcement. Course explores origins of policing; philosophical positions on nature of law enforcement and its justification; comparisons of various types of policing in different historical epoch; and emergence of bureaucratized urban force. Topics include development of law enforcement from ancient times with emphasis on philosophical approaches to policing in U.S.; Introduction to constitutional issues and problems.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1210", "course_title": "JUVENILE DELINQUENCY", "description": "Provides an overview of the field of juvenile delinquency. Topics covered include theories and research on causes of juvenile delinquency; law enforcement practices encountered in attempts to control delinquency; juvenile treatment under law; correctional philosophy and practices in juvenile justice; and impacts of juvenile criminality upon the rest of society. Students emerge from the course with knowledge of causes, prevention, treatment, and control of juvenile delinquency and should be prepared to move into more detailed study of this subject.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1220", "course_title": "DEVIANCE AND THE LAW", "description": "This course will examine the concept of deviant behavior and how departing from socially acceptable norms in legal, social and institutional settings sparks certain emotional reactions from those who encounter or experience it. The course will also, identify what is deviancy, types of deviant behavior, who engages in it, what causes it and how in certain circumstances it violates the law by considering the characteristics of the deviant person from both a socio-cultural and historical perspective. In addition, it will outline various theories to deviant behavior.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1225", "course_title": "THE JUVENILE JUSTICE PROCESS", "description": "Presentation, discussion and analysis of the nature of the juvenile justice process, legal steps required in processing juveniles, nature and operation of juvenile justice institutions, interrelationships between parts of the system, and problems and prospects for their solution.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1230", "course_title": "WHITE COLLAR CRIME", "description": "This course examines the meaning, varieties, and extent of \"white collar crime\" in America. It investigates the developmental history of this concept, theories of white collar crime causation, specific types of white collar crime, empirical and theoretical controversies surrounding white collar crime, and the probable future directions for this type of criminal behavior.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1234", "course_title": "INTRODUCTION TO CYBERCRIME", "description": "Traditionally, crime has taken place in the physical world. Since the dawn of the internet, criminal activities on the web have been continually increasing. Crime is no longer restricted to a town, city, state or even country as the internet crime transcends all different types of jurisdictions.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1235", "course_title": "ORGANIZED CRIME", "description": "This course is designed to examine the history of organized crime not only within the United States, but from an international perspective as well. The emergence of \"non-traditional\" groups which are competing for power and profits will be examined, as well as the alliances between various criminal groups that have evolved, resulting in the phenomenon of \"transnational\" organized crime. Those \"non-traditional\" groups include, but are not necessarily limited to, domestic and international terrorist organizations, the reasons for their development as well as the perceived risk to American citizens both in a domestic environment and abroad. Neither organized crime nor a terrorist organization can be effectively discussed without integrating the evolution of US drug policy, which will be included. Finally, the various government tactics implemented to counter the threats mentioned herein as well as the impact on the private sector will be integrated into lectures throughout the program.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1236", "course_title": "INTERNATIONAL ORGANIZED CRIME", "description": "Organized crime is no longer confined to a few countries such as Italy, the United States, and Japan. During the 1980s and 1990s it has become much more pervasive, and has had a major impact in countries in transition; turkey, Mexico, and South Africa. This course looks at the dynamics of organized crime, explains why it develops in particular countries, the various forms it takes, and the responses of law enforcement agencies and international institutions.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1238", "course_title": "CYBER SECURITY, LAW, AND MONEY LAUNDERING", "description": "This course will examine the scope of cyber-crime and its impact on today's system of criminal justice. Similarly, the vulnerabilities to cyber-assault will be examined. Topics include the use of computer technology to commit crimes such as \"hacking\" and other computer based criminology, as well as means of committing more traditional violations of law. Also included will be an analysis of the legal considerations facing law enforcement and other cyber-security professionals who are tasked with meeting the challenges of discovering, investigating and prosecuting cyber-crimes. Since our economy and security enterprises are so dependent on the electronic dissemination of information, effective measures to secure this vital resource will be explored. Given the fact that funds are transferred electronically, the electronic transmission of finances will be examined as well as the more basic methods of raising funds and laundering same to advance terrorist activities throughout the world.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1242", "course_title": "GENDER, RACE, CLASS, AND CRIME", "description": "Gender, race and class are overlapping categories of experience that affect all aspects of life. There is perhaps no other context in which the effects of gender, race and class are as acutely evident as in the criminal justice system. That is, the people who are processed through the criminal justice system are disproportionately male, nonwhite, and from the lower classes. This class is designed to examine the cumulative and interlocking effects of gender, race, and class on crime.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1245", "course_title": "TERRORISM", "description": "This course focuses upon the social, political, economic and philosophical reasons for the development and spread of terrorism throughout the world, and examines potential dangers inherent in these practices and possible means of solutions to them. Special attention will be given each term to domestic and international acts of terror that affect American citizens, interests, and policies.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1300", "course_title": "INTRODUCTION TO CORRECTIONS", "description": "Introduces various historical and philosophical approaches to corrections. Course explores origins of correctional institutions and evolution of correctional practices in contemporary society. Emphasis on modifications of institutional practices in contemporary society and development of new strategies as alternatives to incarceration. Various methodologies applicable to homogeneous and heterogeneous population groupings of offenders are examined taking into account individual characteristics and differences.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1400", "course_title": "INTRODUCTION TO CRIMINAL LAW", "description": "Acquaints the student with basic principles of criminal law derived from our English common law heritage and from more recent statutory penal code revisions in the American states. Course examines the meaning of crime and of criminal complicity and conspiracy; sentencing alternatives; and the decriminalization of some crimes.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1410", "course_title": "INTRODUCTION TO CRIMINAL PROCEDURE", "description": "This course examines the procedural effects of criminal law, including constitutional rights, state criminal procedure, and appellate decisions and rules.", "completed": false, "prereq_count": 0}, {"dept_code": "ADMJ", "id": "1450", "course_title": "CRITICAL ISSUES IN CRIMINAL JUSTICE", "description": "Analyzes contemporary issues relating to policies, goals, and procedures of all criminal justice agencies. Topics covered include trends and controversies regarding law enforcement activities, the changing role of police, police court controversies, standards and goals, future trends in criminal justice, manpower utilization, organizational changes, long-range planning, and projections for future of police agencies.", "completed": false, "prereq_count": 0}], "links": [{"source": "1115", "target": "1118"}]}