{"nodes": [{"dept_code": "PSY", "id": "0010", "course_title": "INTRODUCTION TO PSYCHOLOGY", "description": "Summary of our present knowledge in fundamental areas of learning, sensation and perception, biological basis of behavior, developmental patterns, motivation, emotion, personality and adjustment, and measurement of behavior. Information and concepts are applied to problems in understanding human behavior. Additional out-of-class experiments or an equivalent research paper are a part of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "0011", "course_title": "INTRODUCTION TO THE FIELD", "description": "This one-credit course is designed for newly declared psychology majors. Course content will provide an introduction to the psychology department, a review of experiential learning opportunities, a discussion of graduate school and career options including subfields within psychology and related fields, and out of the classroom exercises. Through lectures, guest speakers, in-class exercises, small group discussions and written assignments, students will engage in self-assessment, undertake academic and career planning, develop professional skills and learn to utilize available resources to advance in their careers.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "0036", "course_title": "RESEARCH METHODS LECTURE", "description": "This course introduces students to the fundamentals of psychological research. Specifically, the goals are to learn how to: a) read, interpret, and understand research; b) critique research; and c) design valid research that is robust to critiques.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0037", "course_title": "RESEARCH METHODS LABORATORY", "description": "The course amplifies the introduction to the fundamentals of psychological research provided by PSY 0036, Research Methods Lecture. It introduces students to the fundamentals of writing scientific reports in psychology. Students will learn how to use APA style, how to display and report quantitative results, and basic guidelines for writing format, style, and expression. This course is writing intensive, and students are expected to write research reports and comment extensively on the writing of their peers during in-class and take-home exercises.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "0105", "course_title": "INTRODUCTION TO SOCIAL PSYCHOLOGY", "description": "An overview of social psychology. The scientific study of how one person's behavior and/or characteristics can influence the thoughts, feelings and behaviors of others. Topics covered include social perception, attitude formation and change; prejudice and discrimination; altruism and aggression; cooperation, competition, and bargaining; group decision making, leadership; and environmental effects on behavior.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0160", "course_title": "PSYCHOLOGY OF PERSONALITY", "description": "Survey of major approaches to the study of personality, focusing on their relative abilities to provide coherent explanations for individual behavior. Issues involved in the assessment of personality will also be discussed and several assessment procedures evaluated. Recent research in personality psychology is reviewed and analyzed.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0184", "course_title": "PSYCHOLOGY OF GENDER", "description": "This course is an introduction to psychological theories and research on the impact of gender on the human experience. Experiences of cisgender men and women as well as trans individuals and those who identify outside of the gender binary will be discussed. Although the focus will be on societal constructs within the United States, we will also discuss cross-cultural research. Intersections with race and sexual orientation and the influence of power will be considered in the discussion of the effects of cultural factors that determine the gendered nature of cognitive abilities, emotional expression, interpersonal relationships, victimization, labor, and health.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0205", "course_title": "PSYCHOPATHOLOGY", "description": "This course provides an overview of the major issues in the area of mental illness. This course emphasizes the scientific approach to understanding the major psychological and behavioral disorders. The research and clinical literatures regarding the etiology, course and treatment of these disorders will be presented.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0310", "course_title": "DEVELOPMENTAL PSYCHOLOGY", "description": "The course focuses on development of the child from birth to adolescence, the current theory and research concerning social, emotional, intellectual, perceptual and language development. The organization of the course is topical. Coverage is confined to normal development; what develops, how and why in the average child. Little attention to abnormal development.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0407", "course_title": "LEARNING AND BEHAVIOR", "description": "This course elucidates fundamental principles of learning and motivation as derived predominantly from animal research. Focus is given to the empirical and conceptual processes underlying the facilitation and suppression of behavior, e.g. primary and conditioned reinforcement, non-reinforcement, punishment and avoidance as well as the generalization and discrimination of these processes.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "0422", "course_title": "COGNITIVE PSYCHOLOGY", "description": "This course introduces students to core issues, theories, and experimental finding in cognitive psychology. Topics to be covered include sensory perception, attention, memory, imagery, language, reasoning, problem solving and decision making.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0423", "course_title": "COGNITIVE PSYCHOLOGY LAB", "description": "This course exposes students to the details of experimental methods in cognitive psychology, with a particular focus on experimental laboratory studies. Students will also improve their understanding of research report writing, computer skills, and quantitative data analysis skills. The course is organized according to the research process, which is implemented twice across two projects. For each project, students read background literature, develop research hypotheses, design experiments to test them, conduct the experiments, analyze the results, and write-up the experiments.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "0505", "course_title": "INTRODUCTION TO BIOPSYCHOLOGY", "description": "This is a survey course in which the biological bases of certain classes of behavior are explored. The behaviors studied are limb movement, sleep and wakefulness, feeding, sexual behavior and learning and memory. Each of these behaviors is considered from the point of view of which brain structures and which neurotransmitters are involved in the production of that behavior. Emphasis is also placed on experimental techniques used to obtain relevant data and on the type of inferences which can be made from these experiments.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "0510", "course_title": "SENSATION AND PERCEPTION", "description": "This course examines the nature of the mechanisms that transform sensory input into our perceptual experience of the world. Physics helps us to understand our environment, and biology helps us to understand ourselves. The investigation of sensation and perception combines physics and biology so that we can understand how environmental phenomena, as perceived by our senses, influence our understanding of the world. This course examines how the human brain receives and processes information from our environment and explores the functioning of human sensory systems and how physical stimuli are transformed into signals that can be understood by the nervous system. Topics covered in the course include vision, audition, taste, smell, touch, and basic psychophysics.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1050", "course_title": "TOPICS IN PSYCHOLOGY", "description": "A topics course. Content will vary from term to term depending on instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1052", "course_title": "TOPICS IN CLINICAL PSYCHOLOGY", "description": "Topics in clinical psychology will vary from term to term, depending on instructor.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1054", "course_title": "TOPICS IN COGNITIVE PSYCHOLOGY", "description": "Topics in cognitive psychology will vary from term to term, depending on instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1059", "course_title": "TOPICS IN ADVANCED RESEARCH METHODS", "description": "This course involves the practical application of theories, concepts, and scientific methods to generate testable hypotheses, identify appropriate methodology, select and operationalize appropriate variables, conduct a small scale research project, conceptualize relevant data analyses, and engage in writing assignments involving analysis, interpretation, and critical evaluation of results. Research topics are specific to and will vary from section to section.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1110", "course_title": "PSYCHOLOGICAL ASPECTS OF HUMAN SEXUALITY", "description": "The course presents a social-psychological and psycho-biological orientation towards the study of human sexuality. Current research is emphasized. Topics such as sexual attitudes, hormones and behavior, changing sexual behavior, sex education, gender-role development, alternative forms of sexual expression, and violence and sex are covered.", "completed": false, "prereq_count": 3}, {"dept_code": "PSY", "id": "1112", "course_title": "PSYCHOLOGICAL ASPECTS OF HUMAN SEXUALITY: RESEARCH WRITING PRACTICUM", "description": "This course presents a social-psychological and psychobiological orientation towards the study of human sexuality. Current research is emphasized. Topics such as sexual attitudes, hormones and behavior, changing sexual behavior, sex education, gender-role development, alternative forms of sexual expression, and violence and sex are covered", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1145", "course_title": "SOCIAL RESEARCH ADVANCED LAB", "description": "This is a laboratory course that will focus on research methods in the area of social psychology. As a student in this course, you will complete in-class activities as well as individual and small group assignments designed to prepare you for conducting research in social psychology. Course requirements include oral presentations and written assignments. Students will critique empirical journal articles, complete small group assignments that explore a variety of research designs, develop an independent research proposal based on a prominent social psychological theory, and collect and analyze data to test a hypothesis that extends upon a published empirical paper relevant to social psychology.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1210", "course_title": "INTRODUCTION TO CLINICAL PSYCHOLOGY", "description": "This course is directed toward the student seriously interested in the major issues pertaining to clinical psychology. The course provides an overview of the major therapeutic approaches and incorporates other germane issues such as history of the field, assessment issues, interviewing approaches, community psychology, behavioral medicine, and clinical research and methodology. Present therapeutic approaches are placed in the context of an evolving discipline, anchored in an empirical-scientific approach to the subject matter.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1215", "course_title": "HEALTH PSYCHOLOGY", "description": "This course provides an introduction to the major questions and methods which have guided the research in health psychology. This field examines the role of psychological and social factors in the development and progression of medical disease. Three main topics are covered: (1) conceptual underpinnings of health psychology, (2) psychosocial factors and specific diseases, and (3) evaluating behavioral medicine interventions.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1230", "course_title": "PSYCHOLOGY OF DEATH AND DYING", "description": "The purpose of this course is to widen the student's understanding of human death in its biological, socio-cultural, and primarily psychological dimensions. We will examine the concept of death, psychological reactions to death and dying, historical and demographic aspects, selected issues such as end-of-life care, medical ethics, suicide, legal concerns, children's concepts of death, and the process of bereavement.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1305", "course_title": "EXPERIMENTAL CHILD PSYCHOLOGY", "description": "This course introduces students to the scientific basis of theories and issues in developmental psychology. In lectures, discussion and structured experiments students learn about and apply basic methods of research in child development, including conceptualization, design, data collection, analysis and write-up. This course exposes students to development over infancy and childhood. The actual topics under study may vary by semester and include gender role development, cognitive development, and language development.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1315", "course_title": "DEVELOPMENTAL PSYCH: INFANCY", "description": "This course will explore how infants develop from conception to approximately age three. Topics that will be covered include motor development, social development, emotional development, perceptual development, and cognitive development. The course will also explore how knowledge about infant development is applicable across disciplines and careers.", "completed": false, "prereq_count": 2}, {"dept_code": "PSY", "id": "1320", "course_title": "LANGUAGE DEVELOPMENT", "description": "What does mastering a language look like and how do human children do it so quickly while animals do not? What happens if children are deprived of language? Is language special, or is it part of our general cognitive ability? We will examine all these questions and, in the process, learn about typical language development and the methods used to study it.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1321", "course_title": "AUTISM SPECTRUM DISORDER", "description": "This course will be devoted to a discussion of psychological theory and research in ASD. Topics to be covered include the early history of the study, diagnosis, and treatment of autism; current classification and diagnostic issues and techniques; epidemiological and etiological issues; major neurological and psychological theories of ASD; research on sensory atypicalities and stereotyped and repetitive motor behaviors, early identification, early social and communicative skills, affective, attentional, symbolic, and social factors; and intervention issues in ASD.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1326", "course_title": "CULTURE, PARENTING AND LITERACY", "description": "The course focuses on positive development of minority children and their families and takes a strengths-based approach to studying them. Students examine different sources of evidence of whether and how sociocultural factors and parenting practices shape children's language and literacy development. Students discuss evidence-based interventions at home and school that aim to improve children's language and literacy skills, particularly in low-income and ethnically diverse communities. Class sessions involve a combination of lectures and group discussion based on empirical articles, book chapters, press articles, and videos. Students complete individual assignments.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1330", "course_title": "DEVELOPMENTAL PSYCHOLOGY: COGNITIVE DEVELOPMENT", "description": "This course covers major areas of cognitive and intellectual development spanning infancy, childhood, adolescence and old age. Topics covered include perception, language, memory, attention, and higher order cognition", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1471", "course_title": "MAPPING HUMAN BRAIN CONNECTIVITY TECHNOLOGY BASIC RESEARCH AND CLINICAL APPLICATIONS", "description": "This course covers use of a novel Pittsburgh developed High Definition Fiber Tracking (HDFT) technology providing human brain connectivity with unprecedented fidelity. The technology maps a million streamlines (0.1mm diameters sets of axons) per person providing 93 miles of tracts within the head involving 40 tracts connecting 170 brain areas. We can follow tracts from source to destination mapping projection fields with high accuracy. The fibers can be visualized and quantified providing circuit diagrams of cortical networks. These techniques will advance the study of brain systems, disorders, development, neuropathology, and neurosurgery. Students will perform projects individually or in groups analyzing collected data or developing new analysis or biomedical methods. Students can do projects that are cognitive neuroscience studies of a brain system or technical development of new methods. Sample projects might include mapping a sensory system, developmental assessment or automated brain segmentation and circuit tracing and detection of clinical anomalies (e.g., TBI breaks, tumors). Technical projects might involve better fiber reconstruction, tracking, tract segmentation or developing new visualization or statistical projects. Students must have some statistics and research experience/course work.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1472", "course_title": "NEUROPSYCHOLOGY OF BRAIN INJURY", "description": "This advanced research laboratory course will give students authentic and hands-on experience with the collection and analysis of behavioral and brain imaging data from individuals with brain damage due to stroke. Students will be assigned to a 3-person project team throughout the course. During class sessions, students will receive instruction and opportunities for hands-on practice of the component skills covered in a given week. Students will be expected to draw upon this instruction to complete a series of out-of-class requirements. The first quarter of the course will prepare students to administer a set of tasks assessing math and language abilities to individuals with localized brain damage due to stroke, and prepare project teams to assist with the collection of brain imaging data. In the second quarter of the course, each project teams will collect behavioral and brain imaging data from three research participants. In the third quarter of the course, students will learn how to code the behavioral and brain imaging data, and will use this knowledge to enter their results into a project database. In the final quarter of the course, students will learn methods for examining the relationship between the location of brain damage and its effects on cognitive abilities, and each team will use this knowledge in combination with available data to construct a final course presentation. The course is synergistic with a research project funded by the National Science Foundation on the brain basis of math and language abilities. The data collected by students in the course will eventually be incorporated into scientific publications and made publicly available to the scientific community. Students must have sufficient weekend availability to complete the required participant testing, provide evidence of a highly responsible work or research track-record, and have the motivation to commit 6-9 hours of time outside of the classroom each week.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1635", "course_title": "ORGANIZATIONAL PSYCHOLOGY", "description": "This course will provide broad exposure to the field of organizational psychology. We will cover concepts of leadership, motivation, group dynamics, personality, organizational development strategies, and other behavioral aspects involved in the effective management of an organization through readings, lecture, video, discussion, and case analyses. The emphasis is on building a sound grasp of leadership practice, and on developing the ability to apply such knowledge to actual business problems. The class format will include multiple hands-on assignments to assist the student in understanding how psychological theories can be applied in a work context.", "completed": false, "prereq_count": 1}, {"dept_code": "PSY", "id": "1900", "course_title": "SUPERVISED FIELD PLACEMENT", "description": "Psychology majors may receive up to 3 credits for field experience in supervised agencies in the community. The experiences vary from term to term.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1903", "course_title": "DIRECTED INDIVIDUAL RESEARCH S/NC", "description": "This course involves student participation in individual experimental research supervised by a member of the faculty. This course is particularly valuable for students interested in graduate study in psychology.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1950", "course_title": "PSYCHOLOGY SENIOR SEMINAR", "description": "This one-credit course is designed for psychology majors in their final year of study (either final or next-to-final term). Course content will include exploration of the field of psychology, self-assessment of learning experiences, identification of marketable skills for career and graduate school paths, and planning for transition to post-college life.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1970", "course_title": "UNDERGRADUATE TEACHING ASSISTANT EXPERIENCE", "description": "This course involves student participation as an undergraduate teaching assistant (UTA) for a psychology course under the supervision of a faculty member.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1973", "course_title": "HONORS DIRECTED RESEARCH", "description": "This is the first term of research in preparation for the honors major in psychology. Development of the research problem and approval of the theses prospectus.", "completed": false, "prereq_count": 0}, {"dept_code": "PSY", "id": "1975", "course_title": "HONORS THESIS/MAJORS", "description": "Undergraduate honors majors in psychology will register for this course when their thesis proposal has been approved and they are ready to conduct and write up the research.", "completed": false, "prereq_count": 0}], "links": [{"source": "0010", "target": "0036"}, {"source": "0010", "target": "0037"}, {"source": "0010", "target": "0105"}, {"source": "0010", "target": "0160"}, {"source": "0010", "target": "0184"}, {"source": "0010", "target": "0205"}, {"source": "0010", "target": "0310"}, {"source": "0010", "target": "0422"}, {"source": "0010", "target": "0423"}, {"source": "0010", "target": "0505"}, {"source": "0010", "target": "0510"}, {"source": "0010", "target": "1050"}, {"source": "0010", "target": "1054"}, {"source": "0010", "target": "1110"}, {"source": "0010", "target": "1145"}, {"source": "0010", "target": "1210"}, {"source": "0010", "target": "1215"}, {"source": "0010", "target": "1230"}, {"source": "0010", "target": "1305"}, {"source": "0010", "target": "1315"}, {"source": "0010", "target": "1321"}, {"source": "0010", "target": "1326"}, {"source": "0010", "target": "1635"}, {"source": "0036", "target": "0037"}, {"source": "0036", "target": "0423"}, {"source": "0105", "target": "1110"}, {"source": "0105", "target": "1145"}, {"source": "0105", "target": "1215"}, {"source": "0160", "target": "1110"}, {"source": "0205", "target": "1210"}, {"source": "0205", "target": "1230"}, {"source": "0310", "target": "1305"}, {"source": "0310", "target": "1315"}, {"source": "0310", "target": "1320"}]}