{"nodes": [{"dept_code": "MUSIC", "id": "0100", "course_title": "FUNDAMENTALS OF WESTERN MUSIC", "description": "This class provides a comprehensive introduction to reading and understanding tonal music. It is intended for music majors preparing to enter the music theory sequence, or for non-majors who wish to learn to better understand and produce musical notation. Topics include pitch, rhythm and meter, scales, intervals, chords, and harmony. By the end of this semester, you will be able to identify basic harmonic progressions and musical forms both visually and aurally. Prior experience with music theory is neither required nor assumed.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0115", "course_title": "THE ALEXANDER TECHNIQUE", "description": "An elective, this course teaches musicians, actors, and other kinetic performers how posture and body awareness impact their health. Students will learn how to take conscious control of their movements during activities so their performances will be fluid, natural, poised and expressive to their fullest potential. The course will improve the quality of performance, daily routines, and study habit positions, and prevent repetitive movement through conscious release of the muscles in the upper body.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0121", "course_title": "BASIC MUSICIANSHIP: CLASS PIANO", "description": "This course in basic musicianship provides non-music majors with keyboard skills while introducing them to basics of music theory. Course content includes scales, intervals, chords, and simple analysis. The course prepares students to transpose and sight read. Students will also be expected to take melodic dictation. Electronic pianos are used in class and are available for daily practice.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0122", "course_title": "BASIC MUSICIANSHIP: CLASS GUITAR", "description": "This course is designed to provide non-music majors with an introduction to the techniques of classical, folk, rock, and jazz guitar. While the emphasis is on playing skills, the course also introduces many aspects of music theory and notation.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0123", "course_title": "BASIC MUSICIANSHIP: CLASS VOICE", "description": "This course is designed for non-voice majors who want to develop their singing and sight-reading skills. It provides an introduction to posture, breathing, tone production, diction, and interpretation, while introducing students to the elements of music theory and notation.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0124", "course_title": "INTERMEDIATE PIANO", "description": "This course is designed for students who have previously studied the piano. Throughout the semester, you will set individual goals with your instructor and work toward meeting those goals. The class will include preparation for and performance in two recitals, where students will present polished performances of appropriately challenging pieces (one ensemble and one solo). Alongside these performance objectives, students will also undertake a study of musical form, developing large-scale listening and analysis skills.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0125", "course_title": "CREATIVE MUSICIANSHIP", "description": "This class provides an introduction to music composition designed for students that may or may not read music. It is intended for any student that wants to learn vocabulary and skills around music making. All of the units involve using different technologies, music concepts, and instrumentation in order to create original compositions. By the end of the semester, you will have produced a podcast, made beats, written and recorded compositions for your own voice, written assemblage and found sound compositions, and drawn graphic scores. You will have also acquired vocabulary that will help you discuss your classmates' projects.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0211", "course_title": "INTRODUCTION TO WESTERN ART MUSIC", "description": "This class will examine the history, culture, and practice of '''classical''' music. We will explore the technical workings of music and learn what to listen for in a wide variety of musical styles. We will also discuss the values and meanings of music in different social and political contexts. No prior knowledge of music is necessary and there is no requirement to read music to succeed in the course.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0222", "course_title": "HISTORY OF WESTERN MUSIC TO 1750", "description": "A study of selected master works or Western art music in a historical context from Gregorian chant through Johann Sebastian Bach. Emphasis is on musical understanding through critical listening, score study, and lectures.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0311", "course_title": "INTRODUCTION TO WORLD MUSIC", "description": "This introductory course deals with a great variety of traditional musical genres from selected cultures around the world. It aims to familiarize students with music sound and music structure of different people, to help them appreciate music in its cultural context, and to give them a broad worldview of music both as a human activity with social functions and as an artistic expression. Generous use will be made of audio-visual aids and live performances in the presentation of materials.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0411", "course_title": "THEORY 1", "description": "This course introduces the principles and practice of diatonic harmony and voice leading, through a study of works by leading composers of the 18th and 19th centuries.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0412", "course_title": "MUSICIANSHIP 1", "description": "This course provides a disciplined environment in which to develop or improve audiation and aural skills, including sight-singing (moveable 'Do' solfeggio) in major and minor keys, interval recognition exercises, recognition of triads in inversions and with added tones, and melodic and rhythmic dictation.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0416", "course_title": "MUSICIANSHIP 2", "description": "This course is the sequel to MUSIC 0412 and continues to develop and improve audiation and aural skills, including sight-singing (moveable 'Do' solfeggio) in major and minor keys; recognition of chord progressions, cadences, and non-harmonic tones; melodic, rhythmic, and harmonic dictation in multiple voices.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0417", "course_title": "THEORY 3", "description": "This course introduces the principles and practice of chromatic harmony and voice leading, through a study of works by leading composers of the 18th and 19th centuries.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0510", "course_title": "VOICE-JAZZ", "description": "This course is designed to teach jazz vocal style and improvisation in an individualized setting. Students will learn the basics of jazz voice production through technical exercises at the keyboard. Jazz terminology will be introduced and students will internalize jazz rhythms and articulations. The course provides for active listening with an emphasis on sight singing and ear training. Students will explore scale pattern and modes as elements of improvisation. They will express such technique through call-and-response and the embellishment of standard jazz tunes. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0511", "course_title": "VOICE", "description": "This course provides instruction in vocal techniques and literature. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0512", "course_title": "PIANO", "description": "This course provides instruction in the techniques and literature of the piano. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0513", "course_title": "ORGAN", "description": "This course provides instruction in the techniques and literature of the organ. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0515", "course_title": "VIOLIN", "description": "This course provides instruction in the techniques and literature of the violin. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0516", "course_title": "VIOLA", "description": "This course provides instruction in the techniques and literature of the viola. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0517", "course_title": "VIOLONCELLO", "description": "This course provides instruction in the techniques and literature of the violoncello. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0518", "course_title": "DOUBLE BASS / BASS GUITAR", "description": "This course provides instruction in the techniques and literature of the double bass. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0519", "course_title": "FLUTE", "description": "This course provides instruction in the techniques and literature of the flute. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0520", "course_title": "OBOE", "description": "This course provides instruction in the techniques and literature of the oboe. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0521", "course_title": "CLARINET", "description": "This course provides instruction in the techniques and literature of the clarinet. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0522", "course_title": "SAXOPHONE", "description": "This course provides instruction in the techniques and literature of the saxophone. Students receive instruction in both jazz and classical techniques. One hour private lesson per week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0523", "course_title": "FRENCH HORN", "description": "This course provides instruction in the techniques and literature of the French horn. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0524", "course_title": "TRUMPET", "description": "This course provides instruction in the techniques and literature of the trumpet. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0525", "course_title": "BASSOON", "description": "This course provides instruction in the techniques and literature of the bassoon. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0526", "course_title": "TROMBONE", "description": "This course provides instruction in the techniques and literature of the trombone. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0527", "course_title": "PERCUSSION", "description": "This course provides instruction in the techniques and literature of percussion. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0528", "course_title": "JAZZ-STUDIO SET DRUMMING", "description": "Course will consist of the following styles of music technique for students to become qualified professionals in the entertainment industry. The music styles for the course will be: jazz, pop, big band, and recording session technique. These styles will also be enhanced with training in ear development, sight reading, and improvisational class demonstrations. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0529", "course_title": "GUITAR", "description": "This course provides instruction in the techniques and literature of the guitar. Students receive a one hour private lesson each week. May be repeated for additional credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0530", "course_title": "JAZZ GUITAR", "description": "This course provides instruction in the techniques and literature of the jazz guitar. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0533", "course_title": "JAZZ PIANO", "description": "This course is designed to teach jazz piano and improvisation in an individualized setting. Students will learn the basics of jazz piano through technical exercises at the keyboard. Students will explore scale pattern and modes as elements of improvisation. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0540", "course_title": "NON-WESTERN INSTRUMENTS", "description": "This course provides instruction in the techniques and literature of non-Western instruments. Students receive a one hour private lesson each week. May be repeated for credit. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0612", "course_title": "HEINZ CHAPEL CHOIR", "description": "An acapella choir singing a wide range of choral music. Regular performances on campus and on annual tour. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0613", "course_title": "UNIVERSITY GLEE CLUB", "description": "An ensemble of men's voices that performs on campus and on tour. Repertoire ranges from traditional glee club numbers, through broadway hits, to works from the classical literature. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0614", "course_title": "WOMEN'S CHORALE", "description": "Performs treble choral music from the 16th century to today. Members receive instruction in vocal technique and sight singing skills. Emphasis is given to diction and stage presence. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0620", "course_title": "UNIVERSITY ORCHESTRA", "description": "Open to students, faculty, staff, and community musicians. The orchestra performs a wide variety of works from the standard repertoire, along with contemporary compositions. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0630", "course_title": "MARCHING BAND", "description": "The band performs at athletic events and in concert. Membership is by audition. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0640", "course_title": "JAZZ ENSEMBLE", "description": "Big band jazz performances and rehearsal techniques. Performances include festivals, concerts, and tours. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "0660", "course_title": "AFRICAN DRUMMING ENSEMBLE", "description": "The ensemble focuses on the drumming techniques of selected African society, the ensemble performs in collaboration with the Afro-American dance class and the Oakland dance school, and various local schools. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0661", "course_title": "THE PITT AFROPOP ENSEMBLE", "description": "In this course, students will learn how to perform and compose popular music styles that originated from or have a cultural connection to Africa. Through performance, the course exposes the interconnections between African music and the music of the African diaspora such as reggae and jazz.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0672", "course_title": "CHAMBER MUSIC", "description": "Students may elect chamber music to study any approved repertoire involving more than one instrument or voice. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0673", "course_title": "SMALL JAZZ ENSEMBLES", "description": "In this course, students will familiarize themselves with notable standard jazz songs and play them in small ensembles. Students will learn melodies and chord progressions of the assigned songs and improvise on them. In addition, basic jazz theory and performance conventions will be discussed. Furthermore, students are encouraged to write their original compositions. There will be midterm and final juries as well as a public concert at the end of the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0690", "course_title": "UNIVERSITY GAMELAN", "description": "A gamelan is a set of mostly percussive instruments featuring tuned bronze gongs, bronze-keyed instruments, and drums. In the beginning ensemble, students will learn how to perform simple compositions on several instruments as well as the basic organizing principles of javanese traditional music. The advanced ensemble is made up of students invited to join after at least one semester of beginning gamelan. Students in the advanced group will learn more complex instruments and pieces. The ensemble will also perform publically at least once every year. Dietrich School students must complete three credits in performance courses to meet the Creative Work General Education Requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0711", "course_title": "HISTORY OF JAZZ", "description": "The course focuses on the chronological development of jazz from its beginnings on the plantation to its present state as a world concert music. Various styles such as ragtime, blues, gospel, spirituals, rhythm and blues, rock, soul, etc., Are examined.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0824", "course_title": "SPECIAL TOPICS IN ROCK MUSIC", "description": "The social, cultural, and stylistic history of rock and roll music. The class begins with important precedents such as blackface minstrelsy, jazz, and blues. In addition to addressing styles actually sold under the rock marketing label, we will cover genres and styles that were influenced by rock and roll but sold under different labels, such as soul, funk, salsa, disco, and hip-hop. Attention will also be given to global varieties of rock and roll.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0844", "course_title": "THE MUSIC OF THE BEATLES", "description": "This course combines a study of the cultural context in which The Beatles worked with a consideration of how the music was created and evolved over time. Topics include the band's formative influences, relationships to contemporary artists, and evolution from live performing band to studio recording artists. Broader contextual themes include the rise of \"teenage culture\", Beatlemania as a phenomenon most closely associated with young female fans, and the band's relationship to the \"youth counterculture\".", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0854", "course_title": "HEAVY METAL MUSIC", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "0896", "course_title": "MUSIC AND FILM", "description": "This introductory course, designed for non-majors with no previous background in music or film studies, examines music within the context of film, instructing students how to listen and think critically about the music and its relationship to the moving image and narrative.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1262", "course_title": "CRITICAL LISTENING AND MUSIC CRITICISM", "description": "This course applies journalistic music criticism to develop critical listening skills crucial to learning about and performing classical and other music. In writing assignments and in class discussion, students will critique concerts and recordings, then defend their opinions with factual evidence.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1271", "course_title": "THE SOUNDS OF ROMANTIC COMEDY", "description": "Sometime between Ernst Lubitsch's The Shop Around the Corner (1940) and Nora Ephron's You've Got Mail (1998), romance changed in the United States. Where class and wealth used to be deciding factors for romantic love, there now emerged the concept of the soulmate, who could be anyone. In this course, we will watch American romantic comedies of the last 100 years, paying particular attention to how the development of the soundtrack has changed what love sounds and feels like.Students will develop skills in closely analyzing sound and image in film, critically interpreting popular culture in relation to broader events in society, and thinking about the relation between music, identity, and politics. In particular, we will together develop answers to the following questions: how did capitalism, social justice movements, the changing nature of work, and other cultural transformations affect what people expected from intimate union? What aesthetic norms for representing romance changed alongside cultural norms? How is the narrative of love inflected by race, gender, ethnicity, sexuality, religious difference, ability difference, and/or economic disparity?", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1273", "course_title": "JAZZ AND FILM", "description": "Ralph Ellison, the author of the American classic Invisible Man, asserted that all of American life was \"jazz-shaped.\" By this he meant that jazz (and blues) were more than music, that jazz (and blues) had ubiquitously infiltrated American life, and that it served as a model for an expanding pluralist culture. Jazz and Film explores this notion in three areas: in representations of jazz culture on film, in the sonic presence of jazz in film, and the influence of jazz on filmmaking. Students will give weekly responses to readings, films, or recordings, and will write a research paper on a topic of their own choosing.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1320", "course_title": "AMERICAN MUSIC", "description": "The course will focus on the major genres crucial to the understanding of music in American life, both written and unwritten as well as popular, vernacular and classical. Special attention will be given to the results of acculturation.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1321", "course_title": "MUSIC, GENDER AND SEXUALITY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1326", "course_title": "AFRICAN-AMERICAN MUSIC IN U.S.", "description": "This course is designed to familiarize the student with various phases of African-American music existing in North America; blues, gospel-spirituals, work songs, children's games songs, and classical compositions of ragtime composers Scott Jobin, J.P. Johnson, etc. Students will conduct field projects centered around \"street recordings, locations, interviews of local and visiting artists, etc.\" A detailed study of great Pittsburgh performers present and past will constitute a major portion of this course.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1327", "course_title": "GLOBAL HIP HOP", "description": "This seminar analyzes how diverse groups of musicians and listeners use hip-hop to express local and transnational claims of belonging through the appropriation of musical genres identified with the West and with African Americans in particular. A closer reading of global hip-hop practices offers insights into the genre's artistic goals and its social profile in a variety of contexts. Through analyses of locally distinct musical expressions, marketing trends within national and global music industries, and state-sponsored policies relating to hip-hop, this course sheds light on hip-hop's role in constituting cultural and political identities among diverse groups of people in the U.S. And abroad.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1332", "course_title": "MUSIC IN LATIN AMERICA", "description": "Mexico, Venezuela, Columbia, Panama, and Peru will be the major countries represented in this general survey of the music of Latin America. The course will be taught in a lecture-discussion format with extensive use made of recordings, slides, and films. Some actual performance of drumming traditions will be included.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1340", "course_title": "MUSIC IN AFRICA", "description": "This course examines the historical social and cultural background of music in Africa with particular reference to music in community life, performing groups, the training of musicians, instrument structures in African music, and the interrelations of music and dance. (Slides, films, and recordings will be used to illustrate lectures.)", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1396", "course_title": "MUSIC IN SOCIETY", "description": "This course will explore critical perspectives on topics such as non-normative music history, queer modes of expression, subcultural music-making, and the implications of mainstream visibility. Along the way, the course will survey some notable lesbian/gay/bisexual/ transgender/queer composers and musicians in both art music and popular music. Course materials include readings, recordings, and possibly musical events and current media.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1421", "course_title": "COMPOSITION 1", "description": "An introduction to the craft of musical composition, students receive individual instruction in composition, and usually create works using materials from the \"common practice\" period studied in MUSIC 0417 and 0419. Ability to read music notation fluently.", "completed": false, "prereq_count": 1}, {"dept_code": "MUSIC", "id": "1422", "course_title": "COMPOSITION 2", "description": "Starting from the novel premise that two of the most important considerations for composers are 1) how their music sounds and 2) what listeners hear in it, this course explores strategies to develop, edit and otherwise improve the conception, notation, performance and reception of student's compositions.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1441", "course_title": "ELECTRONIC AND COMPUTER MUSIC 1", "description": "This course provides an introduction to composing electronic music. It includes instruction in MIDI and audio sequencing, synthesis, sampling, effects, and other digital audio concepts. Course-work will primarily involve a series of creative projects utilizing a variety of techniques.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1443", "course_title": "PROGRAMMING ENVIRONMENTS IN MUSIC - AN INTRODUCTION TO MAX/MSP", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1444", "course_title": "ELECTRONIC BEAT MAKING & SONG WRITING", "description": "This course provides an introduction to composing original music on the student's own laptop. Technical topics include audio sequencing, MIDI sequencing, effects, automation, live performance, sampling, and synthesis. Students will listen to and discuss a variety of electronic music examples from beat-oriented styles. This course will also include some introductory music theory/fundamentals.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1450", "course_title": "MUSIC PRODUCTION AND RECORDING", "description": "With the rapid changes taking place in the music industry, it is incumbent that all aspiring musicians and performing artists understand the means and methods of music production and recording. Throughout the semester, students will enjoy (1) hands-on experience, (2) recording projects with guest artists in class, (3) learning simple editing and mastering two-track (stereo) recording, and (4) learning to mix and master multi-track recordings. In-class projects will include actual recording of performers (mainly from the class) with an emphasis on Jazz. Upon completion, students will be able to organize and execute recording sessions of their own. Readings will be assigned throughout the semester; quizzed and individual projects will be used to assess students.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1725", "course_title": "JAZZ AND PROTEST", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1731", "course_title": "JAZZ COMPOSITION AND ARRANGING 1", "description": "This course develops the students' knowledge of the techniques of jazz-rock composition and arranging. The distinctive features of jazz-rock harmony are studied, and students write arrangements for various instrumental combinations.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1732", "course_title": "JAZZ COMPOSITION AND ARRANGING 2", "description": "A continuation of music 1731. The course develops the student's knowledge of the techniques of jazz-rock composition and arranging. The distinctive features of jazz-rock harmony are studied, and students write arrangements for various instrument combinations.", "completed": false, "prereq_count": 0}, {"dept_code": "MUSIC", "id": "1904", "course_title": "SENIOR SEMINAR", "description": "The seminar is required of students wishing to earn a major in music. The topic of the seminar changes, but participants are expected to produce a major research project or other approved project displaying the ability to work independently at an advanced level.", "completed": false, "prereq_count": 0}], "links": [{"source": "0100", "target": "0411"}, {"source": "0100", "target": "0412"}, {"source": "0411", "target": "0417"}, {"source": "0412", "target": "0416"}, {"source": "0417", "target": "1421"}, {"source": "0510", "target": "0510"}, {"source": "0511", "target": "0511"}, {"source": "0512", "target": "0512"}, {"source": "0513", "target": "0513"}, {"source": "0517", "target": "0517"}, {"source": "0518", "target": "0518"}, {"source": "0519", "target": "0519"}, {"source": "0520", "target": "0520"}, {"source": "0521", "target": "0521"}, {"source": "0522", "target": "0522"}, {"source": "0523", "target": "0523"}, {"source": "0524", "target": "0524"}, {"source": "0525", "target": "0525"}, {"source": "0526", "target": "0526"}, {"source": "0527", "target": "0527"}, {"source": "0528", "target": "0528"}, {"source": "0530", "target": "0530"}, {"source": "0533", "target": "0533"}, {"source": "0612", "target": "0612"}, {"source": "0613", "target": "0613"}, {"source": "0614", "target": "0614"}, {"source": "0620", "target": "0620"}, {"source": "0630", "target": "0630"}, {"source": "0640", "target": "0640"}]}