{"nodes": [{"dept_code": "ATHLTR", "id": "1811", "course_title": "BASIC ATHLETIC TRAINING", "description": "This course is designed to provide the student with an introduction to the athletic training profession. Topics to include medical terminology, mechanisms of injury, and recognition and treatment of common athletic injuries to major body parts.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1812", "course_title": "BASIC ATHLETIC TRAINING LAB", "description": "An introduction to basic taping techniques and injury evaluation techniques used in the profession of athletic training. Basic supportive strappings and paddings for immediate care and competition are presented as well as basic joint evaluation procedures, assessment of vital signs, and crutch fitting.", "completed": false, "prereq_count": 1}, {"dept_code": "ATHLTR", "id": "1813", "course_title": "INTRODUCTION TO CLINICAL ATHLETIC TRAINING 1", "description": "This course is designed to help prepare students for the demands associated with experiential learning and future clinical placements in the Athletic Training Education Program (ATP). The course will have a combined in-person meetings and associated class assignments that will include field observations at approved clinical education sites through the University of Pittsburgh. This course is a prerequisite for the Practicum I-IV Courses in the ATP.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1815", "course_title": "FOUNDATIONS IN EVALUATION AND TREATMENT", "description": "The objective of this course is to introduce and develop fundamental understanding of the component for evaluation and acute care. Specific objectives are to introduce the student to concepts related to patient interaction in regards to the evaluation process; the components and general principals of the evaluation process (patient observation, history, range of motion, strength, neurovascular, special tests, palpation, and diagnostics); a basic understanding and ability to perform range of motion and strength assessments and apply the appropriate grading tools. This course is a prerequisite for Therapeutic Interventions I-II courses in the Athletic Training Education Program.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1816", "course_title": "MEDICAL ETHICS", "description": "This course addresses legal and ethical issues encountered by athletic trainers and other healthcare professionals who are part of the Sports Medicine team. Strong emphasis is placed on legal and ethical issues that occur within the realm of direct patient care. Additionally, the course will expose students with legal and institutional positions and examine relevant case studies. Students will also practice developing concrete logical arguments in support of a chosen ethical stance.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1823", "course_title": "ADMINISTRATIVE ASPECTS OF ATHLETIC TRAINING", "description": "This course presents current administrative issues in athletic training including training room facility and design, record keeping procedures, personnel management and recruitment, medico-legal considerations and budgetary principles.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1841", "course_title": "ATHLETIC TRAINING PRACTICUM 3", "description": "Designed to supplement third clinical experience presented in seminar fashion to address clinical proficiencies published in the 3rd edition of the NATA athletic training educational competencies introduced in the second semester academic courses. Presented by faculty of the AT program then evaluated in clinical setting in live situations when possible or under simulated conditions when narrated. Specific emphasis placed on those proficiencies that can be grouped into modules and which do not receive broad coverage in an academic course.", "completed": false, "prereq_count": 0}, {"dept_code": "ATHLTR", "id": "1885", "course_title": "INTRODUCTION TO EVIDENCE BASED REHABILITATION", "description": "Provides basic skills in reading, reviewing, and critiquing the research literature in the rehab sciences. These skills will be applied to the relevant literature in diagnosis, prognosis and intervention strategies within the spectrum of rehab science. Students learn to generate relevant research questions, utilize an evidenced based medicine approach, appraisal and synthesis of current articles within the fore mentioned areas. Will culminate in an individual review project aimed at the development and resolution of one research question, using the best, current available literature", "completed": false, "prereq_count": 0}], "links": [{"source": "1811", "target": "1812"}]}