{"nodes": [{"dept_code": "ITAL", "id": "0050", "course_title": "ITALIAN CONVERSATION", "description": "This course offers students the opportunity to improve their ability to converse in Italian. Discussions will center on topics of general interest.", "completed": false}, {"dept_code": "ITAL", "id": "0080", "course_title": "RENAISSANCE ITALY: HUMANISM, POWER & THE ARTS", "description": "An introduction to Renaissance Italy, this class takes an interdisciplinary approach, exploring connections between major Renaissance works and developments across a wide range of fields: from the rise of humanism to the paintings of Botticelli; from Machiavelli's revolutionary handbook of power, The Prince, to his side-splitting comedy, The Mandrake Root; from the restless experimentation of Leonardo da Vinci to the birth of opera. No prerequisites. This class will be conducted in English and does not require knowledge of Italian. It satisfies the Geographical Region and Historical Analysis General Education Requirements, and counts for the Italian minor and major tracks.", "completed": false}, {"dept_code": "ITAL", "id": "0085", "course_title": "ITALIAN CINEMA ICONS", "description": "Rotting zombies, evil witches, and merciless cowboys meet superstar directors, iconic actors, and award-winning composers in ITAL 0085: Italian Cinema Icons. This course moves through the genres of Italian cinema and focuses on the most influential artists and on the most representative films. We are going to go from the war film masterpieces of the 1940s to the gory exploitation horror of the 1970s, from Sergio Leone's re-invention of western films to Mario Bava's rip-off of The Exorcist: this class really has something for everyone. So come enjoy what you love already and discover what you are going to love next. No previous course experience with cinema is presumed. The course will be taught in English; readings will be available in English; all films will have English subtitles. ITAL 0085 is cross-listed with FMST 0303 and counts towards both the major and the minor in Film and Media Studies under Category I.", "completed": false}, {"dept_code": "ITAL", "id": "0087", "course_title": "FOOD FOR THOUGHT: ITALIAN FOOD CULTURE", "description": "This course is taught in English. This course is an introduction to Italian history and culture in which students will explore the importance of Italian cuisine through the analysis of literary and historical texts, visual arts, and film related to food production, consumption, importation/exportation, and legislation. Students will examine the history of food culture from antiquity to the present day, and consider the socio-cultural and socioeconomic impacts of food and cuisine in contemporary Italy. No prerequisites. No textbook required. No knowledge of Italian is required.", "completed": false}, {"dept_code": "ITAL", "id": "0090", "course_title": "EURO CHIC: THE INVENTION OF FASHION", "description": "Since the Renaissance, Italy and France have occupied a fundamental role in the establishment and development of fashion as a creative and commercial enterprise deeply rooted in cultural mores. The course address the historical shifts in the cultural understanding of gender roles, class belonging, consumption habits and expectations, the international circulation of craftmanship and celebrities, and technological innovation. We will start addressing the anthropology of body ornamentation, gender markings and the difference between costume and fashion. Our historical point of departure is the grand arrival of Catherine De Medici from Florence to Paris in 1547, following her marriage to King Henry II of France. We then follow the progressive establishment of Paris as the capital of European (and eventually international) fashion, together with Italian cities like Florence, Venice and Milan. We also take a significant detour through London during the \"dandy\" era of the early 19th century and the \"mod\" and \"punk\" trends of the decades between 1960 and 1980. Punk leads us into a discussion of current international \"anti-fashion\" trends, such as the politics and economics of privilege, cheap labor and environmental concerns about \"fast fashion.\" This course is taught in English. *This course may be used for the Italian Studies major (whether listed as FR 0090 or ITAL 0090), but does not count for the Italian major or the Italian minor.", "completed": false}, {"dept_code": "ITAL", "id": "0101", "course_title": "ITALIAN LANGUAGE AND CULTURE 1", "description": "An introduction to the Italian language, including basic grammar, vocabulary and speech patterns. Primary goal is to achieve competence in the spoken language, along with basic skills in reading and writing. Face-to-face lesson meetings (3 days per week) consist of communicative activities in which students practiced learned structures and vocabulary. One hour per week is online. In this hour, students will watch/listen/read lectures, complete exercises related to grammar and vocabulary, and interact with apps and websites (Extempore, Quizlet, etc.) that will be tracked in the classroom management platform Schoology. This instructional approach is designed to allow for maximum interaction in the classroom environment, so that students can receive extensive feedback on their progress. No textbook required.", "completed": false}, {"dept_code": "ITAL", "id": "0102", "course_title": "ITALIAN LANGUAGE AND CULTURE 2", "description": "An introduction to the Italian language, including basic grammar, vocabulary and speech patterns. Primary goal is to achieve competence in the spoken language, along with basic skills in reading and writing. No textbook required.", "completed": false}, {"dept_code": "ITAL", "id": "0103", "course_title": "ITALIAN LANGUAGE AND CULTURE 3", "description": "This course is a logical continuation of the first-year sequence. Emphasis continues to be placed on the oral-aural skills, but the reading and writing skills become increasingly stressed. No textbook required.", "completed": false}, {"dept_code": "ITAL", "id": "0117", "course_title": "ITALIES", "description": "This 2nd year course consists of three main parts: Part I introduces students to the geographical contours of the Italian nation throughout history: how has Italy been defined and how is it defined today? In this part we will also identify, compare, and contrast different ways of articulating Italian identity through political, legal, cultural, economic, and linguistic parameters. Part II invites students to engage with the diversity of Italian regions-their languages, cultures, and sub-national identities-through a representative set of regional case studies. Finally, in Part III students will explore the nature of italianità (Italianness) as represented both in the diasporic movement of Italians around the world, and in current debates over immigration to Italy and the rights of immigrants-children-born in Italy-- to enjoy the benefits of Italian citizenship.", "completed": false}, {"dept_code": "ITAL", "id": "1087", "course_title": "FASCISM AND RESISTANCE", "description": "The \"ventennio nero\" (or black twenty years; 1922-1943) refers to the period of Italy's Fascist rule under strongman Benito Mussolini, Fascism's founder. Italian Fascism (first a movement, then a political party, and finally a totalitarian government) continues to fascinate historians, political theorists, and cultural historians alike; it is the foundational period against which all other \"fascisms\" are measured. This class, taught in English, explores the history, politics, and cultural underpinnings of what Susan Sontag called \"fascinating Fascism\"; its construction of masculinity and the idealized \"Fascist mother\"; its invention of a Fascist Mediterranean \"race\" to rival the Aryan race of Nazi Germany; its pursuit of an Empire that would be a worthy heir to Rome; and finally, the robust resistance culture that rose up to counter it.", "completed": false}, {"dept_code": "ITAL", "id": "1092", "course_title": "ITALIAN TRANSLATION WORKSHOP: FROM THEORY TO BEST PRACTICES", "description": "Tradurre, tradire. So goes the old Italian saying: to translate is always a betrayal. What makes translation such a complicated and risky process? What, exactly, is the \"betrayal\" against? What does this kind of formulation tell us about how society views source texts (or \"originals\") and their translation into other languages, formats, and medias? This course examines translation from both a theoretical and practical perspective, allowing students to understand the ways in which translation has been formulated, promoted, and criticized, but also giving them a laboratory for the translation of texts of various kinds and genres, including letters, oral histories, publicity materials, literature, and even film subtitles. Students in this class will move from short translation exercises to longer translation projects, culminating in a multi-piece portfolio of their translation projects, which will draw on untranslated materials from local archives and library collections. Pre-requisites: any two of ITAL 0111, 0113, 0115, 0117, 0119", "completed": false}], "links": [{"source": "0101", "target": "0102"}, {"source": "0102", "target": "0103"}, {"source": "0117", "target": "1092"}]}