{"nodes": [{"dept_code": "CEE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "The departmental seminars are designed to acquaint the student with aspects of the civil engineering profession which are not normally encountered in classes and school activities.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1101", "course_title": "DYNAMICS AND STABILITY", "description": "This is a basic course in dynamics. The course covers kinematics and kinematics of particles, kinetics of systems of particles, work and energy, introduction to vibration, and single-degree-freedom systems. This course also introduces the basic concepts of elastic stability and the approaches used in solving stability problems. Students will learn how to pose the dynamic problems into equations, and solve the problem in different ways. The course will provide the student with a clear and thorough understanding of the applications of dynamics in civil engineering problems.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1200", "course_title": "CONSTRUCTION MANAGEMENT", "description": "This course introduces undergraduates to the construction management processes including planning, financing, contract administration, and project scheduling and controlling. It is a practical course that provides a broad knowledge of managerial decision-making for young engineers. This is the basic course for all follow-on construction courses.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1203", "course_title": "CONSTRUCT PROFSSN DEVELOPMENT", "description": "This course teaches the student how construction-related organizations (owner, designer, contractor) are organized and managed. The course covers such topics as marketing, TGM, ethics, risk management, and personnel management. The course emphasizes a professional perspective to the practice of construction management and incorporates lectures by practitioners of various professions.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1233", "course_title": "CONSTRUCTION DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and creative aspects of design in managerial decision-making of construction in such areas as estimating, scheduling, methods, risk management, and finance.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1330", "course_title": "INTRODUCTION TO STRUCTURAL ANALYSIS", "description": "An introduction to linear analysis of statistically determinate, and indeterminate, elastic structural systems.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1333", "course_title": "STRUCTURAL DESIGN PROJECT", "description": "Comprehensive (capstone) structural design project for a building or a bridge, emphasizing conceptual design, design of footings and superstructure, and preparation of cad drawings, a final written and a final oral report.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1340", "course_title": "CONCRETE STRUCTURES 1", "description": "An introductory concrete design course based on the ACI 318 code. Fundamental topics relating to behavior, strength and design of reinforced concrete beams, one-way slabs, short columns, and footings are presented.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1402", "course_title": "FLUID MECHANICS", "description": "A first course in fluid mechanics discussing basic principles and methods for studying static and dynamic behaviors of fluids. In the laboratory the students conduct experiments on fluid flow in pipes and open channels.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1410", "course_title": "WATER RESOURCES ENGINEERING DESIGN", "description": "Basic principles of hydrologic analysis and design. Estimation of missing/bad hydrologic data for analysis. Hydrologic design using the probable maximum flood, reservoir design floods, reservoir storage allocation and reallocation. Climate variability and impacts on hydrologic design. Hydrologic design using SCS methods, detention pond design, and design of dams. Reservoir reliability for water supply, and reservoir sedimentation. Emergency action plans and response to extreme hydrologic events, ice engineering, and groundwater well design. Dam safety, hydrologic design memorandums and manuals, and portfolio risk assessment for dams and levees. Labs focus on the utilization of various water resources engineering software, i.e. HEC-HMS, TR-55, TR-20, and SWMM; PROG:Swanson School of Engineering", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1412", "course_title": "INTRODUCTION TO WATER RESOURCES ENGINEERING", "description": "Introduction to the basic concepts of surface water hydrology, meteorology, and fields of water resources engineering. Topics include: hydro-meteorological field measurement and computational methods, historical floods and droughts, flood and drought forecasting, groundwater hydrology, statistical analysis of hydrologic data, urban storm water management, irrigation, urban water supply, operational hydrology, water resources projects, water quality as it relates to hydrology, economic aspects of water resources, and introductions into open channel hydraulics and coastal engineering.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1433", "course_title": "WATER RESOURCES DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1503", "course_title": "INTRO TO ENVIRONMENTAL ENGRNG", "description": "Fundamentals of environmental science and engineering as applied to water and wastewater treatment, air quality control, and solid and hazardous waste management.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1514", "course_title": "ENVIRONMENTAL IMPACT ASSESSMENT", "description": "Technical and procedural aspects of environmental impact analysis and assessment with emphasis on regulatory framework, characterization of impacts and their remediation, and the decision process when applied to engineering systems.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1515", "course_title": "WASTEWATER COLLECTION AND TREATMENT PLANT DESIGN", "description": "Stepwise development and process design, equipment selection, economic evaluation, layout, and operating guidelines for wastewater collection and treatment systems.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1522", "course_title": "FATE AND TRANSPORT IN ENVIRONMENTAL ENGINEERING", "description": "An introduction to the thermodynamic and kinetic drivers of chemical fate in the environment. Processes governing the diffusion, advection and transformation of chemicals in air, water and soil. Inter-media exchange, environmental degradation and uptake into biotic systems.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1531", "course_title": "AIR POLLUTION AND CONTROL", "description": "This course covers terminology, scientific principles, control options, regulatory requirements, permitting procedures, testing/modeling techniques and current topics associated with air pollution and control. This course requires quantitative understanding and covers design considerations associated with air pollution and control. It also covers environmental issues and requires an appreciation of the non-technical aspects of air quality management.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1533", "course_title": "ENVRL ENGR DESIGN PROJECT", "description": "Group design of an engineered system for environmental quality control.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1609", "course_title": "LIFE CYCLE ASSESSMENT METHODS AND TOOLS", "description": "This class will introduce students to life cycle thinking and provide engineers with tools to assess the sustainability and environmental impact of a product, process, or activity. Life cycle assessment (LCA) principles, methods, tools, and challenges will be explored throughout the course. Topics include material and energy flow analysis, environmental indicators and metrics for sustainability, case studies of LCA applications, and impact assessment.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1618", "course_title": "DESIGN FOR THE ENVIRONMENT", "description": "The course begins with an introduction to sustainability, design frameworks, the design process and the role of innovation, followed by how to assess toxicity and risk, systems thinking, and metrics to evaluate and quantify the sustainability of alternatives. The second half of the course will introduce students to designing appropriate technologies within the context of the developing world as well as a series of relevant case studies (e.g., energy, water, agriculture, nanotechnology). Throughout the semester, students will apply what they learn in class to the development of an innovative solution to a real-world sustainability challenge. The course integrates active learning components that provide students the opportunity to exercise the engineering design process, work effectively in a group, and practice written and oral presentation skills.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1700", "course_title": "TRAFFIC MANAGEMENT AND OPERATIONS", "description": "Introduction to traffic flow theory and characteristics. Highway capacity analysis. Basic traffic management and control.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1703", "course_title": "TRANSPORTATION ENGINEERING", "description": "Introduction to the design, planning, operation, management, and maintenance of transportation systems. Transportation planning inter-modal transportation systems (highway, air, rails, etc.). Transportation planning of highways, airports, and railroads with traffic flow models, capacity analysis, and safety. Concepts for designing facilities and systems area study with life cycle costing procedures and criteria for optimization.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1714", "course_title": "PAVEMENT DESIGN AND ANALYSIS", "description": "Concepts and principles in the structural design of pavements for highways and airfields including: traffic loads, climatic factors, soil and material characterization. Application of current pavement design practices and procedures. Economic evaluation of highway and airport pavements.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1716", "course_title": "PAVEMENT CONSTRUCTION", "description": "This course teaches the students the theory and practice of constructing highway and airfield pavements and associated construction management responsibilities. The students will learn how pavements are constructed, including earthwork, base and subbase construction, and the paving of the concrete and asphalt surface layers. The course also covers the impact of construction quality on long-term pavement performance and modern methods utilized for construction quality control.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1720", "course_title": "URBAN TRANSPORTATION PLANNING", "description": "All aspects of the transportation planning process including transportation planning and decision making, transportation modeling, demand and supply analysis, transportation studies, environmental issues and project implementation.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1725", "course_title": "PUBLIC TRANSPORTATION SYSTEMS", "description": "This course is designed to give seniors and graduate students a basic background in the planning, operations and development of public transportation systems within the context of the overall transportation system.", "completed": false, "prereq_count": 1}, {"dept_code": "CEE", "id": "1733", "course_title": "TRANSPORTATION DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1800", "course_title": "ENGINEERING GEOLOGY", "description": "Review of basic geologic principles with emphasis on the importance and influence of geology and geologic processes on engineering projects such as dam sites, foundations, tunnels, mine subsidence, landslides, highways, groundwater problems, and seismic studies.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1811", "course_title": "PRINCIPLES OF SOIL MECHANICS", "description": "Basic soil properties, permeability, capillarity and frost action, compaction, stresses in soil masses, two-dimensional seepage, compressibility, stress-strain-time behavior, and shear strength.", "completed": false, "prereq_count": 0}, {"dept_code": "CEE", "id": "1833", "course_title": "GEOTECHNICAL DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false, "prereq_count": 1}], "links": [{"source": "1200", "target": "1233"}, {"source": "1330", "target": "1340"}, {"source": "1402", "target": "1412"}, {"source": "1503", "target": "1514"}, {"source": "1503", "target": "1515"}, {"source": "1503", "target": "1522"}, {"source": "1703", "target": "1720"}, {"source": "1703", "target": "1725"}, {"source": "1714", "target": "1833"}]}