{"nodes": [{"dept_code": "COMMRC", "id": "0300", "course_title": "COMMUNICATION PROCESS", "description": "This course is an introduction to basic theories, models, and concepts in interpersonal, small group, organizational and intercultural communication.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0310", "course_title": "RHETORICAL PROCESS", "description": "This is an introductory course designed to give students a sense of the role rhetoric plays in the construction of our social, political, and cultural worlds, and to introduce students to traditional and contemporary approaches to the analysis of rhetorical discourse. Students will prepare a series of short performances for presentation in the recitation sections.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0320", "course_title": "MASS COMMUNICATION PROCESS", "description": "This course is designed to introduce students to the basic concepts of mass communication research and to the history and development of various media (TV., Radio, newspapers, magazines, etc.).", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0500", "course_title": "ARGUMENT", "description": "This course introduces students to fundamental principles of argument, and develops argumentative skills through practice analysis and criticism.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0520", "course_title": "PUBLIC SPEAKING", "description": "This course is designed to help students develop increased skill in public speaking by means of theory and practice. This course covers research, organization, style, delivery, and criticism of informative, deliberative, and ceremonial speeches.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0530", "course_title": "INTERPERSONAL COMMUNICATION", "description": "The purpose of this course is to introduce students to theories and models of human communication in the face-to-face communication context. Focus of learning is on skill development; lecture, discussion, and practice of communication skills are used to facilitate student learning.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "0575", "course_title": "INTRODUCTION TO RADIO PRODUCTION", "description": "This course is designed to cover basic theory and techniques of radio and audio production as well as some basic radio station practices. The course consists of lectures as well as studio sessions featuring equipment demonstrations and production exercises in a professional environment.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1067", "course_title": "GLOBAL AND US WOMEN'S RHETORIC", "description": "This course informs students of how global and US women use rhetoric (speeches, writings, symbols and images) to advance their rights and agenda. Students will first read about feminist foremothers' writings as touchstones for understanding how contemporary US women in sports, medicine, science and law negotiate gender equality and rights. Then students will learn about global women's rhetoric. For example, they will examine how women in Africa mobilize for liberation, how Chinese women mediate feminism in a market economy and how women in the Middle East wage everyday resistance against male dominance and clamor for self-autonomy. In addition to reading feminist critical theories and testimonial narratives, a variety of interdisciplinary objects of study such as theater, feature and documentary films, webinar, guest lecture, folk songs and poetry will be incorporated into the course.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1101", "course_title": "EVIDENCE", "description": "This course examines the nature and structure of evidence and reason-giving in everyday discourse. Students develop critical skills in evaluating argument and reasoning by examining the evidential requirements of argument in specific rhetorical contexts; science, philosophy, and politics.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1102", "course_title": "ORGANIZATIONAL COMMUNICATION", "description": "Students in this course are provided with an overview of the relationship between communication and organizing processes. The course emphasizes theories, principles, and concepts of organizational communication. Students learn to analyze the communication which occurs in organizations to recognize sources of communication breakdown and develop an awareness of strategies for prevention and/or resolution of communication on breakdown.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1105", "course_title": "TELEVISION AND SOCIETY", "description": "This course explores the relationship between television and society. It familiarizes students with the history of the broadcast industry along with related legal, political, and economic issues. The course focuses on analyzing various television programs as constitutive of and constituted by social relations (class, gender, and race).", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1106", "course_title": "SMALL GROUP COMMUNICATION", "description": "Principles of small group communication are examined in this course. In particular, the examination will reveal the principles of group entry, group formation, group cohesiveness, group verbal and nonverbal message exchanges, group leadership, group problem solving and discussion, and group performance and satisfaction. Individual beliefs, attitudes and behaviors will be compared and contrasted with group beliefs, attitudes and behaviors.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1109", "course_title": "NONVERBAL COMMUNICATION", "description": "The purpose of this course is to examine the ways we communicate nonverbally. By nonverbal communication is meant that form of communication wherein messages are sent by virtue of an agent's physical characteristics, adornment, eye behavior, design and selection of environment, spatial relationships, utilization of time, touching behavior, body movements, the choice of objects to fill space, and vocal behavior. Principles and applications of nonverbal communication are discussed.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1111", "course_title": "THEORIES OF PERSUASION", "description": "This course surveys theories of persuasion that have been articulated during the twentieth century. It seeks to compare and contrast research about how the spoken word and the visual image influence public belief and action.", "completed": false, "prereq_count": 2}, {"dept_code": "COMMRC", "id": "1114", "course_title": "FREEDOM OF SPEECH AND PRESS", "description": "The purpose of the course is to provide students with a critical understanding of the historical themes and contemporary issues involved in the debate over free speech. This course examines philosophies of expression from Plato through the most recent supreme court decisions. Study focuses on cases, major doctrines, and competing interpretations of the first amendment to explore the freedoms and limits of individual expression and regulation of communication industries.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1116", "course_title": "RHETORIC OF THE AMERICAN COUNTERCULTURE", "description": "This course is concerned with social protest and the modern conception of the outsider, people and groups who choose to separate themselves, or are unwillingly separated, philosophically and ideologically from the society within which they live. One of the most recognizable examples of living the life of the outsider was embodied in the beat generation of the 1940's and 1950's, who embraced self-indulgence as well as literary themes of disenchantment and disengagement. A second example is the counterculture of the 1960's, the hippie generation, who tended to express themselves more in mass countercultural themes like student anti-war activism, popular, socially activist music, and film. Requirements include: discussion participation, 3 short papers (3 pages), 3 longer papers (8 pages), and one class presentation.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1121", "course_title": "HISTORY OF MASS MEDIA", "description": "This course provides an in-depth historical examination of U.S. Media (newspapers, magazines, radio, television and/or advertising). Emphasis is placed on the media's technological, political and cultural impact. Topics may vary depending on the particular historical period to be examined.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1122", "course_title": "MEDIA CRITICISM", "description": "This course is designed to introduce students to major trends in media criticism (e.G., Psychoanalysis, genre analysis, feminist theory, and cultural studies). Course readings and discussions will focus primarily on television texts.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1125", "course_title": "MEDIA THEORY", "description": "This course examines the major theoretical approaches in contemporary media studies. Emphasis is placed on understanding the basic tenets of these theoretical models and how they are applied in analyses of media texts.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1126", "course_title": "MEDIA AND CONSUMER CULTURE", "description": "This course will examine consumer culture in the twentieth and twenty-first century us. It examines advertising, the rise of the brand, and their roles in the commercialization of mass media. Of particular importance will be the role that race, class, and gender have played in shaping consumer culture (and vice versa), as well as the significance of the shift from a society based on an understanding of citizens based on democratic practices to one based on consumerist practices.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1143", "course_title": "KNOWLEDGE, POWER, AND DESIRE", "description": "This course examines issues of power, desire and knowledge in the work of Michel Foucault, and contrasts them with ideas of knowledge production in contemporary Anglo-American philosophy of science.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1160", "course_title": "VISUAL RHETORIC", "description": "This course centers on research concerning visual rhetoric. It will concentrate primarily on a range of interpretive and critical approaches for studying instances of visual communication. Students will write three papers demonstrating their ability to analyze and interpret visual texts. The method of instruction includes lecture, discussion, film and practice workshops. Considerations of gender, sex, race, sexuality, and class will be interwoven throughout the course materials and discussions.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1161", "course_title": "COMMUNICATION ETHICS", "description": "Contemporary society offers a wide variety of topics for ethical consideration: deception, lying, fidelity in relationships, hate speech, harassment, privacy, intellectual property, pornography and many others. This class examines the ethical dimensions of communication through the prism of case studies. Students are introduced to traditional forms of ethical reasoning as well as emerging concerns raised by the internet and digital media. One major question that the course addresses is the following: do the internet and new information technologies represent qualitatively new ethical challenges or are these versions of traditional ethical dilemmas? The bulk of class time uses discussion and case studies to emphasize the practice of ethical deliberation and the ability to reason about ethical issues and problems.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1710", "course_title": "SENIOR THESIS IN COMMUNICATION", "description": "Research on a special project in rhetoric, communication, or media. The study will be embodied in a thesis supervised by the instructor and approved by additional departmental faculty.", "completed": false, "prereq_count": 0}, {"dept_code": "COMMRC", "id": "1730", "course_title": "SPECIAL TOPICS IN COMMUNICATION", "description": "This course covers a specialized topic in communication. Topics vary every semester.", "completed": false, "prereq_count": 1}, {"dept_code": "COMMRC", "id": "1732", "course_title": "SPECIAL TOPICS IN MASS COMMUNICATION", "description": "This course covers a specialized topic in mass communication. Topics vary every semester.", "completed": false, "prereq_count": 1}], "links": [{"source": "0300", "target": "1102"}, {"source": "0300", "target": "1106"}, {"source": "0300", "target": "1109"}, {"source": "0300", "target": "1730"}, {"source": "0310", "target": "1111"}, {"source": "0310", "target": "1114"}, {"source": "0310", "target": "1143"}, {"source": "0310", "target": "1160"}, {"source": "0320", "target": "1105"}, {"source": "0320", "target": "1121"}, {"source": "0320", "target": "1122"}, {"source": "0320", "target": "1125"}, {"source": "0320", "target": "1126"}, {"source": "0320", "target": "1732"}, {"source": "0520", "target": "1111"}]}