{"nodes": [{"dept_code": "FP", "id": "0001", "course_title": "ACADEMIC FOUNDATIONS", "description": "Academic Foundations is designed especially for first-term students as an academic orientation to the Dietrich School of Arts and Sciences. Through class work and out-of-class activities, students will gain knowledge of the educational opportunities at the University, the cultural events on and off campus, and an understanding of what it means to be a college student.", "completed": false}, {"dept_code": "FP", "id": "0002", "course_title": "ACADEMIC FOUNDATIONS - ACADEMIC COMMUNITY", "description": "Academic Foundations - Academic Community is designed especially for first-term students enrolled in an Academic Community (AC). The course is an academic orientation to the Dietrich School of Arts and Sciences with a focus on the theme of the Academic Community. Through class work and out-of-class activities, students will gain knowledge of the educational opportunities at the University, the cultural events on and off campus, and an understanding of what it means to be a college student.", "completed": false}, {"dept_code": "FP", "id": "0003", "course_title": "FIRST-YEAR SEMINAR", "description": "First-Year Seminar (FP 0003) fulfills the Seminar in Composition requirement and includes Academic Foundations (FP 0001). Academic Foundations is designed especially for first-term students as an academic orientation to the Dietrich School of Arts and Sciences. Through class work and out-of-class activities, students will gain knowledge of the educational opportunities at the University, the cultural events on and off campus, and an understanding of what it means to be a college student. Additional meetings and activities will occur outside of class time.", "completed": false}, {"dept_code": "FP", "id": "0004", "course_title": "ACADEMC FOUNDATIONS - BRIDGES", "description": "Academic Foundations - BRIDGES is designed especially for first-term students participating in the BRIDGES program. Through class work and out-of-class activities, students will gain knowledge of the educational opportunities at the University, the cultural events on and off campus, and an understanding of what it means to be a college student.", "completed": false}], "links": [{"source": "0001", "target": "0002"}, {"source": "0001", "target": "0004"}]}