{"nodes": [{"dept_code": "LING", "id": "0007", "course_title": "ESL WRITING INTERMEDIATE", "description": "This is an intermediate writing skills course for non-native speakers of English, covering (a) the process and mechanics of writing a research paper (b) composition writing, with a focus on expository writing for college work (c) selected grammar skills.", "completed": false}, {"dept_code": "LING", "id": "0009", "course_title": "ESL WRITING ADVANCED", "description": "This course is intended for foreign students who need work on advanced composition skills in English covering (a) the process and mechanics of writing a research paper (b) composition writing, with a focus on expository writing for college work (c) selected grammar skills.", "completed": false}, {"dept_code": "LING", "id": "0010", "course_title": "ESL READING AND VOCABULARY", "description": "This is an advanced reading skills course for non-native speakers of English, emphasizing the type of reading required in University-level course work. The course includes intensive reading of passages from the course text, extensive reading of academic or other material selected by the student or instructor, speed improvement and vocabulary development.", "completed": false}, {"dept_code": "LING", "id": "1000", "course_title": "INTRODUCTION TO LINGUISTICS", "description": "This course is a survey of general linguistics, emphasizing the theory and methodology of the traditional central areas of the field--phonetics, phonology, morphology, and syntax- with special concentration on phonological and syntactic theories and analytical techniques. The remainder of the course will be devoted to phonetics, morphology, historical linguistics, semantics and pragmatics, sociolinguistics, and psycholinguistics.", "completed": false}, {"dept_code": "LING", "id": "1050", "course_title": "COMPUTATIONAL METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}, {"dept_code": "LING", "id": "1235", "course_title": "LANGUAGE, GENDER AND SEXUALITY", "description": "The course considers the ways in which linguistic patterns are sensitive to the social categories of gender and sexuality, including intersectional categories such as race, class, and age, and the role of power and privilege in these patterns. The main questions considered are: How does language categorize the gender/sexuality world in both grammar and interaction? How do speakers display, create, and orient to gender, sexuality, and desire in interaction? How and why do people display different ways of speaking based on their gender/sexual identities?", "completed": false}, {"dept_code": "LING", "id": "1263", "course_title": "CROSS-CULTURAL COMMUNICATION", "description": "This course is designed for those planning to work or live in a situation which serves as an interface between two or more cultural groups, and also for those who are interested in matters of language and culture. The curriculum deals with aspects of culture as they interact with language, and specific topics (e.g. Dialects; language in situations of cultural contact; and the implications of cross cultural communication differences for education policy).", "completed": false}, {"dept_code": "LING", "id": "1267", "course_title": "ASPECTS OF SOCIOLINGUISTICS", "description": "Aims at providing insights into how social relationships influence language, and how language can play a role in shaping social relationships, both in the individual and societal level. Some of the issues we will look at are; attitudes towards languages, dialects and society; social differentiations of language; black English; multilingualism; bilingual education and language planning.", "completed": false}, {"dept_code": "LING", "id": "1269", "course_title": "LINGUISTIC VARIATION AND CHANGE", "description": "", "completed": false}, {"dept_code": "LING", "id": "1330", "course_title": "INTRODUCTION TO COMPUTATIONAL LINGUISTICS", "description": "This is a course designed to introduce students in linguistics to the foundations and real-world applications of computational linguistics. Students will learn how core aspects of human language - words, morphology, grammar, and meaning - are represented and processed computationally. They will also be introduced to the challenges of real-world language engineering problems and discover how the latest language technologies and artificial intelligence systems seek to solve them. Many practical applications will be covered: search, document classification, spell checking, machine translation, corpus exploration, and more. Throughout the course, there will be a big emphasis on hands-on training; students will work extensively with popular natural language processing platforms. NOTE: The Python prerequisite (CS 8, 10-12) can be waived upon proof of Python knowledge. Please email the instructor.", "completed": false}, {"dept_code": "LING", "id": "1520", "course_title": "INTRODUCTION TO ARABIC LINGUISTICS", "description": "In the first half of this course, students will learn about the linguistic structure of modern standard Arabic and related dialects with a special focus on the phonology, morphology and syntax. Material in the second half of the course will focus primarily on social issues related to the Arabic language including discourse, dialectology and language variation, diglossia and language contact.", "completed": false}, {"dept_code": "LING", "id": "1578", "course_title": "PHONETICS AND PHONEMICS", "description": "This course provides an introduction to the production, recognition, and transcription of speech sounds in various languages of the world, and to the patterning of these sounds in phonological systems. Emphasis is on articulatory phonetics, though there is also some discussion of acoustic and experimental phonetics.", "completed": false}, {"dept_code": "LING", "id": "1721", "course_title": "SOCIOLINGUISTICS OF SIGN LANGUAGE", "description": "There are various sociolinguistic topics that one must consider with respect to signed languages of the deaf. Regarding language contact, ambient languages-either signed or spoken-influence a signed language. Less than 10% of deaf people are exposed to signed language from birth, which results in unique phenomena. Additionally, signed languages exhibit variation based on a myriad of social and geographical factors. These topics, in addition to language planning and language policy, will be addressed in this course.", "completed": false}, {"dept_code": "LING", "id": "1773", "course_title": "MORPHOLOGY", "description": "Morphology, the study of words, is interrelated with the syntax, the phonology, the lexicon, and semantics. The purpose of this course is to develop operational competence, through problem solving and discussion, in the major aspects of morphological theory. Theoretical issues to be addressed will include lexical phonology, prosodic morphology, morphology and logical form, morphology and valence alternations.", "completed": false}, {"dept_code": "LING", "id": "1820", "course_title": "LINGUISTICS IN THE LAB", "description": "This course is a bit different from other linguistics courses in that it is not focused on a particular subject area of linguistics, but rather an approach to doing linguistics: our goal is to learn how to think about, design, and implement a basic experiment. We will touch on a variety of topics that will be familiar from other courses: semantic representations, phonemic categories, sociolinguistic identity and stereotyping, and syntactic constituency. Satisfies the methods requirement for the major.", "completed": false}, {"dept_code": "LING", "id": "1844", "course_title": "RESEARCH METHODS", "description": "Upon successful completion of this course, students will have a broad knowledge of the theoretical, philosophical, ethical, and practical issues of, and possibilities for, researching language in the field of linguistics. In addition to being able to evaluate the methods used in linguistics research, students will be able to choose the proper methods for their own studies and be able to articulate the reasons for choosing that methods or those methods. They will be able to design the broad outlines of the study and where and how to discover resources to fully develop those methods. They will also be able to coordinate the practical aspects of a study, such as participant recruitment, data management, and Institutional Review Board (IRB) approvals. The main goal for this course is that when students are given some linguistic question or problem, they have the experience and ability to think through appropriate research methods in order to answer such a question.", "completed": false}, {"dept_code": "LING", "id": "1873", "course_title": "ACCELERATED MORPHOLOGY", "description": "Students in this course will: understand and define relevant concepts used to discuss morphology; explore the theoretical description of morphology; develop the ability to organize linguistic data as a first step in analysis / to apply key concepts to linguistic problems and original data; analyze complex words in languages other than English and determine the meanings of the parts; describe simply and appropriately how the derivational and/or inflectional morphemes behave in a particular language problem; compare competing analyses and provide justification for selecting one analysis over another; and, apply knowledge of morphology in reading empirical research with a critical eye, including articles that focus on a range of languages (i.e., Dutch, English, French, Frisian, German, Hungarian, Russian, Spanish, Swahili) and morphological phenomena (e.g., compounding, diminutivization, grammatical gender, number, mood, prefixation, etc.)", "completed": false}, {"dept_code": "LING", "id": "1878", "course_title": "ACCELERATED PHONETICS AND PHONEMICS", "description": "In this course, students will acquire the conceptual framework and the practical skills to do further work in phonetics and phonology. Students will learn about: what a sound system is; which questions drive research on speech sounds; acoustics, the acoustic signal, and how it can be represented visually and measured; the acoustics of speech production and acoustics in relation to hearing and perception; and acoustic descriptions of sounds. At the end of the course, students will study articulatory phonetics.", "completed": false}, {"dept_code": "LING", "id": "1900", "course_title": "LINGUISTICS CONSULTING/INTERNSHIP: CONNECTING LINGUISTICS TO THE COMMUNITY AND INDUSTRY", "description": "", "completed": false}, {"dept_code": "LING", "id": "1951", "course_title": "LANGUAGES OF THE WORLD", "description": "This course is a survey of language classification, language structures, and language contact. It concentrates on two main questions: first, how do languages resemble, and differ from, each other in sounds, forms, and syntax? And second, what are some linguistic and sociopolitical results of situations in which two or more languages come into contact? The context for these investigations will be a study of selected language families, both in class and in individual student projects (including some elicitation of data from native speakers of various languages).", "completed": false}], "links": [{"source": "1000", "target": "1330"}, {"source": "1000", "target": "1520"}, {"source": "1000", "target": "1578"}, {"source": "1000", "target": "1721"}, {"source": "1000", "target": "1773"}, {"source": "1000", "target": "1873"}, {"source": "1000", "target": "1878"}]}