{"nodes": [{"dept_code": "HUN", "id": "0101", "course_title": "HUNGARIAN 1", "description": "The greatest part of the first term will be devoted to the presentation and practice of the basic sound patterns of the language, its fundamental sentence patterns, and sufficient vocabulary to illustrate and practice them. An introduction to the writing system will be offered together with the opportunity to acquire elementary writing and reading skills.", "completed": false}, {"dept_code": "HUN", "id": "0103", "course_title": "HUNGARIAN 3", "description": "The first term of the second year will concentrate on the further development of fluency in oral production and the improvement in the student's ability to understand the flow of speech as uttered by a native speaker. Increased attention will be paid to reading as a means of augmenting a recognition vocabulary and writing as a drill and as a means of consolidating and communicating the knowledge gained.", "completed": false}, {"dept_code": "HUN", "id": "0105", "course_title": "HUNGARIAN 5", "description": "This course builds upon the foundations from previous levels of Hungarian to help you refine and consolidate your knowledge from those levels and to expand your speaking, listening, reading and writing skills in more complex communicative situations. By further developing these skills, you will be able to express yourself creatively in both written and spoken Hungarian with more advanced-level grammar, context-specific vocabulary and a more thorough understanding of the cultural nuances that influence interactions in the language. We will also continue to develop cultural understanding of Hungary's customs, traditions, history and geography. Learning outcomes: Upon completion of the course, students who have attended classes and successfully completed all assignments, tests and quizzes with a minimum grade of B- should be able to: successfully apply their knowledge of the fundamental conventions of the language (e.g., word order, conjugation patterns, verb modes, noun cases) to analyze and create spoken and written discourse in familiar and several unfamiliar contexts, narrate and describe in all time frames using connected discourse of paragraph length, using aspect appropriately, in speech and writing incorporate a number of cohesive devices in their writing when providing descriptions or summaries, understand short spoken and written conventional narrative and descriptive texts, confidently relying on contextual clues if necessary , converse confidently with sufficient accuracy, clarity and precision when dealing with familiar situations, formally and informally, have a more in-depth understanding of Hungarian traditions, customs, geography and history. Grammar topics will include: review and expansion of previously learnt material (e.g. the conditional, the imperative-subjunctive, possessives, postpositions), the causative, infinitives with endings, relative clauses and various types of pronouns.", "completed": false}, {"dept_code": "HUN", "id": "1909", "course_title": "SPECIAL TOPICS IN HUNGARIAN", "description": "The syllabus will change each time this course is offered.", "completed": false}, {"dept_code": "HUN", "id": "1915", "course_title": "FULBRIGHT SEMINAR IN HUNGARIAN STUDIES", "description": "Hungary today is a key site for competing plans for state- and peoplehood in the European Union. The country is also critical for making sense of the relationship between Europe's imperial-colonial legacies, Central Europe's capitalist and (post)socialist transformations, and EU integration, while providing deeper insight into the global issues of 'politics from below,' human rights and security, and migration. This is an interdisciplinary course taught by a visiting Hungarian Fulbright distinguished scholar. The content of the course will depend on the field and research of the individual scholar, but will typically explore history, culture, politics and / or society from a transnational and global perspective, focusing on contemporary Hungary within the broader context of Central Europe.", "completed": false}], "links": []}