{"nodes": [{"dept_code": "KOREAN", "id": "0003", "course_title": "SECOND YEAR KOREAN 1", "description": "The first term of the second year will concentrate on the further development of fluency in oral production and the improvement in the student's ability to understand the flow of speech as uttered by a native speaker. Increased attention will be paid to reading as a means of augmenting a recognition vocabulary and writing as a drill and as a means of consolidating and communicating the knowledge gained.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "0005", "course_title": "THIRD YEAR KOREAN 1", "description": "Students will build on previously learned material and learn increasingly complex grammar patterns and build more sophisticated vocabulary for everyday interactions in all learning skill areas: speaking, listening, reading, and writing. Will read texts that focus on Korean society and history.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "0023", "course_title": "KOREAN LANGUAGE: THEN AND NOW", "description": "The primary goal of this course is to offer a basic level linguistic and historical knowledge of the Korean language to students with no background or knowledge in Korean. Also, the course introduces the language within a broader context of culture and history of Asian languages. The course covers 1) the origin and history, 2) relationship with other Asian languages: Chinese, Japanese, and Dravidian in particular, 3) creation and development of the alphabet Han.kul, 4) sounds and their diachronic and synchronic changes, 5) basic structures and socio-cultural aspects, and 6) political and geographical dialects of the Korean language. At the end of the semester, students are expected to gain an introductory linguistic and historical knowledge of the Korean language for their further studies in the Korean language and linguistics.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "0070", "course_title": "WORLD OF KOREA: PAST AND PRESENT", "description": "Intro to Korean society/culture through study of acclaimed film \"Chunhy-ang, based on famous 18thc Korean literature work, providing complex window to late Korean traditional culture, literature and performing arts. Students will ac quire tools to understand diversity in aspects of many cultures, as well as a changing political system. Topics include: family structure and marriage, gender issues, class system, agricultural life of Korean society, education, relations to other neighboring cultures and various forms of art expression.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "0075", "course_title": "INTRODUCTION TO KOREA THROUGH FILMS", "description": "Introduces Korean cinema to students in broader (and at times narrow) cultural, social, and aesthetic contexts to investigate transnational media production and circulation, globalization, consumer culture, commercialization, and construction of national, ethnic and gender identities. Through this course, students will learn more about specific issues pertaining to Korea and its people, as well as gain familiarity with some prominent film directors of Korea's. They will develop a critical and historical consciousness of Korean visual culture, assessing the worth and content of the films.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "0084", "course_title": "INTRODUCTION TO MODERN KOREAN LITERATURE", "description": "Students examine major Korean writers from the early 20th century to the present through identifying key thematic and formal issues in modern Korean literature and to situate them within a larger historical and cultural context.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "1050", "course_title": "FOURTH YEAR KOREAN", "description": "Designed to advance students to greater strengths in reading and writing skills and socio-cultural knowledge of Korean beyond high intermediate level. Students will develop skills in reading and listening to various authentic materials, and enhance speaking and writing skills to discuss issues of contemporary Korean society and culture. The goals of the course also include furthering aural comprehension of contemporary television documentaries, news and drama with decreased reliance on pedagogical aids. This course is student centered and students will develop their knowledge of Korean lexicon (including Chinese characters of Sino-Korean) and grammar through their own readings/writings and class discussions. Students will write short research papers throughout the semester. Class will be conducted in Korean exclusively, and uses a combination of lectures and discussions. Both lectures and discussions are based on assigned readings and discussion topics that will be distributed through bi-weekly schedules.", "completed": false, "prereq_count": 0}, {"dept_code": "KOREAN", "id": "1052", "course_title": "SPECIAL TOPICS IN ADVANCED KOREAN", "description": "This course is intended for students who have finished KOREAN 1051: FOURTH YEAR KOREAN 2, or have an equivalent proficiency. The course aims to develop students' Korean language proficiency beyond advanced level and strengthen their knowledge of the history, politics, society, international relations, and culture of contemporary Korea. The class is completely in Korean and uses authentic materials such as book chapters, short stories, newspapers, journals, and movies. Students are to increase their abilities to comprehend content, discuss main topics, analyze and compare facts and opinions of the materials provided and other sources throughout the semester.", "completed": false, "prereq_count": 0}], "links": []}