{"nodes": [{"dept_code": "NROSCI", "id": "0080", "course_title": "BRAIN AND BEHAVIOR", "description": "This course analyzes the relations between brain function and overt behaviors. Topics include: the control of movement, sensory processing, mechanisms controlling sleep, arousal, and other circadian rhythms, hunger and thirst, learning and memory, the biological bases of neuropsychiatric disorders, and the functioning of the cerebral hemispheres. Many clinical disorders will be discussed including language disorders, amnesia, epilepsy, depression, anxiety, schizophrenia, and Alzheimers disease.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "0081", "course_title": "DRUGS AND BEHAVIOR", "description": "This course provides a general background in the fields of neuroscience and psychopharmacology. The course examines the behavioral effects and biological mechanisms of action of the major groups of psychoactive compounds, including stimulants, depressants, narcotics, and hallucinogens. Drugs used in the treatment of common psychiatric neurological disorders, such as schizophrenia, depression, and Parkinson's disease, will also be discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1000", "course_title": "INTRO TO NEUROSCIENCE", "description": "This course examines the anatomy, physiology, and pharmacology of the central and peripheral divisions of the nervous system. Specific topics covered include neuronal function, synaptic transmission, sensory processing, movement, sleep and wakefulness, hunger, thirst, caloric and body fluid homeostasis, recovery of function after brain damage, and various neurological and psychiatric disorders.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1011", "course_title": "FUNCTIONAL NEUROANATOMY", "description": "This course deals with human neuroanatomy and covers the basic structure of the central nervous system from spinal cord to cerebral cortex. Emphasis is placed on major systems and subsystems within the brain, and on their functional significance. The basic structure and morphology of nerve cells will be covered.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1012", "course_title": "NEUROPHYSIOLOGY", "description": "This course examines the functioning of neurons and synapses, the basic units responsible for fast communication within the nervous system. The course focuses on the elegant use of electrical mechanisms by the nervous system, and on the powerful quantitative approach to scientific investigation that is fundamental to neurophysiology. Topics include: principles of electric current flow exploited by the nervous system; the basis of the resting potential of neurons; the structure and function of voltage-gated and neurotransmitter-gated ion channels; the generation and propagation of action potentials; the physiology of fast synaptic communication.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1013", "course_title": "FUNCTIONAL NEUROANATOMY (UHC)", "description": "This is an honors course that deals with issues of how we can understand the function of the human brain through the study of neurological diseases. The manifestations of selected neurological diseases are presented and discussed in the context of how they can be analyzed and understood through application of the findings from basic research in neuroscience.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1014", "course_title": "SPEAKING OF SCIENCE", "description": "Students will learn strategies for giving presentations about science to both a scientific audience and a public audience. Topics covered will include 1) how to engage our audience, 2) the art of breaking down your message, 3) tips to make clear, interesting slides, and 4) pointers on presentation style. All audiences want to learn interesting new scientific information, and have it delivered as a good story in an understandable manner by a personable, easy to approach person. Communication skills, including knowing your audience and why they are interested in the information you are speaking about, how to translate scientific jargon into understandable concepts for the public, and how to keep the audience engaged will be discussed. Pointers will be given on answering questions, being conversational, and conveying the \"big picture\". Students will give a number of presentations in this course and learn to receive and give feedback effectively.", "completed": false, "prereq_count": 2}, {"dept_code": "NROSCI", "id": "1017", "course_title": "SYNAPTIC TRANSMISSION", "description": "This course examines the mechanisms by which neruotransmitters are synthesized and released and the biochemistry of synaptic responses. Basic physiological, biochemical, and morphological characteristics of neuronal transmission will be discussed. An emphasis will be placed on the experimental approaches used to examine these processes.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1027", "course_title": "NEUROSCIENCE PROSEMINAR", "description": "Program graduate students, postdoctoral fellows, and faculty will present an overview of their respective research topics and discussion of current research articles on that topic. Critical analysis of experiments and research is emphasized.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1033", "course_title": "NEURAL BASIS OF VISION", "description": "This course examines the neural basis of visual perception and action. It is divided into four units. The first unit covers methods for studying visual perception and its neural basis and discusses the neural hardware that underlies our ability to see. The second unit covers object recognition, cognitive factors that influence visual perception, and how the way we are planning to use visual information affects the way it is encoded in the brain. Unit three focuses on perceptual decision-making and using visual motion as a model system. We will also touch on some data analysis methods for using psychophysical and neuronal data to figure out how we make decisions based on visual information. The fourth unit will focus on perception of color and depth and on how visual perception develops after birth. Throughout the course, we will focus on what neural mechanisms can tell us about how we perceive the visual world and on how we can design experiments to better understand the relationship between neural mechanisms and perception.", "completed": false, "prereq_count": 2}, {"dept_code": "NROSCI", "id": "1036", "course_title": "NEUROBIOLOGY OF AGING", "description": "This course examines age-related changes in neurobiological systems, including motor, sensory, cognitive, and neuroendocrine. Emphasis will be placed on distinguishing biochemical, molecular, physiological, and behavioral changes associated with normal aging versus changes associated with pathologic conditions such as Alzheimer's disease. Introductory lectures will discuss different theories of aging, how aging is studied in the laboratory, and how these relate specifically to neuroscience.", "completed": false, "prereq_count": 3}, {"dept_code": "NROSCI", "id": "1041", "course_title": "DEVELOPMENTAL NEUROSCIENCE", "description": "This course is designed to provide an overview of issues that govern the developmental assembly of a complex nervous system. Topics covered include formation of neural tube and neural crest, birth and proliferation of neurons, cell migration, neuronal differentiation, molecular control of neural development, synapse formation, neuron-target interactions, and synaptic plasticity. These topics will be discussed in the context of experimental results obtained by anatomical, biochemical and electrophysiological techniques using vertebrate and invertebrate animals.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1042", "course_title": "NEUROCHEMICAL BASIS OF BEHAVIOR", "description": "Neurochemistry is the study of the many chemicals - neurotransmitters, neuromodulators, hormones, and more - that influence the brain and nervous system. This class will focus on understanding the role of various neurochemicals in normal (and some abnormal) behavior, from behaviors that seem simple - like eating and sleeping - to complex cognition and social behavior. After an initial unit on neurochemical structure, classification, and signaling pathways, we will segue into topics including sleep and circadian rhythms; sex and social status; reward pathways and addiction; and decision-making. We will also examine the neurochemical basis of selected psychiatric disorders.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1043", "course_title": "NEURAL PLASTICITY", "description": "This class is designed to establish conceptual and technical foundations for students who are interested in plasticity-associated neuroscience. Whereas the class will go through major findings in the plasticity field, the emphasis will be placed on why these findings are important, how these findings were made, and what challenges/debates these findings trigger.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1049", "course_title": "RESEARCH TOPICS IN NEUROSCIENCE", "description": "This course is required for all newly declared majors. This course will provide students with an overview of research conducted by neuroscience faculty and familiarize students with potential research topics.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1112", "course_title": "FUNCTIONAL NEUROANATOMY HONORS PRACTICUM", "description": "This honors course supplements the material in the companion lecture course, NROSCI 1011, in two ways. In the initial laboratory portion of the course, human and animal brain tissue will be examined to provide students a first-hand knowledge of the structures that make up the brain and spinal cord. Subsequently, major journal articles that were key in establishing the scientific principles discussed in NROSCI 1011 will be reviewed. This portion of the course will allow students to gain insights into the methods that neuroscientists use to learn about the nervous system. This is a three credit course and will count as an advance elective for majors.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1200", "course_title": "NEUROPHARMACOLOGY OF ADDICTION", "description": "This course is designed to provide an overview of the biological basis of addiction and the neuropharmacology of drugs of abuse and dependence, including basic principles of drug action as well as comprehensive coverage of the major classes of drugs (opioids, stimulants, nicotine, alcohol, sedatives, cannabis, hallucinogens). Students will study mechanisms of action, effects, pharmacokinetics as well as tolerance and dependence for each of these drugs/drug classes. The reasons for addiction including biological, genetic, cultural and other determinants will be discussed. Students will learn about laboratory-based methods used in addiction research, common pharmacotherapies used to manage alcohol and drug addiction, and consider public health issues associated with addiction.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1250", "course_title": "HUMAN PHYSIOLOGY", "description": "This course begins with a general introduction on cell biology, physiology of nerves and muscle, and intercellular communication. The course will then survey the function of the following systems: cardiovascular, respiratory, renal, and gastrointestinal. Each system discussed will be integrated into the larger function of homeostasis, emphasizing its adaptation during pathology and challenges (e.g., exercise). The formal lectures will be supplemented by a required recitation.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1800", "course_title": "NEUROSCIENCE/WRITING PRACTICUM", "description": "This course is restricted to neuroscience majors & minors and fulfills the writing requirement for the major. It includes extra emphasis on and credit for instruction in proper writing for the discipline of neuroscience using topics from an appropriate co-requisite neuroscience course taken in the same term.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1801", "course_title": "NEUROSCIENCE/WRITING PRACTICUM", "description": "This course is restricted to neuroscience majors & minors and fulfills the writing requirement for the major. It includes extra emphasis on and credit for instruction in proper writing for the discipline of neuroscience using topics from an appropriate co-requisite neuroscience course taken in the same term.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1962", "course_title": "THESIS RESEARCH/WRITING", "description": "This course involves writing a thesis based on independent neuroscience research that is supervised by a faculty member of the department of neuroscience or some other department in which neuroscience research is performed.", "completed": false, "prereq_count": 0}], "links": [{"source": "1000", "target": "1011"}, {"source": "1000", "target": "1012"}, {"source": "1000", "target": "1013"}, {"source": "1000", "target": "1014"}, {"source": "1000", "target": "1017"}, {"source": "1000", "target": "1027"}, {"source": "1000", "target": "1033"}, {"source": "1000", "target": "1036"}, {"source": "1000", "target": "1041"}, {"source": "1000", "target": "1042"}, {"source": "1000", "target": "1043"}, {"source": "1000", "target": "1049"}, {"source": "1000", "target": "1112"}, {"source": "1000", "target": "1200"}, {"source": "1011", "target": "1033"}, {"source": "1011", "target": "1036"}, {"source": "1013", "target": "1014"}, {"source": "1013", "target": "1036"}]}