{"nodes": [{"dept_code": "ENGLIT", "id": "0300", "course_title": "INTRODUCTION TO LITERATURE", "description": "This course examines the definitions, functions, and values of literature by reading across a range of genres, styles, historical periods, and cultures. It will also introduce various reading strategies for making sense of plays, poems, novels, short stories, and essays.", "completed": false}, {"dept_code": "ENGLIT", "id": "0310", "course_title": "THE DRAMATIC IMAGINATION", "description": "This course introduces students to the major dramatic forms and compares the ways playwrights from several centuries use ideas, characters and dramatic techniques. We will consider how social, historical, and dramatic contexts influence our interpretations and evaluation, or may lead to alternative understandings of a play.", "completed": false}, {"dept_code": "ENGLIT", "id": "0315", "course_title": "READING POETRY", "description": "Poetry is usually the first literary form to evolve in a culture. Yet many today reject it as artificial, overly refined and removed from ordinary human experience. By studying various kinds of poetry, this course aims to help students break down the barriers between classic poems, contemporary poetry, and a more general lyric impulse. As the most highly condensed literary experience, poetry invites very close reading, so we will explore various techniques for making sense of poems.", "completed": false}, {"dept_code": "ENGLIT", "id": "0325", "course_title": "THE SHORT STORY", "description": "This course studies short stories that explore a variety of themes. It seeks to define the short story as a specific literary genre and to distinguish it from earlier forms of short narrative literature. It then goes on to examine the effects of literary, cultural and historical traditions on these stories and their reception.", "completed": false}, {"dept_code": "ENGLIT", "id": "0354", "course_title": "WORDS AND IMAGES", "description": "This interdisciplinary course explores the relationships between language and the diverse kinds of images that often accompany it (film, video, photography, book illustration, painting, etc.). The goal is to study the parallels and differences between images and words (as systems of communication) and to understand how they can productively interrelate within creative works such as literature, films, videos, and photographic studies.", "completed": false}, {"dept_code": "ENGLIT", "id": "0365", "course_title": "IMAGINING SOCIAL JUSTICE", "description": "This course questions the relationship between present and/or \"contemporary\" literature and past literary traditions. It is not a course solely in contemporary literature but a course that compares contemporary texts with texts from other periods. It investigates the contemporary as both a complex reworking of past narratives and traditions and as the production of the experimental and the new.", "completed": false}, {"dept_code": "ENGLIT", "id": "0506", "course_title": "LITERARY FIELD STUDIES", "description": "In this course, students will learn about and practice the various activities central to literary studies. Students will learn how to frame interesting critical inquiries and conduct original research, which could include historical research or contemporary cultural study. Students will engage with books as historical objects, which will include learning about the history of books and other print media and studying the ways that material factors shape writers' work. This could include visiting the library's Special Collections and/or a creative project around bookmaking. Students will engage in a variety of interpretive practices, including taking creative and inventive approaches to critical work and adapting texts for new purposes. Students will attend live performances and readings by diverse contemporary writers, gaining insight into the process of how great literature is made. Students will have the opportunity to find new intersections between literature and other disciplines. Finally, students will be invited to approach a range of writing projects as active makers, attending carefully to the formal elements of their own writing as well as that of others.", "completed": false}, {"dept_code": "ENGLIT", "id": "0512", "course_title": "NARRATIVE AND TECHNOLOGY", "description": "This course explores the ways in which new technologies impact how we engage with stories. It examines the relationship between traditional literary forms and contemporary media, such as hypertext, web logs, fan fiction, video games, comics, and interactive fiction. As a writing-intensive course, \"Narrative and Technology\" will ask students to write regularly in response to course texts and class discussions. Students will have opportunities not only to write critically about the relationships among narratives and technologies but also to write creatively, experimenting with interactive, hypermedia, and/or other new media forms.", "completed": false}, {"dept_code": "ENGLIT", "id": "0560", "course_title": "CHILDREN AND CULTURE", "description": "This course studies children's literature through an investigation of the history of childhood through its representations in children's books and other media.", "completed": false}, {"dept_code": "ENGLIT", "id": "0562", "course_title": "CHILDHOOD'S BOOKS", "description": "This course surveys the field of children's literature from its earliest beginnings to the present.", "completed": false}, {"dept_code": "ENGLIT", "id": "0570", "course_title": "AMERICAN LITERATURE", "description": "This first course in American literature explores the characteristic features of writings from the colonial period to the present. It emphasizes the interaction between literary texts and their social contexts, and examines the emergence of a national literature.", "completed": false}, {"dept_code": "ENGLIT", "id": "0573", "course_title": "LITERATURE OF THE AMERICAS", "description": "Literature of the Americas introduces students to important issues in the study of literature and culture by focusing on colonial and postcolonial traditions in regions of the Americas beyond the United States. Beginning with the European \"discovery\" of the \"new world\", it examines comparatively literary and other texts from Britain, the West coast of Africa, the US, Canada, the Caribbean and Latin America, tracing the emergence of distinctive literary traditions and preoccupations of the Americas through to significant modern incarnations.", "completed": false}, {"dept_code": "ENGLIT", "id": "0580", "course_title": "INTRODUCTION TO SHAKESPEARE", "description": "This course will focus on a number of Shakespeare's major plays from all phases of his career. Class discussion will consider the historical context of the plays, their characterization, theatrical technique, imagery, language and themes. Every attempt will be made to see the plays both as poems and as dramatic events.", "completed": false}, {"dept_code": "ENGLIT", "id": "0590", "course_title": "FORMATIVE MASTERPIECES", "description": "This course will study in some detail eight or nine of those masterpieces which form the largest part of what we now regard as the Western tradition of literature. The works chosen will come from various genres--epic poetry, drama, the novel, and satire. They will span the centuries from the classical periods of ancient Greece and Rome through the Renaissance and into the nineteenth century.", "completed": false}, {"dept_code": "ENGLIT", "id": "0610", "course_title": "WOMEN AND LITERATURE", "description": "An exploration of writings by and about women. Through our reading of various literary forms -- poetry fiction, autobiography -- we will explore the aspirations and realities of women's lives. We will consider how social issues -- class, race, etc. -- Affect women writers.", "completed": false}, {"dept_code": "ENGLIT", "id": "0612", "course_title": "LITERATURE AND SCIENCE", "description": "This course aims to restore and improve the dialogue between scientific and critical-humanistic ways of understanding the world. It examines the share both ways of knowing have had in shaping our culture and our ideas by studying (and developing critical perspectives on) both scientific and literary texts. Its goal is to produce an understanding of the common history of literature and science. The course usually focuses on a theme, issue, or topic that has historical range and contemporary relevance. Different versions of the course might focus on social, literary, and scientific understandings of gender; the social, literary, and scientific attitudes toward death and the dead; or the social, literary, and scientific definitions and theories about the \"\"human.\"\" Though works of science fiction may be studied, this is not a course in science fiction. This course should be of particular interest to students in the sciences, students of literature, students of philosophy, and students of history.", "completed": false}, {"dept_code": "ENGLIT", "id": "0613", "course_title": "ASIAN AMERICAN LITERATURE", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0618", "course_title": "WAR", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0620", "course_title": "THE GRAPHIC NOVEL", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0625", "course_title": "DETECTIVE FICTION", "description": "This course examines detective fiction in terms of its history, its social meaning and as a form of philosophizing. It also seeks to reveal the place and values of popular fiction in our lives.", "completed": false}, {"dept_code": "ENGLIT", "id": "0626", "course_title": "SCIENCE FICTION", "description": "This course introduces students to the major ideas, themes, and writers in the development of science fiction as a genre. Discussions will help students to understand and use critical methods for the analysis of science fiction. The topics covered include problems describing and defining the genre, contrasting ideologies in soviet and American science fiction, the roles of women as characters, readers and writers of science fiction, etc.", "completed": false}, {"dept_code": "ENGLIT", "id": "0628", "course_title": "WORKING CLASS LITERATURE", "description": "This course explores writing produced by working-class men and women. It traces its textual traditions and explores questions of the status of the \"working class\", its relation to self-understandings in ethnic or gender terms as well as the effect of class on social experience, social vision and cultural production. It explores as well the relation between worker-writers and the dominant literary tradition.", "completed": false}, {"dept_code": "ENGLIT", "id": "0630", "course_title": "SEXUALITY AND REPRESENTATION", "description": "This course will explore the relations between cultural texts and the shifting conceptualizations and figurations of sexuality and sexual politics over the past 150 years. The main objective of this course will be to understand the necessary but problematic relations between sexuality, cultural expression, and the social.", "completed": false}, {"dept_code": "ENGLIT", "id": "0646", "course_title": "APOCALYPSE", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0647", "course_title": "HARRY POTTER: BLOOD, POWER, CULTURE", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0648", "course_title": "NARRATIVE AND GRAPHIC PERSPECTIVES IN HEALTH HUMANITIES", "description": "This course emphasizes the narrating and understanding of difference as central to the education of those engaged in/with the healthcare field. Students will examine how narratives of neuro-diversity; gender barriers; racial inequities in education and health services, are all crucial issues for providers and receivers of medical care. By studying literature about medicine/the health professions from diverse perspectives, students in the course will learn to \"observe, parse, appreciate, critique, and creatively reimagine points of contact between individuals in healthcare sphere.\" Through a series of readings including Paul Kalanithi's When Breath Becomes Air; and a mixed-media biography such as Lauren Redniss's Radioactive; Damon Tweedy's Black Man in a White Coat; Danielle Ofri's What Patient Say, What Doctors Hear; and the Graphic Medicine Manifesto, this course will introduce students to an exciting new field that erases the boundaries between authoritative \"medical discourse\" and what is commonly assumed to be a non-serious genre, graphic novel/comics; between physicians and patients' modes of accessing information and exchanging knowledge; between academic \"essays\" and Critical Creative Work that engages rigorously with knowledge and experience. Through this series of readings, students will consider issues such as: What kind of health practitioner do you wish to be? What models exist for asking important questions about the nature of human empathy though knowledge of Other's stories? and how is awareness of identity and difference nurtured in the education of the healthcare providers? How can you begin to articulate or represent your own in rigorous but creative ways?", "completed": false}, {"dept_code": "ENGLIT", "id": "0655", "course_title": "REPRESENTING ADOLESCENCE", "description": "This course focuses on the question of how adolescence gets represented in a variety of genres, including young adult and children's literature; novels, plays and poetry aimed at adults that take adolescence as a theme; films and television programs; scientific, journalistic, or autobiographical commentaries on the nature of adolescence; and so on. This is one of the core courses for the children's literature certificate program, but all interested students are welcome.", "completed": false}, {"dept_code": "ENGLIT", "id": "0670", "course_title": "QUEER AND TRANSGENDER LITERATURE", "description": "\"Queer and Transgender Literature\" will examine the changing relationship between queer and transgender identities in literature, science and culture from the early twentieth century to the present. Students will learn to read literature in its historical context, pairing it with primary sources from relevant scientific and medical discourses, as well as locating it in competing literary criticism traditions in queer theory and transgender studies. The weekly course meetings will revolve around discussion of key works in queer and transgender literature, paired alternately with important literary criticism and primary sources. Classroom discussion and in-class writing assignments will focus on building these historicist and critical skills in sequence, so as to prepare students for their main assignment sequence, which asks them to apply the skills they are learning to generate their own contributions to debates in criticism about the proper boundaries between queer and transgender identities.", "completed": false}, {"dept_code": "ENGLIT", "id": "0699", "course_title": "LITERATURE AND SCIENCE LAB", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0712", "course_title": "CRITICAL MAKING", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0715", "course_title": "AUSTEN AND BRONTE", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "0717", "course_title": "FAIRY TRADITION", "description": "Fairies go by many names: the Folk, the Good People, the Other Crowd, Sidhe, fey. Usually beautiful, ethereal, and morally ambiguous, fairies are a staple of western folklore and legend. Once associated with the realm of the dead and lost magic, fairies are now creatures of children's literature and fantasy. The fairy tradition encompasses vital cultural questions about the work of imagination, magic, and vision in our understanding of ourselves and the world around us. Either elusive or non-existent, depending on perspective, fairy lore evokes issues related to: the reliability of witness and of the senses; privileged and discounted perception; the interplay of the imagination and knowledge; and the role of cultural authority. Students will consider the significance of these themes through aspects of fairy folklore, book history, portrayals of childhood, reception studies, and an end-of-term creative project.", "completed": false}, {"dept_code": "ENGLIT", "id": "1001", "course_title": "INTERACTIVE LITERATURE", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "1002", "course_title": "GAME, STORY, PLAY", "description": "", "completed": false}, {"dept_code": "ENGLIT", "id": "1005", "course_title": "LITERATURE AND THE ENVIRONMENT", "description": "This course examines the ways in which writers in English have engaged with the natural environment. We will read a range of authors, across time periods and up to the present day, to consider how they have looked critically at the human effects on ecosystems, and we will also study the interdisciplinary scholarly field of ecocriticism and its responses to such writings. Throughout, we will be attentive both to the literary qualities of writings about the environment and to their historical and political contexts.", "completed": false}, {"dept_code": "ENGLIT", "id": "1125", "course_title": "MASTERPIECES OF RENAISSANCE LITERATURE", "description": "This course studies prose, poetry and drama written in England between 1550 and 1660--an age of religious reformation, economic and social instability, intellectual revision and political revolution. It seeks to make sense of the renaissance in terms appropriate both to that time and to our own.", "completed": false}, {"dept_code": "ENGLIT", "id": "1170", "course_title": "ROMANTIC NATURE", "description": "This course concentrates on writings from 1790 through the 1830's that have come to be associated with romanticism. It explores the social, intellectual and aesthetic concerns of this movement and its relationships with its British and European cultural contexts.", "completed": false}, {"dept_code": "ENGLIT", "id": "1175", "course_title": "19TH CENTURY BRITISH LITERATURE", "description": "A study of the major writers and cultural issues of 19th century Britain situated in relation to the social and intellectual developments of the time.", "completed": false}, {"dept_code": "ENGLIT", "id": "1200", "course_title": "AMERICAN LITERATURE TO 1860", "description": "This course surveys literature produced in America before the Civil War. In the process it explores the historical, political, social and cultural factors that affected the development of that literature. It examines the work of writers who saw themselves as powerful framers of the national experience yet fearful they would have little effects on a culture confronting problems of slavery, divisiveness, literacy, economic change, immigration, etc.", "completed": false}, {"dept_code": "ENGLIT", "id": "1225", "course_title": "19TH CENTURY AFRICAN AMERICAN LITERATURE", "description": "This course will cover a wide range of materials, beginning with the late eighteenth-century poetry and prose of authors such as Phillis Wheatley and Olaudah Equiano and ending with Civil War, reconstruction, or gilded-age authors such as William wells brown, Frances Harper, Pauline Hopkins, or Paul Laurence Dunbar. Readings will include a variety of different genres of writing (slave narratives, poetry, drama, fictive and non-fictive prose) as well as pay passing attention to the significant African American intellectual and cultural movements that had a role in shaping these various literary productions.", "completed": false}, {"dept_code": "ENGLIT", "id": "1345", "course_title": "DOCUPOETRY", "description": "Docupoetry (also known as investigative poetry, creative nonpoetry, research-based poetry) is a form of creative writing that relies on a considerable amount of research. To explore various topics or issues, and to pursue new ways of knowing, poets incorporate historical documents, visual artifacts, scientific data, and other materials. The poems that emerge from the process are artistically and intellectually daring, as they interact with other genres (such as essay, memoir, testimony, reportage) and disciplines (history, ethnography, philosophy, geology, environmental science, among others). In this course students will gain familiarity with major forerunners of the practice and examine a diverse set of contemporary examples. In addition, they will spend most of the semester designing and developing their own research-based poems. Previous creative writing experience is welcome but not necessary. Workshop opportunities and instructor feedback will be provided.", "completed": false}, {"dept_code": "ENGLIT", "id": "1382", "course_title": "PRIZED BOOKS", "description": "How do metropolitan taste and recognition affect dominant and emergent literatures and nations? How do particular contexts and award-winning texts exert pressure on existing criteria and values? How does the category \"prized books\" also implicitly constitute and comment upon a body of literature that is \"unprized\"? How do prized books redefine notions of readership and citizenship in the world of globalization and electronic access? Such questions will open up the idea of \"world literature\" not as an afterthought to the canon of \"English\" literature, but as an integral and definitive part of it. Students will read literature, speeches, and essays by winners of the nobel and other global literary prizes such as the booker and the commonwealth.", "completed": false}, {"dept_code": "ENGLIT", "id": "1412", "course_title": "SECRET PITTSBURGH", "description": "How much do you know about the city outside Pitt? Have you explored a hillside neighborhood using stairways instead of streets? Visited the church with the largest collection of relics outside Europe? Eaten a macaroon prepared by a transplanted French baker? Pittsburgh has a rich cultural history, from labor disputes to a vibrant arts scene. It's also a city with secrets. Students in this course will explore Pittsburgh's most unusual sites and locales; learn about the city's history and the literature it has inspired; and research and write entries for a public guide to secret Pittsburgh.", "completed": false}, {"dept_code": "ENGLIT", "id": "1600", "course_title": "COMPUTATIONAL METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. The goals of this course are to learn how to identify research questions in the humanities that are amenable to computational analysis and processing, along with designing and implementing xml-based computational systems to explore those questions.", "completed": false}, {"dept_code": "ENGLIT", "id": "1645", "course_title": "CRITL APPRCH TO CHILDREN'S LIT", "description": "This course examines a variety of children's books from a number of theoretical perspectives; historical, feminist, transactional, structuralist, etc. The implications of theory will be emphasized. We will place children's books and reading in the wider context of the emotional, cognitive, and moral development of the child, the popular culture of childhood, and contemporary multicultural society.", "completed": false}, {"dept_code": "ENGLIT", "id": "1760", "course_title": "TOPICS IN POPULAR CULTURE", "description": "Focuses on the emergence of popular culture, the relationship of modern social and economic practices, mass audiences, and modes of cultural representation, or specific popular forms.", "completed": false}, {"dept_code": "ENGLIT", "id": "1900", "course_title": "PROJECT SEMINAR", "description": "The junior seminar, required for English literature majors, offered in varied versions, will investigate methods and goals of literary historical study by directing attention to broad historical and theoretical issues and to long-durational developments and transformations of literacy cultural practices. Will include a range of literary, theoretical and historical texts selected to enable exploration of issues and problems that cut across traditional designations of literary historical periods.", "completed": false}, {"dept_code": "ENGLIT", "id": "1910", "course_title": "SENIOR SEMINAR", "description": "Intensive study of a single topic or figure that assumes previous work in related literary historical and critical areas. Each seminar moves toward a final paper that integrates earlier literary study with the specific critical perspective developed in this course.", "completed": false}, {"dept_code": "ENGLIT", "id": "1913", "course_title": "ADVANCED RESEARCH IN LITERATURE", "description": "Working closely with faculty members on her/his senior thesis committee to do the primary reading, foundational research, and exploratory writing for the senior thesis, the student will read a majority of the primary literary works and a significant amount of criticism and complete a minimum of 20 pages of exploratory writing or a draft of the thesis.", "completed": false}, {"dept_code": "ENGLIT", "id": "1914", "course_title": "SENIOR HONORS THESIS", "description": "In this course, the student will complete all remaining research for the senior thesis and will work closely with the faculty members on his/her committee to plan, write, and revise the senior thesis.", "completed": false}, {"dept_code": "ENGLIT", "id": "1925", "course_title": "UNDERGRAD TEACHING IN LITERATURE", "description": "Students enrolled in this course will work with an instructor as an assistant to any upper-level course being offered to English majors. They will help with course materials and generate class discussion.", "completed": false}], "links": [{"source": "0560", "target": "1645"}, {"source": "0612", "target": "0699"}]}