{"nodes": [{"dept_code": "LCTL", "id": "0161", "course_title": "AMHARIC 1", "description": "This course will help you learn to understand, and to express yourself creatively in both spoken and written Amharic. You will acquire basic knowledge of everyday Amharic and of the country and culture of Ethiopia. We will focus on building communicative competence and conversational proficiency, while simultaneously building a solid foundation in Amharic grammar, writing, listening and reading comprehension skills. You will be expected to memorize vocabulary and utilize it in both speech and writing. In this course, you will learn the following thematic / cultural and grammatical topics: Thematic and Cultural Topics; Social interaction; Introducing oneself; Family members and housing; Activities and personal information; Foods; Time; Traveling; Holidays & Ceremonies; Daily routine; Nature Grammar Topics: Amharic alphabet & pronunciation; Pronouns & Indirect subjects; Verbs, Plural marker; Description & comparison; Subordinate Clauses; Preposition; Expressions", "completed": false, "prereq_count": 0}, {"dept_code": "LCTL", "id": "0351", "course_title": "HAITIAN CREOLE 1", "description": "This course will help you learn to understand, and to express yourself creatively in both spoken and written Haitian Creole. You will acquire basic knowledge of everyday Haitian Creole and of the country and culture of Haiti. We will focus on building communicative competence and conversational proficiency, while simultaneously building a solid foundation in Haitian Creole grammar, writing, listening and reading comprehension skills. You will be expected to memorize vocabulary and utilize it in both speech and writing. In this course, you will Talk about yourself (origin, age, appearance), your studies, activities and preferences; Ask others about their life, studies, activities and preferences; Describe where you live and with whom you live (home, family); Discuss present, future, and past events, and tell time; Read short passages on topics such as Haitians and Haitian culture", "completed": false, "prereq_count": 0}], "links": []}