{"nodes": [{"dept_code": "EM", "id": "1102", "course_title": "EMERGENCY MEDICINE TECHNICIAN", "description": "This course providesÂ learners with the cognitive knowledge and values to develop as an emergency medical professional at the basic life-support level. This course meets allÂ minimum training requirements as established by the U.S. Department of Transportation in the EMT, National Education Standards. This course provides the learner with the opportunity to develop basic life-support psychomotor skills. Successful completion of this course makes the learner eligible to become certified by the National Registry of EMT's and the Pennsylvania Department of Health.", "completed": false}, {"dept_code": "EM", "id": "1111", "course_title": "FOUNDATIONS OF EMERGENCY CARE", "description": "This course focuses on pre-hospital assessment and therapeutic intervention of adult and pediatric patients with acute traumatic injury and includes advanced airway assessment and procedural intervention for patients with acute respiratory pathophysiology. Students will explore emergency medical services systems and appreciate their role and responsibility as pre-hospital practitioners. Learning strategies include scenario-based case presentations with a focus on critical thinking and decision making. This course is paired with a required lab component.", "completed": false}, {"dept_code": "EM", "id": "1112", "course_title": "PATHOPHYSIOLOGY", "description": "Introductory course in pathophysiology for entry-level health care providers. This course focuses on human responses to illness expressed at the physiologic, pathophysiologic, experiential, and behavioral levels. Human responses are examined in terms of assessments appropriate to selected problems, rationale for medical interventions, and therapeutic effectiveness. Topics include: general principles of pathophysiology.", "completed": false}, {"dept_code": "EM", "id": "1114", "course_title": "MEDICATION ADMINISTRATION", "description": "Practical skills lab designed to allow students to develop the psychomotor skills of medication administration. Skills include: phlebotomy, intramuscular and subcutaneous injections, IV cannulation, IV medication administration, inhalation, endotracheal and sublingual administration, and pharmacology math. This course also provides students with the practical skills needed for Advanced Cardiac Life Support (ACLS) care.", "completed": false}, {"dept_code": "EM", "id": "1115", "course_title": "INTRODUCTION TO PHYSICAL ASSESSMENT", "description": "Designed to introduce students to the principles and techniques of physical examination. Students will be taught an organized systemic approach to assessment.", "completed": false}, {"dept_code": "EM", "id": "1116", "course_title": "PHYSICAL EXAM LAB", "description": "Practical skills lab designed to assist in the development of psychomotor skills of patient assessment, airway management, ventilation, and trauma care skills.", "completed": false}, {"dept_code": "EM", "id": "1122", "course_title": "CARDIOLOGY AND RESPIRATORY", "description": "This course covers the specific pathophysiology, assessment, and management of the cardiac patient. Topics inlcude: 3-lead and 12-lead ECG interpretation, cardiac anatomy and physiology, patient assessment and management, ACLS, pharmacological, and other therapies. This class is offered with a required lab course.", "completed": false}, {"dept_code": "EM", "id": "1131", "course_title": "CLINICAL 1", "description": "Designed to accompany the fall semester courses, these clinical rotations focus on the development and documentation of history taking and assessment skills. Additionally, psychomotor skill development in a clinical setting is emphasized.", "completed": false}, {"dept_code": "EM", "id": "1152", "course_title": "ISSUES IN HEALTH CARE", "description": "This course is designed to engage students in current aspects of health care impacting patients and health care practitioners. Topics are extremely diverse in assuring all possible domains of health care are addressed. Various methods of presentation are utilized in this course. Health care delivery at national and international models is explored.", "completed": false}, {"dept_code": "EM", "id": "1153", "course_title": "ISSUES IN HEALTH CARE EDUCATION", "description": "Survey course designed to teach the principles of adult education, classroom management skills, selection of teaching aides, and development of lesson plans. Students will function as teaching assistants in EMS education programs.", "completed": false}, {"dept_code": "EM", "id": "1154", "course_title": "HEALTH CARE RESEARCH", "description": "This course provides an overview of basic concepts of research, including statistics, measurement, and design. This course emphasizes the ability of the student to read and evaluate research papers.", "completed": false}, {"dept_code": "EM", "id": "1155", "course_title": "LEGAL ISSUES IN HEALTH CARE", "description": "This course is meant to provide students with a survey of some of the major legal issues facing emergency medical services providers and administrators, and those who aspire to those positions. This course will focus on the practical issues confronting EMS organizations. Major areas to be addressed include the law of negligence and medical malpractice; consent and refusal of emergency care; \"do not resuscitate\" issues; the legal aspects of documentation; confidentiality and HIPAA; EMTALA and ER diversions; fraud and abuse; personnel management; OSHA; legal issues for non-profit EMS organizations; and the basics of EMS reimbursement.", "completed": false}, {"dept_code": "EM", "id": "1158", "course_title": "FINANCE AND ACCOUNTING FOR HEALTH CARE", "description": "Finance and Accounting provides an introduction to the basic concepts of accounting and financial management in health care. The course is geared for professionals who do not anticipate serving primarily in a financial management role. The concepts will be studied in the context of their practical application.", "completed": false}, {"dept_code": "EM", "id": "1166", "course_title": "SENIOR INTERNSHIP", "description": "The senior internship is designed to allow students to gain valuable experience in an educational, clinical, or administrative aspect of health care. Students are asked to find internships in their specific area of health care interest. The internship can take place domestically or internationally.", "completed": false}, {"dept_code": "EM", "id": "1170", "course_title": "CRITICAL CARE MEDICINE 1", "description": "This course provides a foundational review and focuses on advanced assessment and therapeutic intervention common in the critical care setting for both adult and pediatric patients. Emphasis is placed on continuum of critical care interventions during inter-facility transport. The course follows elements of the ASTNA core curriculum outline and the PA DoH Pennsylvania Air Ambulance Transport Educational Program guidelines. Topics highlighted include body systems assessment, analysis of laboratory diagnostics, hemodynamic monitoring and pharmacology, and chemically facilitated management of the crash airway. Learning strategies include lectures with case presentations and a focus on critical thinking and decision making.", "completed": false}, {"dept_code": "EM", "id": "1172", "course_title": "ISSUES IN HEALTH CARE - WEB", "description": "This course is designed to engage students in current aspects of health care impacting patients and health care practitioners. Topics are extremely diverse in assuring all possible domains of health care are addressed. Various methods of presentation are utilized in this course. Health care delivery at national and international models is explored.", "completed": false}, {"dept_code": "EM", "id": "1173", "course_title": "ISSUES IN HEALTH CARE EDUCATION - WEB", "description": "Survey course designed to teach the principles of adult education, classroom management skills, selection of teaching aides, and development of lesson plans. Students will function as teaching assistants in EMS education programs.", "completed": false}, {"dept_code": "EM", "id": "1174", "course_title": "HEALTH CARE RESEARCH - WEB", "description": "This course provides an overview of basic concepts of research, including statistics, measurement, and design. This course emphasizes the ability of the student to read and evaluate research papers.", "completed": false}, {"dept_code": "EM", "id": "1175", "course_title": "LEGAL ISSUES IN HEALTH CARE - WEB", "description": "This course is meant to provide students with a survey of some of the major legal issues facing emergency medical services providers and administrators, and those who aspire to those positions. This course will focus on the practical issues confronting EMS organizations. Major areas to be addressed include the law of negligence and medical malpractice; consent and refusal of emergency care; \"do not resuscitate\" issues; the legal aspects of documentation; confidentiality and HIPAA; EMTALA and ER diversions; fraud and abuse; personnel management; OSHA; legal issues for non-profit EMS organizations; and the basics of EMS reimbursement.", "completed": false}, {"dept_code": "EM", "id": "1180", "course_title": "HEALTH CARE MANAGEMENT", "description": "The purpose of the course is to provide an introduction to the basic concepts of managing in organizations with a particular focus on health care organizations. The concepts will be studied in the context of their practical application.", "completed": false}, {"dept_code": "EM", "id": "1183", "course_title": "FINANCE AND ACCOUNTING FOR HEALTH CARE - WEB", "description": "Finance and Accounting provides an introduction to the basic concepts of accounting and financial management in health care. The course is geared for professionals who do not anticipate serving primarily in a financial management role. The concepts will be studied in the context of their practical application.", "completed": false}, {"dept_code": "EM", "id": "1185", "course_title": "BEYOND THE BODY - WEB", "description": "This course was designed to introduce clinicians and health administrators to variables that influence health beyond behaviors, genes, and germs. This course will introduce the \"social ecology\" model that addresses the broader social, environmental, and policy factors (known as \"health determinants\") that influence our health.", "completed": false}, {"dept_code": "EM", "id": "1250", "course_title": "INTRODUCTION TO COMMUNITY HEALTH", "description": "The role of paramedics in the health care system is evolving in many parts of the country to include helping patients avoid unnecessary 911 calls and hospitalizations. This introductory course will prepare the paramedic to function as a community paramedic. This course will describe the difference between traditional EMS and community paramedic assessments; introduce therapeutic communication techniques; describe mental and behavioral health issues and their effect on chronic disease management; review professional boundaries and provider wellness techniques; and review potential patient populations that could be helped through these new services.", "completed": false}, {"dept_code": "EM", "id": "1260", "course_title": "COGNITIVE PSYCHOLOGY OF DECISION MAKING", "description": "Health care providers make dozens of clinical decisions every day. Errors in cognitive processes have been determined to be one of the most common causes of preventable death and disability in this country. The goal of this class is to examine the current science of decision making and the barriers to optimal decision making. Students will learn to recognize System I and System II thinking and the benefits and limitations of each. Unconscious cognitive biases and heuristics that are commonly relied upon in everyday thinking, as well as professional decisions, will be analyzed. The class will be taught in seminar fashion with active learning and discussion.", "completed": false}], "links": []}