{"nodes": [{"dept_code": "IE", "id": "1014", "course_title": "DATA BASE DESIGN", "description": "This course introduces the fundamental aspects of database design and management within the context of a relational data base management system (DBMS). Covered topics include: relational model, database design life-cycle, database design optimization, client/server architecture, data modeling, SQL, database security, database management, data warehousing, internet database environment. Students will gain hands-on experience in analysis, design, implementation, and management of relational data base systems.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1035", "course_title": "ENGINEERING MANAGEMENT", "description": "This course focuses on management theory applied to engineering and technical organizations. Topics include: the management process and management functions (planning, organizing, leading, and controlling); project management; managing technical people; engineering ethics, globalization, and other contemporary management concepts.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1040", "course_title": "ENGINEERING ECONOMIC ANALYSIS", "description": "Discusses cost estimation, time value of money, interest rate calculations, economic equivalence concepts, comparison of alternative investments, evaluating economic life and replacement alternatives, depreciation, the impact of taxes on engineering economic decisions, and dealing with uncertainty.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1051", "course_title": "ENGINEERING PRODUCT DESIGN", "description": "Lectures will cover the following: cad functions and cad systems; design process; hardware issues; software issues; use of commercial software; graphics primitives; mathematical transformations; solid modeling; database management systems; relational databases; adding intelligence to cad systems. Laboratory sessions will deal with a diversity of design projects utilizing commercial software packages.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1052", "course_title": "MFG PROCESSES AND ANALYSIS", "description": "Introduction to manufacturing principles and their importance in product development. Traditional and emerging processes are covered, including additive manufacturing, micro manufacturing, and nonmanufacturing. The integration of manufacturing, design, and materials is presented as a key to rapid product realization. Unit manufacturing processes are considered in work cell organization, flexible flow lines, and quality control. The course laboratory involves examination of the details of manufactured products, using various manufacturing processes, and learning the importance of material and process selection in product development.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1054", "course_title": "PRODUCTIVITY ANALYSIS", "description": "Introduction to industrial engineering concepts and thought process mapping, operations analysis, and design, 6s, lean systems, root cause analysis, methods engineering, standards development, predetermined time systems, computerized work measurement, motivation and incentives.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1055", "course_title": "FACILITY LAYOUT AND MATERIAL HANDLING", "description": "Introduction to facility layout and location topics including activity relationships, space and personnel requirements, layout types, manual and computer algorithms for constructing layouts, single facility location methodologies, and warehouse operations. Material handling methods and equipment including conveyors, lift trucks, carousels, automated guided vehicles, and automated storage and retrieval systems are also discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1061", "course_title": "HUMAN FACTORS ENGINEERING", "description": "A study of human abilities, characteristics, behavior, and motivation in the design, development and operation of components and systems designed for human use.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1070", "course_title": "PROBABILITY, RANDOM VARIABLES, AND DISTRIBUTIONS", "description": "The main objective of this course is to introduce IE majors to probability and probabilistic modeling as a foundation for motivating statistics and statistical methods.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1072", "course_title": "DESIGN OF EXPERIMENTS & QUALITY ASSURANCE", "description": "This elective course serves as a continuation of the second course to provide IE majors with background in designed experiments and quality assurance methods.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1080", "course_title": "SUPPLY CHAIN ANALYSIS", "description": "An overview of supply chain management with an emphasis on operations and strong quantitative orientation. Supply chain strategies; sourcing decisions; demand forecasting; aggregate planning; managing supply and demand; production and inventory control systems including MRP and JIT; dealing with uncertainty; distribution networks; coordination and integration.", "completed": false, "prereq_count": 1}, {"dept_code": "IE", "id": "1081", "course_title": "OPERATIONS RESEARCH", "description": "Introduction to the decision-making process and mathematical modeling; theory and methodology of the simplex algorithm; duality theory, complementary slackness, post-optimality analysis; transportation and assignment problems; introduction to integer programming application to real-life case problems; computer codes.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1083", "course_title": "SIMULATION MODELING", "description": "Random number generation; distribution functions and random variates; game of chance; applications of discrete event simulation methods of queuing, inventory control, and production planning problems. Introduction to special-purpose simulation languages.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "Departmental seminars present the engineering viewpoint by prominent speakers from industry and government. Also serves as an organizational forum for the university chapter of the institute of industrial engineers.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1086", "course_title": "DECISION MODELS", "description": "Decision making under uncertainty is the key to understanding a variety of problems from industry, including inventory control, revenue management, energy, healthcare, and logistics. This course covers the fundamentals of stochastic (sequential) decision models, including data-driven and risk-averse methods, with applications to real-world problems.", "completed": false, "prereq_count": 1}, {"dept_code": "IE", "id": "1090", "course_title": "SENIOR PROJECTS", "description": "Analytical investigation techniques for total project problems in technical organizations. Involves solving of client problems utilizing industrial engineering capabilities acquired by students during program of study. Provides students with project team experience, report writing and seminar presentation of team results. Students must be enrolled in this course at least one month prior to the start of the semester.", "completed": false, "prereq_count": 1}, {"dept_code": "IE", "id": "1102", "course_title": "LEAN SIX SIGMA I (GREEN BELT)", "description": "This course provides an introduction to lean and six sigma principles with an emphasis on the application of statistics to quality control. Topics include value stream mapping, various lean tools, DMAIC methodology, data collection and measurement, and applications of ANOVA and doe. A project is required and the student should be prepared for green belt certification at the end of the course.", "completed": false, "prereq_count": 1}, {"dept_code": "IE", "id": "1106", "course_title": "OPERATIONS IMPROVEMENT IN HEALTHCARE", "description": "This course leads students to apply basic industrial engineering tools to healthcare operations, with a focus on healthcare providers. This includes data gathering, process mapping, system analysis and modeling, work sampling, work study, and workflow improvement. This course will provide an overview of the differences between healthcare and other more traditional industrial engineering settings (e.g., manufacturing, retail), and the opportunity to apply industrial engineering techniques, while developing and understanding basic healthcare operations and systems in the United States. (This class is designed to be a complement to IE 1108/2108.)", "completed": false, "prereq_count": 3}, {"dept_code": "IE", "id": "1122", "course_title": "FUNDAMENTALS OF SYSTEMS ENGINEERING", "description": "This course will focus on the fundamentals of systems engineering, including technical processes (e.g., requirements definition, architecture design, system verification), technical management processes (e.g., project planning, risk management), agreement processes (acquisition and supply) and project-enabling processes (e.g., life-cycle model management, quality management). Key systems engineering techniques and methods (e.g., system modeling and simulation, function-based systems engineering) will also be discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "IE", "id": "1301", "course_title": "INTRODUCTION TO SAFETY ENGINEERING", "description": "Introduction to Safety Engineering\"\" provides a basis to assist students in understanding and applying the scientific and engineering principles associated with the field of safety engineering. Specifically, the course will provide a background in, information on and application exercises in the natural, chemical and physical laws and forces associated with safe design and implementation of work-related tasks and industrial and construction projects. These involve soils and excavation, trenching and shoring, permanent and temporary work platforms and scaffolding, cranes, rigging, ropes, slings and chains, fall protection, pressure vessels, confined space entry, energy isolation and preparation of equipment, hot work, welding, personal protective equipment and non-destructive testing. The course will also address safety related issues associated with building and facility design and layout, job, task and work setting layout. The course will stress the importance of safety engineering as part of both the corrective process and the design process.", "completed": false, "prereq_count": 0}], "links": [{"source": "1035", "target": "1090"}, {"source": "1040", "target": "1106"}, {"source": "1054", "target": "1102"}, {"source": "1054", "target": "1106"}, {"source": "1055", "target": "1080"}, {"source": "1070", "target": "1086"}, {"source": "1070", "target": "1106"}]}