{"nodes": [{"dept_code": "ENGCMP", "id": "0150", "course_title": "WORKSHOP IN COMPOSITION", "description": "This course is designed to give students who have had limited experience with writing an opportunity to increase their control of written language and their confidence in performing academic inquiry, analysis and argument. Students write in response to weekly assignments, and instruction focuses on helping students to extend, revise, and edit their work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0151", "course_title": "WORKSHOP TUTORIAL", "description": "This course provides support for students who are taking ENGCMP 0150 workshop in composition. Students meet weekly with a writing center consultant to work on understanding and addressing writing assignments. Students can also expect to learn how to strengthen their writing at the sentence- and paragraph-levels. Students work one-on-one with a consultant, using the papers they produce in ENGCMP 0150 as materials for discussion.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGCMP", "id": "0152", "course_title": "ESL: WORKSHOP IN COMPOSITION", "description": "This course is designed to give students learning English as a foreign language an opportunity to develop their ability to write in English and their confidence in performing academic inquiry, analysis and argument. Students write in response to weekly assignments, and instruction focuses on helping students to extend, revise, and edit their work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0200", "course_title": "SEMINAR IN COMPOSITION", "description": "This introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. Specific reading and writing assignments may vary from section to section, but student writing will be the primary focus in all sections. The course is designed to help students become more engaged, imaginative, and disciplined composers.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0201", "course_title": "COMPOSITION TUTORIAL", "description": "This course is a series of tutorial sessions designed to help students with their writing at the sentence and paragraph levels. Students work one-on-one with a consultant in the writing center, using the papers they produce in ENGCMP 0200 as materials for discussion.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGCMP", "id": "0203", "course_title": "SEMINAR IN COMPOSITION: GENDER STUDIES", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include readings and writing activities that comment on gender difference and consider the ways in which language and culture construct socially acceptable gender and sexual norms.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0205", "course_title": "SEMINAR IN COMPOSITION: FILM", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include a series of films, along with discussions that focus on how films and other media shape the ways we view and understand the world.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0207", "course_title": "SEMINAR IN COMPOSITION: EDUCATION", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include readings that consider issues of teaching and learning in American education and may be of interest to those who plan to become teachers.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0208", "course_title": "SEMINAR IN COMPOSITION: SERVICE-LEARNING", "description": "Students will engage in service-learning, pairing meaningful service in the community with academic work. Discussions will focus on students' experiences and their reflections as guided by critical readings and short essay assignments. Essays will comprise the central course texts, and weekly work will include reading and discussing the essays that students produce for this course.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0210", "course_title": "SEMINAR IN COMPOSITION: ENGINEERING", "description": "Seminar in Composition is a course taken by almost all undergraduates at the University of Pittsburgh. Seminar in Composition: Engineering undertakes the goals of Seminar in Composition within a first-year (and beyond) engineering context. First-year Swanson School of Engineering (SSOE) students in Seminar in Composition: Engineering will explore engineering disciplines, practices, methods, ethics, and education and will analyze their own views and goals as engineering students and as future engineers as they are learning about and practicing writing as a rigorous, disciplined form of critical inquiry and a responsible form of communication. In Seminar in Composition: Engineering, students will strengthen their knowledge and practice of the textual conventions required of university- and professional-level writing and will, via drafting and revision, regularly reexamine the clarity and effects of their writing processes and outcomes. Writing instruction will take place in the ENGR 0011 or 0711 classroom, so students won't have a separate class meeting for ENGCMP 0210; be sure that your ENGR and ENGCMP courses meet at the same day and time in the same classroom.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0212", "course_title": "SEMINAR IN COMPOSITION: TOPICS IN DIVERSITY", "description": "Seminar in Composition is a course taken by almost all undergraduates at the University of Pittsburgh. Its goals are to help you engage in writing as a creative, disciplined form of critical inquiry; compose thoughtfully crafted essays that position your ideas among other views; write with precision, nuance, and awareness of textual conventions; and revise your writing by rethinking the assumptions, aims, and effects of prior drafts. This seminar will include readings and writing activities that explore concepts and practices relating to diversity and its established and emerging definitions. Your section may address, for example, issues like race, gender, sexuality, ethnicity, religious difference, differences in abilities, and economic disparities. You can expect to identify and analyze assumptions about difference, study how texts can generate and perpetuate such assumptions, and explore the consequences of such assumptions. You will also learn how to research and compose with attention to difference. We will read a challenging set of essays to frame our work in the course, but the key texts will be your own writings and those of your classmates. Your focus on student writing will be detailed: you will work closely with the papers that you and your fellow classmates have written, trying to think of ways to make them more precise, interesting, organized, complex, and reflexive. This course is an opportunity to learn how to use reading (published texts, the papers of your classmates, and readers' comments) to help you work on your writing and how to use writing to help you strengthen ways of reading and thinking. Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This seminar will include readings and writing activities that explore concepts and practices relating to diversity and its established and emerging definitions. Your section may address, for example, issues like race, gender, sexuality, ethnicity, religious difference, differences in abilities, and economic disparities. You can expect to identify and analyze assumptions about difference, study how texts can generate and perpetuate such assumptions, and explore the consequences of such assumptions. You will also learn how to research and compose with attention to difference.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0213", "course_title": "SEMINAR IN COMPOSITION: DISABILITY STUDIES", "description": "This composition course will engage students in formal and informal writing that fosters critical thinking on the topic of disability. Drawing on theoretical writing in disability studies as well as creative and critical literature by writers with disabilities, the course will introduce students to ways of identifying and questioning certain sociocultural assumptions about ability, sensory experiences of the world, and mental as well as physical health. The nature of the writing assignments and writing processes will vary in order to recognize a diversity of abilities and ways of thinking. In exploring disability as a diversity issue, the course aims at intersectionality, a concept introduced in 1989 by legal scholar Kimberlé Crenshaw. Intersectionality is the recognition that none of us can be said to inhabit a single identity; for example, our racial identity is always complicated by our socioeconomic class, gender and sexuality, as well as by our identities as abled/disabled. Anyone may become disabled at any point in time, and according to the Center for Disease Control, 61 million Americans identify as disabled, so it's safe to say that disability impacts every identity.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0400", "course_title": "WRITTEN PROFESSIONAL COMMUNICATION", "description": "This course explores the methods of inquiry, analysis and composition characteristic of written communication in professional settings. The course will examine such writing's specialized use of language, conventions and formats, premises, motives, and purposes. By preparing letters, resumes, proposals, reports, etc. Students will get a feel not only for what \"professional\" communication is, but also for how and why it does, or can, or should function.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0401", "course_title": "WRITTEN PROFESSIONAL COMMUNICATION: TOPICS IN DIVERSITY", "description": "This course explores the methods of inquiry, analysis and composition characteristic of written communication in professional settings. The course will examine such writing's specialized use of language, conventions and formats, premises, motives, and purposes. By preparing letters, resumes, proposals, reports, etc., students will get a feel not only for what \"professional\" communication is, but also for how and why it does, or can, or should function. This Topics in Diversity section of WPC will invite students to expand and complicate their understanding of the benefits of workplace diversity and of the problems arising from the unequal distribution of power and privilege across positions (including race, gender, sexuality, ethnicity, ability, religion, and class) in the professions. Students will explore the dynamics of power and hierarchy in their chosen field as they observe daily operations and interactions during work-site field visits, and they will consider how these dynamics perpetuate or diminish inequities and marginalization. Among the topics considered are discrimination in hiring and on the job in terms of employment training, responsibilities, pay, and promotions. Students gain practice articulating their individual diversity as job candidates in resumes and cover letters, and in composing professional documents that address a complaint, seek a remedy, and establish new policies to address hypothetical discriminatory issues that they may experience in the future.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0410", "course_title": "WRITING IN THE LEGAL PROFESSIONS", "description": "This course is especially useful for students preparing for classes in the legal professions. Students will be trained to understand the nature of assumptions and assertions, to examine the pertinence of evidence, to judge the appropriateness of tone to subject matter and audience, and to test the validity of an argument through an analysis of its components.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0415", "course_title": "WRITING AND ANXIETY", "description": "This course is designed for students who are interested in learning about ways of navigating anxiety and apprehension about writing and for those who expect to teach or support other writers in business, education, and other nonprofit, public health and service institutions. Writing can be an anxiety-provoking process for many people who nevertheless have to write because of academic or professional responsibilities. The course will explore ways of theorizing the writing process and will identify and share strategies for navigating roadblocks (such as writing apprehension, writing anxiety, and blocking) as they arise. Students can expect to learn essential terms from the rhetorical tradition in order to become more aware of the choices they make as thinkers and writers, and they will analyze the rhetoric of a variety of texts from a disability studies perspective. In addition to learning about writing theory, students can expect to read and write about anxiety and about how the idea of disability functions in our culture.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0420", "course_title": "WRITING FOR THE PUBLIC", "description": "This course explores the theory and practice of writing that serves the public interest, including writing for the nonprofit and the governmental sectors of American society. The course will explore the ethics of writing for the public, the impact of rhetorical contexts on writing, and the ways in which writing and revision can allow us to understand a problem or issue in a new way. Students can expect to read examples of writing for the public, conduct significant research, and write in different genres.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0425", "course_title": "DIGITAL HUMANITY", "description": "This course prepares students to critically examine the intersections between digital devices and human life. Covering topics such as the relationship between computers and humans, surveillance, big data, and interactivity and games, we question what it means to be human in a space of pervasive digitality.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0430", "course_title": "PUBLIC COMMUNICATION OF SCIENCE AND TECHNOLOGY", "description": "This course explores the theory and practice of writing that serves the public interest. We will focus on writing about science, technology, and the environment areas that influence our daily lives in innumerable ways. By composing in a variety of genres, students will gain a deeper understanding of the ethics of writing about science and technology for public audiences, the interaction of communication and rhetorical context, and how writing and revision can facilitate new ways of thinking. Students will study academic articles, professional examples, news coverage, and student work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0440", "course_title": "CRITICAL WRITING", "description": "Students in this course will be trained in the responsible development and articulation of written opinions. Material drawn from various media will be used to help students increase their powers of observation and analysis that they may learn the art of making discriminating evaluations of situations, events, issues, controversies, artifacts and objects.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0450", "course_title": "RESEARCH WRITING", "description": "This course trains students in the techniques of responsible library research. Students will learn how to locate and utilize the resources of a library. Students will also learn how to take notes and document, use primary and secondary sources, and write paraphrases, summaries and abstracts. Each student will write a major research paper on a topic of his/her choice, one which may legitimately serve as a term paper for another course.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0515", "course_title": "PERSAUSIVE WRITING IN ADVERTISING", "description": "In this course, students will analyze and create the kinds of persuasive writing used in the fields of fundraising and advertising. Both types of writing attempt to influence the decisions people make about the money they spend, the attitudes they have, and the issues that shape our society.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0520", "course_title": "INTEGRATING WRITING AND DESIGN", "description": "This course allows students to explore the rhetorical implications of design and invites students to consider design and writing as an integral process. The class will alternate lecture/discussion sessions with studio sessions, so that students can learn how to use Adobe InDesign to create both single- and multi-paged documents for particular rhetorical contexts. Student will create a number of designed pieces of writing, including a longer multi-page document for a specific audience.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0521", "course_title": "WRITING WITH DATA", "description": "This course is designed to allow students to engage with data in their writing and learn how to effectively write with numbers. This course is for anyone: those who love to write but are sometimes less confident working with numbers, those who love numbers but want to improve their writing, for people who love numbers and writing rather equally, for scientists, for artists, for people who anticipate working with a lot of data in their career, etc. Students will work with a dataset of their choosing and develop several pieces reliant on quantification for both lay and specialized audiences. Through these writing projects and through classroom activities, students will learn about how to find data to use for their writing, how to plan effective utilization of this data in a broader argument, how to responsibly and effectively use word choice and syntax to convey quantified material, how to organize writing reliant on data for both lay and specialized audiences, and how to incorporate data visualization for purposes of understanding and persuasion. There is no need to know anything about statistics; throughout the term we will learn how mathematical encounters with writing can be engaging, exciting, and something we can work on together. We will be going over a handful of statistical concepts in the second half of the course so we can write about them, but the emphasis here will ultimately be on proficiency for the purposes of a given concepts use in writing. By the end of the course, both traditional and quantitative literacy will be improved to serve student development as competent quantitative writers and readers in future PPW courses, courses across different majors at Pitt, in their writing as professionals, and as more discerning consumers and producers of knowledge as global citizens.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0530", "course_title": "WRITING FOR THE SCIENCES", "description": "This course invites students to explore the purposes and conventions of writing within the sciences. Students will read and analyze examples of professional scientific documents' including abstracts, literature reviews, research proposals, graduate school papers, journal articles, and correspondence. They will learn to craft scientific research into engaging written material, using information drawn from publicly available studies or their own research. They will consider their audience's needs and tailor their writing for both expert and general readers in different rhetorical contexts. Students will also learn strategies for document design, including how to effectively use visuals to represent data and findings. Throughout the course, students will learn how to write clear, powerful sentences and paragraphs. Finally, to develop their professional collaboration skills, students will practice providing each other with effective feedback on works-in-progress.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0535", "course_title": "WRITING IN THE HEALTH SCIENCE PROFESSIONS", "description": "This course is designed for students who are interested in learning about the kinds of writing typically done by clinicians, researchers, and others working in health science contexts. The course focuses on developing the skills needed to write and communicate effectively in health and medical contexts, from writing essays for graduate and professional program applications and documenting research to communicating with patients and staff, writing professional reports and correspondence, and giving conference presentations. Students will gain familiarity with the formal requirements of biomedical abstracts, literature reviews, and research papers, and they will learn effective strategies for conducting secondary research using health science databases and search engines. The course will also introduce techniques for improving documents, structure and style, so that readers can easily grasp, follow, and absorb the significance of the information presented. Students will be introduced to expectations and challenges they are likely to encounter in other common writing scenarios, such as explaining complex information to patients, writing reports for administrators or regulatory agencies, and communication policies or procedures to staff. Different approaches to writing graduate and professional school personal statements will be discussed, and students will draft and revise either personal statements for applications or mission statements articulating their professional visions within a larger ethical framework. Through the course of the term students will work towards completion of a final paper on a medical communication issue, and they will present their findings in a conference-style format, at the end of the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0560", "course_title": "WRITING ARGUMENTS", "description": "This course has two goals: to help students become more adept at understanding and critically analyzing arguments, and to help students become better arguers themselves. Students in \"Writing Arguments\" will practice composing arguments across a variety of forms, genres, and technologies (written, visual, oral, digital) in order to develop and hone their persuasive language skills. As part of this practice, students will have the opportunity to design and participate in written and oral debates on topics of present interest and to compose their own examples of public persuasive communication. Writing Arguments would be especially appropriate for students headed to law or graduate school.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0600", "course_title": "INTRODUCTION TO TECHNICAL WRITING", "description": "This introductory course is for students in various technical fields. Representative technical reports will be studied, as well as abstracts, the presentation of visuals and oral communication. Writing assignments will emerge from case studies reflecting on-the-job challenges.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0610", "course_title": "COMPOSING DIGITAL MEDIA", "description": "This course requires students to compose digital media while exploring the rhetorical, poetic, and political implications of multiple writing platforms. Students will learn how to compose a range of critical media objects using web-authoring languages, text, sound, images, and video in proprietary and open-source software. Classes will focus on theories of writing, composing, design, critique, delivery, and networked distributions; critique and analysis of digital media produced by professional and amateur digital media practitioners; and analysis and revisions of digital media composed by the students themselves.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0641", "course_title": "WRITING FOR CHANGE", "description": "This course is an opportunity for students to examine and produce writing that engages in advocacy, solidarity, social critique, and/or social justice. Students will explore theories of persuasive writing for public audiences, as well as argumentative strategies more broadly. Students will define the subject of a core project for the term, and move beyond understanding an issue to understanding various discourse communities that generate writing on that topic, how those organizations represent themselves, and how they define an audience. Our theoretical discussion will be balanced by a more pragmatic look at the language of social change, and how various writing forms, produced by nonprofits, activist groups, international organizations and coalitions, as well as socially engaged journalism, inform, persuade, and engage the public. Students in Writing for Change can expect to compose traditional essays as well as public writing in print, digital, visual, and a variety of other forms of persuasive communication.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0712", "course_title": "CRITICAL MAKING", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1099", "course_title": "THE LANGUAGE OF POLICY AND POWER: TOPICS IN DIVERSITY", "description": "This course invites students to deepen and expand their understanding of public policy writing and to build the skills necessary to address the unequal distribution of power and privilege influencing policy in the public sphere. The course provides students with the opportunity to develop a portfolio of practical and analytical policy-related writing by grounding our work in current discussions about diversity (including race, gender, LGBT+, ethnicity, ability, religion, and class). In this writing-intensive class, students will write a variety of documents, such as a history memo, a set of responses to the readings, a letter of public comment, an op-ed, a polemical essay, and a final policy memo, related to a specific and properly-scaled diversity policy issue. The course will address the specialized use of language, conventions and formats, premises, motives, and purposes related to policy documents and arguments in light of diversity. By preparing both reflective academic and professional policy documents, students will master not only the basics of policy writing, but, through their own research and writing, the rhetorical and critical thinking skills necessary to create effective policy. Students will learn to employ methods of inquiry, analysis, and composition characteristic of written and oral policy discussions as they relate to diversity questions, concerns, and legal requirements. We will read broadly and deeply, and engaged, informed class discussion responding to reading and current policy questions is a cornerstone of the class. We will explore how the explicit and implicit history and applications of public and private policies have created long-standing outcomes that are often taken for granted, and address ways to change and improve those outcomes.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1103", "course_title": "PUBLIC RELATIONS WRITING", "description": "This course studies the ways an organization communicates with its public through news releases, speeches, brochures, feature stories, annual reports, etc. The course examines the stylistic choices each writer makes and develops a critical language to describe how meaning is created through the way information is arranged. Issues of the media, ethics, propaganda and the uses of ambiguity will also be addressed.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1111", "course_title": "PROFESSIONAL WRITING IN GLOBAL CONTEXTS", "description": "In order to create effective and powerful documents for diverse global audiences, students need to be able to negotiate the expectations, assumptions, conventions, and professional practices of different cultures. This course will help advanced undergraduate students better understand what is at stake in writing for international audiences, how to research issues relating to communication (and especially the use of English) in global contexts, and how to write professional publications for particular international audiences.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1112", "course_title": "PROFESSIONAL USES OF SOCIAL MEDIA", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1120", "course_title": "HISTORY AND ETHICS OF ADVERTISING AND PUBLIC RELATIONS", "description": "As philosopher George Santayana once said, Those who cannot remember the past are condemned to repeat it. But how do history and ethics intersect to inform our decisions as writers? How do we serve the roles of advertiser and PR specialist simultaneously? What do the answers of these questions look like in the context of a real-world campaign? In this course, students will learn how pivotal ethical moments in advertising and PR history changed the face of these professions and influence our creative choices even now. Students will use the four-step planning process of research, strategy, implementation, and evaluation to construct innovative campaigns and tackle common ethical issues these professions face today. Topics to be explored may include manipulation and misrepresentation of facts, privacy concerns in the technology age, sensitivity to diversity and appropriation, responsible interaction with vulnerable populations, subliminal messaging tactics, and more. By the end of this course, students will produce a multi-faceted PR and advertising campaign that navigates a complex ethical issue and showcases their professional writing skills.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1130", "course_title": "PROJECTS IN DIGITAL COMPOSITION", "description": "This course builds upon Composing Digital Media (ENGCMP 0610) by requiring students to compose original projects in a particular focal area digital media while exploring the rhetorical, poetic, and political implications of that focal area. Where students in Composing Digital Media typically learn how to compose a range of critical media objects using web-authoring languages, text, sound, images, and video, Projects in Digital Composition will give students the opportunity to focus closely on a particular theme or category of multimodal composition. As with Composing Digital Media, theories of writing, composing, design, critique, delivery, remediation, and revision are central to the coursework. The course also emphasizes the importance of self-guided skills acquisition.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1210", "course_title": "TUTORING PEER WRITERS", "description": "This course prepares students to be effective tutors for peer writers by introducing them to issues and scholarship in teaching, writing and working as a tutor. Students from any discipline who are interested in careers in teaching, or students who recognize the importance and difficulty of responding well to drafts written by others will find this course of interest. The course is a prerequisite for those students wishing to work as peer interns in the writing center.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1270", "course_title": "PROJECTS IN BLACK RHETORIC", "description": "This topics course offers a different focus each time it is offered. The course centers Black writing, experiences, rhetoric, and criticism. Designed for students with some writing experience, this course will allow you to hone your writing ability and create a compelling project that demonstrates your critical and analytical work with example texts.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1400", "course_title": "GRANT WRITING FOR NONPROFITS", "description": "This course allows students to study the practices related to proposing change, requesting funds, and defining projects.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1510", "course_title": "WRITING WITH STYLE", "description": "Designed with the writer in mind, this advanced-level, workshop-style course explores the sentence in its many forms and seeks to deepen students' understanding of grammar, syntax, punctuation, and style as opportunities for creative endeavor. Through the use of imaginative exercises, revisions, and discussion of texts written by students, poets, and essayists, we will immerse ourselves in the practice of writing compelling sentences that best express our thoughts and motives. The course involves a weekly workshop of works-in-progress and the creation of a chapter-length (20-25 pages) prose revisionary project by the end of semester.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1551", "course_title": "HISTORY AND POLITICS OF THE ENGLISH LANGUAGE", "description": "This course introduces students to both historical and present use and descriptions of the English language. Students also learn techniques for analyzing and understanding the language.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1900", "course_title": "INTERNSHIP: PUBLIC/PROFESSIONAL WRITING", "description": "This internship is intended for juniors and seniors who are pursuing the public and professional writing certificate. The internship is designed to give students a productive, substantive writing experience where they will learn from and contribute to the sponsoring agency or project. Students will consult with an advisor to arrange for intern ships and to construct the plan of work, writing, and over sight.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1903", "course_title": "SERVICE-LEARNING SEMINAR IN PUBLIC AND PROFESSIONAL WRITING", "description": "This course is open to students who are enrolled in public and professional writing courses. It is taken concurrently with these anchor courses as a voluntary, one-credit add-on. The service-learning seminar pairs meaningful and sustained service activities in a professional non-profit organization with investigation of professional writing.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1904", "course_title": "SERVICE LEARNING ADD-ON CREDIT", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1905", "course_title": "INDEPENDENT STUDY SERVICE LEARNING", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1906", "course_title": "PROFESSIONAL EXPERIENCE: WRITING, EDITING, OR PR", "description": "This course offers an exciting opportunity for students who have taken at least a couple of PPW or Writing courses: Professional Experience at Sampsonia Way, the literary journal of City of Asylum/Pittsburgh. http://www.sampsoniaway.org The PPW program is teaming up with City of Asylum to produce the magazine. The course is for responsible students who are interested in writing for this journal or running social media to promote the journal. The team will work with a teacher who will serve as managing editor and also faculty member in charge of the project. The group will learn about writing, editing, and PR while producing the online literary magazine. You can also expect to learn more about free speech and social justice while working with writers who are under threat in their home countries. Weekly meetings on campus will focus on learning about the context for the work, learning good practices for professional writing, editing, and PR, reading work by writers in exile, and workshopping your articles for publication. Interviews for articles will be in-person or via Skype. Expect to spend 10-12 hours a week working on this project. You will also need to attend class. A monthly meeting will be held at City of Asylum on the Northside (easily accessible by bus).", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1910", "course_title": "BRIDGE SEMINAR", "description": "", "completed": false, "prereq_count": 0}], "links": [{"source": "0150", "target": "0151"}, {"source": "0200", "target": "0201"}]}