{"nodes": [{"dept_code": "MEMS", "id": "0024", "course_title": "INTRODUCTION TO MECHANICAL ENGINEERING DESIGN", "description": "Fundamentals of the design process, basic techniques of graphic communication, and an introduction to the most common mechanical components and manufacturing processes.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "0071", "course_title": "INTRODUCTION TO FLUID MECHANICS", "description": "Fundamentals of fluid mechanics, with emphasis on inviscid and linearly viscous, incompressible fluids. Basic physical phenomena of fluid mechanics. Fluid kinematics. Governing equations (both integral and local forms). Exact solutions. Internal flows. Dimensional analysis and modeling.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1010", "course_title": "EXPERIMENTAL METHODS IN MATERIALS SCIENCE AND ENGINEERING", "description": "Principles and techniques of optical metallography: imaging and quantitative analysis. Mechanical testing techniques, electron microscopy and chemical analysis.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1014", "course_title": "DYNAMIC SYSTEMS", "description": "Modeling and analysis of physical systems. Time- and frequency-domain analyses; transient and steady state system response to various excitations; transfer function and state space model representations; Laplace and Fourier transforms.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1028", "course_title": "MECHANICAL DESIGN I", "description": "Stress and deflection analysis; survey of mechanical design criteria; selection and applications of working stresses for ductile and brittle materials; static, fatigue, and impact loading and combination of stresses.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1030", "course_title": "MATERIAL SELECTION", "description": "Methodology for materials selection in mechanical design processes. Includes: (i) design process and consideration, (ii) criteria for materials and their shape selection, and (iii) design case study. Mechanical components have mass; they carry loads; they conduct heat and electricity; they are exposed to wear and to corrosive environments; they are made of one or more materials; they have shape; and they must be manufactured. This course provides knowledge on how these activities are related.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1032", "course_title": "AUTOMOTIVE DESIGN AND FABRICATION", "description": "Covers the basics of automotive fabrication. Students working as one team have the opportunity to experience hands-on application of both classical and modern manufacturing techniques while adhering to a very strict externally imposed deadline. The team effort culminates in the production of a high-performance automobile.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1035", "course_title": "COMPOSITE MATERIALS DESIGN AND APPLICATIONS", "description": "Extensive uses of composites can be seen in several aspects of engineering applications. Industrial sectors, such as in wind turbines, oil and natural gas exploration and production, natural gas and hydrogen vehicle storage tanks, high-speed and precision machinery, etc., are today the largest user of composites, surpassing aerospace industries. Other applications are in semiconductor manufacturing equipment; automobile engines, bodies, brakes and clutches; energy storage flywheels; gas turbine engines; process industries equipment; data storage equipment; medical diagnostic equipment; prosthetics and orthotics, etc. The advantages of composite materials stem from their outstanding strengths and stiffnesses, low densities, in addition to their unique and tailorable physical properties, including good thermal conductivities compared to copper and thermal expansions that can be varied from high to near zero. Composites, such as metallic, ceramic and carbon materials have both high-temperature and low-temperature capabilities, making them useful in high temperature regimes, e.g. in gas turbine engines, automobile and aircraft brakes. This course offers an in-depth presentation of design, analysis and manufacturing methods for composites, with particular reference to polymer matrix composites. For an efficient use of composites in lightweight structural design applications, this course offers the needed fundamental understanding of the structure, properties, and mechanics of composite materials. A typical mechanical analysis and design of composite structures, which are significantly more complex than those of their metallic equivalents due to the anisotropic nature of laminated composite materials, will be presented.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1038", "course_title": "FUNDAMENTALS OF ENGINEERING PROJECTS", "description": "This course will focus on the development of professional skills required for successful engineering projects. The central objective will be to prepare foundation skills relevant to the senior design course. Course topics will include: project management tools, professional standards and codes, prototype development, design for manufacturing, GD&T, oral presentation skills and presentation of engineering data.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1041", "course_title": "MECHANICAL MEASUREMENTS 1", "description": "Fundamentals of mechanical measurements including steady-state and dynamic signals, detector-transducer elements, signal conditioning and readout systems, standards, instrument calibration, statistical treatment of data, error analysis, and technical report writing.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1042", "course_title": "MECHANICAL MEASUREMENTS 2", "description": "Builds on the foundation of mechanical measurements provided in MEMS 1041 to provide students with the ability to properly design and perform an experiment on a complex mechanical system in order to determine specific characteristics or performance of that system. Specific material includes extended knowledge of statistics and error analysis, computer-based data acquisition, and technical communications.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1043", "course_title": "SENIOR DESIGN PROJECT", "description": "A major project involving literature search, planning, design, fabrication, experimentation, analysis, technical report, poster presentation, and presentation at a technical symposium is performed by a small team of students under the direction of a faculty advisor and corporate advisor on a project presented by the corporate advisor.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1045", "course_title": "AUTOMATIC CONTROLS", "description": "Modeling of mechanical systems and classical feedback control theory for single-input-single-output systems.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1047", "course_title": "FINITE ELEMENT ANALYSIS", "description": "The finite element method applied in solid mechanics, fluid mechanics, and heat transfer.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1048", "course_title": "ANALYSIS AND CHARACTERIZATION AT THE NANO-SCALE", "description": "This course offers a survey of micro-analytical, microscopy and diffraction methods that are widely used for the analysis of composition, chemistry, structure, scale and morphology of advanced materials. It introduces the most basic concepts required to understand experimental data obtained with these modern techniques. The main objectives of the course are to enable students to interpret and evaluate relevant data sets presented in the research literature and to identify experimental tools to solve a given Nano-research characterization problem. Some prerequisite basic knowledge of the structure of solid matter (e.g. crystals and amorphous materials), diffraction methods (e.g. X-ray diffraction) and processing-property-structure relationships in materials is expected.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1051", "course_title": "APPLIED THERMODYNAMICS", "description": "Thermodynamic processes involving energy and entropy changes in real and ideal gases, vapors, and liquids, and mixtures of those fluids. Basic thermodynamic cycles (vapor and gas power, refrigeration, and heat pumps). Discussion of thermodynamic relations for simple compressible substances and introduction to psychometrics.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1052", "course_title": "HEAT AND MASS TRANSFER", "description": "One- and two-dimensional steady and unsteady heat conduction; internal and external forced convection; free convection; engineering principle of radiation; heat exchangers and special topics.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1053", "course_title": "STRUCTURE OF CRYSTALS AND DIFFRACTION", "description": "Crystallography of materials; Bravais lattices, crystal systems, and crystal structures. Diffraction methods; x-ray, electron, and neutron scattering; atomic scattering factor; structure factor; powder techniques; Laue method; reciprocal lattice; electron diffraction; amorphous materials; thermodynamics of crystals and crystal defects; polymorphism; order-disorder phenomena.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1055", "course_title": "COMPUTER AIDED ANALYSIS IN TRANSPORT PHENOMENA", "description": "An introduction to some of the numerical/computational methods for solving problems in transport phenomena.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1057", "course_title": "MICRO/NANO MANUFACTURING", "description": "Explores different micro/nano manufacturing options, material choices, and a variety of applications. The goal is to gain an understanding of various micro/nano fabrication techniques, learn major applications and principles of micro/nano systems, and develop an ability to design and fabricate new micro/nano systems.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1058", "course_title": "ELECTROMAGNETIC PROPERTIES OF MATERIALS", "description": "Review of basic principles: quantum theory, band and zone theory. Transport, electrical, and thermal properties; semiconductors and semiconductor devices; magnetic materials, hard and soft; dielectric and optical properties.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1059", "course_title": "PHASE EQUILIBRIA IN MULTI-COMPONENT MATERIALS", "description": "Thermodynamics of solutions with applications to materials systems; heterogeneous phase equilibria; relations between free energy and phase diagrams, electrochemistry; rate processes; thermodynamics of surfaces.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1071", "course_title": "APPLIED FLUID MECHANICS", "description": "Basic principles of computational fluid dynamics (CFD). Hands-on experience using a commercial CFD package. Students will us this tool to solve a design problem. External flows with particular emphasis on aerodynamics. Fluid machinery. Experimental fluid mechanics.", "completed": false, "prereq_count": 1}, {"dept_code": "MEMS", "id": "1079", "course_title": "SENIOR MATERIALS RESEARCH PROJECT", "description": "A major project involving literature search, planning, experimentation, analysis, an oral presentation, and a final technical report. The project is either sponsored by the department or a local company and is conducted by an individual or a small team of students with a faculty adviser.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1080", "course_title": "POWDER PROCESSING OF MATERIALS", "description": "Powder processing is widely practiced in the traditional powder metals and ceramics industries as well as in additive manufacturing. This course will review these applications and focus on the underlying materials science and engineering employed in: production of metals and ceramic powders, powder characterization methods, the forming methods used to make shapes from metal and ceramic powders as well as sintering and heat treatment.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "Seminars are designed to acquaint the student with aspects of engineering not normally encountered in classes and include a wide range of topics such as the significance of engineering as a profession and the relation of engineering to current social problems.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1102", "course_title": "PRINCIPLES AND APPLICATIONS OF STEEL ALLOY DESIGN", "description": "This course will present the students with a discussion of the properties that are required of engineering alloys for a given commercial application. The alloy design, thermomechanical processing and required package of mechanical properties for plate, strip, bar, rod, wire and tubular products will be reviewed. These include: strenth, toughness, formability, weldability, fatigue resistance and corrosion/oxidation resistance.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1121", "course_title": "APPLIED ENGINEERING SIMULATION IN DESIGN", "description": "Provide an environment for hands-on learning of simulation software an an opportunity to interact with the simulation student community. Provide a mechanism for the discussion of special topics and for guest speakers. Develop practical simulation software skills.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1163", "course_title": "CERAMIC MATERIALS", "description": "Structure of ceramics and glasses. Microstructures and their development. Properties, processing, and applications.", "completed": false, "prereq_count": 0}, {"dept_code": "MEMS", "id": "1300", "course_title": "LINEAR ALGEBRA FOR MACHINE LEARNING", "description": "Core concepts from linear algebra that are key for understanding and creating applied machine learning algorithms. Topics include least square approximation, neural networks, and matrix factorization for dimension reduction.", "completed": false, "prereq_count": 0}], "links": [{"source": "0071", "target": "1055"}, {"source": "0071", "target": "1071"}, {"source": "1014", "target": "1045"}, {"source": "1028", "target": "1030"}, {"source": "1028", "target": "1035"}, {"source": "1028", "target": "1047"}, {"source": "1041", "target": "1042"}]}