{"nodes": [{"dept_code": "SA", "id": "0110", "course_title": "VISUAL THINKING", "description": "Visual Thinking offers an introduction and insight into the process and practice of creating visual art. The subject is explored by making images supported by lectures, discussions, and critiques. Students are introduced to the dynamics of composition, relationships of form and content, principles of color, visual analysis, and creative problem-solving. The course also seeks to provide some experience with a variety of media, develop skills in observation and technique, and encourage personal engagement in solving visual problems.", "completed": false}, {"dept_code": "SA", "id": "0120", "course_title": "PAINTING STUDIO 1", "description": "This course is an introduction to oil painting that emphasizes color mixing, painting techniques, and composition. The purpose of the course is to promote sensitivity to color interaction, advance technical and compositional skills, and provide a basis for creative growth and expression.", "completed": false}, {"dept_code": "SA", "id": "0130", "course_title": "DRAWING STUDIO 1", "description": "This course provides a comprehensive introduction to observational drawing. The coursework follows a sequence of exercises in various media that introduce basic drawing skills, techniques, and composition through observation and analysis of natural and manufactured forms. The course culminates with an introduction to the human figure.", "completed": false}, {"dept_code": "SA", "id": "0140", "course_title": "SCULPTURE STUDIO 1", "description": "This hands-on course is an introduction to the practice of sculpture in contemporary and historical context. Using clay, plaster, wire, and cardboard, projects address material and technical processes as well as expressive, conceptual, and critical concerns.", "completed": false}, {"dept_code": "SA", "id": "0180", "course_title": "DIGITAL STUDIO: PHOTOGRAPHY 1", "description": "Digital Studio:Photography introduces students to the technical, conceptual, and expressive potential of digital photography as an art form. Emphasis will be placed on creative use of digital cameras and software to conceptualize and translate ideas into meaningful images. Projects will be assigned in order to advance technical skills and develop new insights and approaches to image making. Students will begin to develop an individual voice as an artist by exploring and questioning the use of photography in their work; giving special attention to its conceptual and historical underpinnings, and its material form.", "completed": false}, {"dept_code": "SA", "id": "1220", "course_title": "PAINTING STUDIO 2", "description": "This course is a comprehensive exploration of painting techniques and concepts designed to expand awareness of the craft of painting and expose students to issues relevant to contemporary painting. Students have the option to work with either oil or acrylic paints. The course concludes with the development of a self-directed painting project.", "completed": false}, {"dept_code": "SA", "id": "1230", "course_title": "DRAWING STUDIO 2", "description": "Drawing Studio 2 builds on the knowledge, skills and ideas practiced in Drawing Studio 1 while introducing more advanced approaches to developing content and style in drawing. The coursework therefore is roughly divided between continued practice and development of essential aspects of drawing - such as mark, tone structure, light, space, form, composition and perspective - and assignments designed to spark student explorations of the conceptual and communicative possibilities of drawing. Students will continue to develop observational drawing skills including figure drawing during class meetings; projects will be concerned with technical and formal aspects of drawing while emphasizing ideas and expression. The class will include a diverse range of examples of drawing from art historical through contemporary practices.", "completed": false}, {"dept_code": "SA", "id": "1240", "course_title": "SCULPTURE STUDIO 2", "description": "A continuation of SA 0140, this course explores in greater depth the relationship between material, technique, process, and content in sculpture. Through expanded projects in plaster, wood, and metal, students deepen their experience and develop new skills, while interpreting assignments independently.", "completed": false}, {"dept_code": "SA", "id": "1260", "course_title": "PRINT STUDIO: INTAGLIO", "description": "Intaglio printmaking is a diverse process, offering artists a variety of approaches to create marks, experiment and communicate. This course focuses on making intaglio prints from copper plates. Basic intaglio printmaking techniques are explored through the use of dry point, hard ground line etching, and aquatint. Advanced techniques are explored as the semester progresses. Experimentation is encouraged while developing techniques as well as researching printmaking as a tool to challenge studio practice and content.", "completed": false}, {"dept_code": "SA", "id": "1270", "course_title": "DIGITAL STUDIO: IMAGING", "description": "Digital Studio: Imaging is a studio designed to immerse students in the investigation of digital art practices. Emphasis will be on the history and aesthetics of art and digital technology, including screen-based imaging practices, creative coding, and digital fabrication. Throughout the course, you will acquire and enhance technical skills, but the emphasis will be on the use of the computer as an art-making tool for your creative expression. Thoughtfulness, experimentation and curiosity is encouraged.", "completed": false}, {"dept_code": "SA", "id": "1280", "course_title": "DIGITAL STUDIO: PHOTOGRAPHY 2", "description": "Digital Studio: Photography 2 is centered around creating photographic images and an advanced inquiry into contemporary photographic practices and discourse. The course builds on the knowledge, skills, and ideas practiced in Digital Studio: Photography 1 while introducing advanced shooting techniques and an in-depth exploration of digital printing and modes of presentation. Early shooting exercises will ask you to experiment with different ways of seeing and thinking about image making and to discover uncharted photographic territory both literally and psychologically. You will be expected to create new images weekly, generating contact sheets and prints on a regular basis. The second half of the semester will give you the opportunity to develop a final project where content and form is determined by your personal interests.", "completed": false}, {"dept_code": "SA", "id": "1365", "course_title": "PRINT STUDIO: SCREENPRINT", "description": "This course approaches screenprinting as a medium of artistic expression. Basic screenprinting techniques will be covered, from image generation and screen preparation to the use of screenprinting as a creative outlet. Students will learn the use of basic equipment, printing approaches, papers, a variety of stenciling processes, and photographic and computer techniques to create marks, values, and textures. As the semester progresses, students will gain an awareness of the creative and expressive possibilities of screenprinting and be expected to develop an increasingly complex body of work through their personal vocabulary with the media which may include installation and sculpture.", "completed": false}, {"dept_code": "SA", "id": "1370", "course_title": "PREPARATION AND PRACTICE IN THE VISUAL ARTS", "description": "This is an upper-level writing course that is required for Studio Arts majors and may be taken by minors. Conducted in a seminar format, the course will inspect the wide range of career options in, and related to, the visual arts. Course topics and visitors will offer survival skills for maintaining a visual art practice, while course writings support preparations for professional opportunities.", "completed": false}, {"dept_code": "SA", "id": "1385", "course_title": "DIGITAL STUDIO: ANIMATION", "description": "Digital Studio: Animation will introduce the concepts and skills involved in working with 2D digital animation - from pre to post-production. Each student will propose and undertake a final, self-designed project during the final four weeks of the term. Major effort, time, imagination, productivity, and involvement are expected throughout the term.", "completed": false}, {"dept_code": "SA", "id": "1504", "course_title": "DIRECTED STUDY: STUDIO", "description": "Directed study is a course for art majors to promote concentrated individual development in students who have demonstrated exceptional ability in studio courses.", "completed": false}, {"dept_code": "SA", "id": "1600", "course_title": "SENIOR SEMINAR", "description": "Senior Seminar is a course that develops critical skills necessary to take your work to the next level. Throughout the course you will develop a body of work, engage in robust discussions about contemporary issues and critique your projects. Finally, you will collaborate to create a pop-up exhibition to present your work. Additionally, students will spend time off-campus meeting with artists and exploring art in the Greater Pittsburgh region.", "completed": false}], "links": [{"source": "0110", "target": "1230"}, {"source": "0110", "target": "1240"}, {"source": "0110", "target": "1260"}, {"source": "0110", "target": "1270"}, {"source": "0110", "target": "1280"}, {"source": "0110", "target": "1365"}, {"source": "0110", "target": "1370"}, {"source": "0110", "target": "1385"}, {"source": "0120", "target": "1220"}, {"source": "0180", "target": "1280"}]}