{"nodes": [{"dept_code": "PHIL", "id": "0010", "course_title": "CONCEPTS OF HUMAN NATURE", "description": "An introduction to some ways in which ethical and social thought has been influenced by different views of human nature. Readings are from such authors as Plato, Hobbes, Rousseau, Marx, and Freud.", "completed": false}, {"dept_code": "PHIL", "id": "0012", "course_title": "CONCEPTS HUMAN NATURE/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"Concepts of Human Nature\".", "completed": false}, {"dept_code": "PHIL", "id": "0080", "course_title": "INTRODUCTION TO PHILOSOPHICAL PROBLEMS", "description": "An introduction to some classical problems of philosophy. Topics vary, but might include skepticism, free will, the existence of god, and the justification of ethical beliefs.", "completed": false}, {"dept_code": "PHIL", "id": "0200", "course_title": "HISTORY OF ANCIENT PHILOSOPHY", "description": "The aim of this course is to introduce students to some of the main achievements and leading ideas of ancient Greek philosophy up to classical times. Emphasis will be on understanding and evaluating the arguments and ideas of the Greek philosophical tradition.", "completed": false}, {"dept_code": "PHIL", "id": "0202", "course_title": "HISTORY ANCIENT PHILOSOPHY/WRITING PRACTICUM", "description": "The aim of this course is to introduce students to some of the main achievements and leading ideas of ancient Greek philosophy up to classical times. Emphasis will be on understanding and evaluating the arguments and ideas of the Greek philosophical tradition. Special writing component for PHIL 0200, \"History of Ancient Philosophy\".", "completed": false}, {"dept_code": "PHIL", "id": "0275", "course_title": "INTRODUCTION TO CHINESE PHILOSOPHY", "description": "", "completed": false}, {"dept_code": "PHIL", "id": "0300", "course_title": "INTRODUCTION TO ETHICS", "description": "This is an introductory course considering the question of one fundamental moral principle - right and wrong. The results are applied to moral problems of serious interest today.", "completed": false}, {"dept_code": "PHIL", "id": "0302", "course_title": "INTRODUCTION TO ETHICS/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"Introduction to Ethics\".", "completed": false}, {"dept_code": "PHIL", "id": "0330", "course_title": "POLITICAL PHILOSOPHY", "description": "This introductory level undergraduate course studies several important views on the nature and justification of government, such as those of Plato, Hobbes, and Marx.", "completed": false}, {"dept_code": "PHIL", "id": "0350", "course_title": "PHILOSOPHY AND PUBLIC ISSUES", "description": "The aim of this introductory undergraduate course is to encourage systematic and clear thought about issues of public importance by philosophic reflection which emphasizes the implications of different moral and political theories for these issues.", "completed": false}, {"dept_code": "PHIL", "id": "0352", "course_title": "PHILOSOPHY AND PUBLIC ISSUES/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"Philosophy and Public Issues\".", "completed": false}, {"dept_code": "PHIL", "id": "0360", "course_title": "INTRODUCTION TO BIOMEDICAL ETHICS", "description": "This introductory level undergraduate course examines various ethical problems arising in medicine, such as euthanasia, abortion, and the allocation of resources.", "completed": false}, {"dept_code": "PHIL", "id": "0380", "course_title": "WOMEN AND PHILOSOPHY", "description": "Primary objectives will be to acquaint students with the history of the relation between women and philosophy in the Western tradition and to teach students to think and write clearly.", "completed": false}, {"dept_code": "PHIL", "id": "0473", "course_title": "PHILOSOPHY OF RELIGION", "description": "An examination of the arguments for and against the existence of god.", "completed": false}, {"dept_code": "PHIL", "id": "0500", "course_title": "INTRODUCTION TO LOGIC", "description": "An introduction to the concepts and methods of modern deductive logic. Propositional logic is emphasized, but quantificational logic is touched upon.", "completed": false}, {"dept_code": "PHIL", "id": "1020", "course_title": "PLATO", "description": "This is an advanced undergraduate course examining Plato's main views both in their historical context, and as they influence our own thinking today; the relations between Socrates and the sophists are also studied.", "completed": false}, {"dept_code": "PHIL", "id": "1170", "course_title": "KANT", "description": "An introduction to the philosophy of Kant, focusing on the \"critique of pure reason\". The course seeks to enable the advanced undergraduate to understand the theories and arguments of this revolutionary and rewarding work.", "completed": false}, {"dept_code": "PHIL", "id": "1225", "course_title": "WITTGENSTEIN", "description": "In depth study of some central sections of Wittgenstein's Philosophical Investigations. The objective will be not only to improve understanding of issues about language, mind, and reality raised in that brilliant but cryptic work, but also to situate the work historically in relation to Wittgenstein's earlier masterpiece Tractatus Logico-Philo sophicus; the analytic tradition in 20th century philosophy; and modern philosophy in general.", "completed": false}, {"dept_code": "PHIL", "id": "1290", "course_title": "TOPICS IN HISTORY OF PHILOSOPHY", "description": "Epistemology is the study of knowledge and its foundations. What is knowledge, and how are claims to knowledge justified? How much can we know, and how do we come to know anything? Empiricism is the view that sensory experience is the source of all our knowledge. Everything we know comes to us through the senses and everything we know requires sensory evidence in order to be justified. In short, all knowledge is empirical knowledge, according to empiricism. This view was at the heart of analytic philosophy as it emerged in the 20 th century. This course follows the historical development of empiricism from British Empiricism, through the logical positivism of Ayer, Schlick and Carnap. Additionally, we will explore some major challenges that have been posed to this theory.", "completed": false}, {"dept_code": "PHIL", "id": "1310", "course_title": "HISTORY OF ETHICS", "description": "An examination of some of the principal moral philosophers in one or more of the major historical periods from Homeric times to the present day--such as Plato, Aristotle, Aquinas, Hobbes, Hume, Kant, Nietzsche, Mill, and Rawls.", "completed": false}, {"dept_code": "PHIL", "id": "1315", "course_title": "APPLIED ETHICS", "description": "The application of ethical theory to specific issues of contemporary life. Specific topics vary with each offering of the course.", "completed": false}, {"dept_code": "PHIL", "id": "1330", "course_title": "TOPICS IN POLITICAL PHILOSOPHY", "description": "This advanced undergraduate course concentrates on a few selected philosophical problems concerning the nature and justification of government; the selection will vary from one offering of the course to another.", "completed": false}, {"dept_code": "PHIL", "id": "1400", "course_title": "RIGHTS AND HUMAN RIGHTS", "description": "", "completed": false}, {"dept_code": "PHIL", "id": "1410", "course_title": "PHILOSOPHY OF ACTION", "description": "", "completed": false}, {"dept_code": "PHIL", "id": "1460", "course_title": "THEORY OF KNOWLEDGE", "description": "This is an advanced undergraduate course in recent and contemporary epistemology. Topics vary somewhat, but generally include many of the following: skepticism, sense data and the myth of the given, induction and confirmation, definition of \"knowing-that-p\", holism and coherence, the status of common sense, and so on.", "completed": false}, {"dept_code": "PHIL", "id": "1500", "course_title": "SYMBOLIC LOGIC", "description": "This advanced undergraduate course develops skills in formal and informal reasoning in predicate-quantifier logic, and covers formal semantics for sentential logic, informal semantics for predicate-quantifier logic, and elementary syntactic metatheory.", "completed": false}, {"dept_code": "PHIL", "id": "1610", "course_title": "INTRO TO PHILOSOPHY OF SCIENCE", "description": "This course provides a broad, introductory survey of current issues in philosophy of science and treats philosophical problems such as confirmation, which are common to all sciences, as well as problems peculiar to individual sciences.", "completed": false}, {"dept_code": "PHIL", "id": "1762", "course_title": "THE GUIDE OF THE PERPLEXED", "description": "Moses Maimonides (1138-1204) was the greatest Jewish thinker of the medieval period, and remains highly influential today. Born in Spain, he became the leading rabbinic authority of his time by writing a compendium of Jewish law, the Mishnah Torah. He was also famous as a physician and author of medical works. His widest impact, however, has been through his masterpiece of philosophy of religion, The Guide of the Perplexed. This engaging, elusive book is important not only for its influence on such major thinkers as Aquinas, Spinoza, Leibniz, and Newton, but also for its insight into questions of religion and rationality. In this course we will study virtually all of the Guide, giving special attention to Maimonides' account of the fall, his theory of religious language, his arguments for the existence of god, his doctrine of creation, his teachings on religious experience, prophecy, and revelation, and his views on human perfection and immortality. In our sessions we will work closely and carefully through the text, at each step following up Maimonides' hints and challenges to his readers. Our goal will be not merely to appreciate the surface purport of the book, but also to discern its deeper implications, through which Maimonides sought to suggest, to a few of his readers, the secret meaning of the bible itself.", "completed": false}, {"dept_code": "PHIL", "id": "1940", "course_title": "HONORS THESIS/MAJORS", "description": "This is a special directed study for senior philosophy majors who wish to write an honors thesis over two terms. Use course PHIL 1941 for the second term.", "completed": false}, {"dept_code": "PHIL", "id": "1942", "course_title": "HONORS THESIS 3/MAJORS", "description": "This is a special directed study for senior philosophy majors who wish to write an honors thesis in one term.", "completed": false}], "links": [{"source": "0500", "target": "1500"}]}