{"nodes": [{"dept_code": "ENGR", "id": "0011", "course_title": "INTRO TO ENGINEERING ANALYSIS", "description": "This course will provide an introduction to Excel and an introduction to design and entrepreneurship. In addition, we will address teamwork and professional integrity, both important aspects of engineering. This is a team-based, hands-on course, in which most of our class time will be spent working in teams to solve problems and participate in discussions, using what we learn in the course.", "completed": false}, {"dept_code": "ENGR", "id": "0016", "course_title": "INTRODUCTION TO ENGINEERING COMPUTING", "description": "In this course, we will learn basic programming skills using MATLAB and C. In addition, we will address teamwork and professional integrity, both important aspects of engineering. This is a team-based, hands-on course, in which most of our class time will be spent working in teams to develop programs, solve problems, and participate in discussions, using what we learn in the course.", "completed": false}, {"dept_code": "ENGR", "id": "0020", "course_title": "PROBABILITY AND STATISTICS FOR ENGINEERS 1", "description": "An introductory course in statistics. Topics covered include: data analysis, probability, random variables, selected discrete and continuous probability distributions, one sample and two sample estimation, hypothesis testing, experiments with two factors and introduction to regression analysis.", "completed": false}, {"dept_code": "ENGR", "id": "0022", "course_title": "MATERIALS STRUCTURE AND PROPERTIES", "description": "An introduction to the basic concepts of materials science and engineering. The concepts of atomic, crystal, micro- and macro-structure, their control and effects on chemical, electrical, magnetic, optical, and mechanical properties. Modification of properties by heat treatment and control of processing. Fundamental considerations in materials selection.", "completed": false}, {"dept_code": "ENGR", "id": "0081", "course_title": "FRESHMAN ENGINEERING SEMINAR 1", "description": "An in-depth orientation in the various areas of engineering and the related fields of employment. Includes small group meetings with departmental representatives and special freshman academic advisors. A formal departmental choice is made at the conclusion of these courses.", "completed": false}, {"dept_code": "ENGR", "id": "0087", "course_title": "TRANSFER SEMINAR", "description": "A 9 week seminar course for first semester regional and external engineering transfer students. The course discusses the transition to the Swanson School of Engineering and resources available to students at the University of Pittsburgh.", "completed": false}, {"dept_code": "ENGR", "id": "0089", "course_title": "COUNSELING", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "0131", "course_title": "STATICS FOR CIVIL AND ENVIRONMENTAL ENGINEERS", "description": "A basic course in statics. Utilizing the free-body diagram, the course covers forces and equilibria of particles, rigid bodies, surfaces, trusses, beams, cables, and other basic structural elements. Use is made of computers for problem solving.", "completed": false}, {"dept_code": "ENGR", "id": "0135", "course_title": "STATICS & MECHC OF MATERIALS 1", "description": "First of a two course sequence covering statics and strength of materials. Topics covered include: concurrent force systems, equilibrium, axial loading, stress, strain, deformation, moments, equivalent systems, centroids, centers of mass, and distributed loads, free-body diagrams, equilibrium of rigid and deformable bodies, plane trusses, frames and machines, equilibrium in 3D, torsion and friction. Use is made of computers for problem solving.", "completed": false}, {"dept_code": "ENGR", "id": "0145", "course_title": "STATICS & MECHC OF MATERIALS 2", "description": "Second of a two course sequence covering statics and strength of materials. Topics include: flexure; second moment of areas, shear force and bending moment diagrams, composite beams, shearing stresses, beam deflections, energy methods, Castigliano's methods, moment area method, combined static loading and columns.", "completed": false}, {"dept_code": "ENGR", "id": "0240", "course_title": "NANOTECHNOLOGY AND NANO-ENGINEERING", "description": "This research-oriented course is a multidisciplinary course taught by a faculty team including a professor of electrical engineering and a professor of chemistry. The course introduces nanoscale devices created from a range of nanomaterials including carbon nanotubes (CNTS), nanoparticles (NPS), and nanowires (NWS). Theories of operation, fabrication techniques and applications of Nano devices will be discussed. The course combines lecture, laboratory work, and web-supported project-based learning.", "completed": false}, {"dept_code": "ENGR", "id": "0501", "course_title": "MUSIC ENGINEERING LABORATORY", "description": "A course directed toward development of basic skills in recording engineering through expanded understanding of the science and engineering of music. The course will use the music engineering laboratory (MEL) located in Benedum hall. The MEL is a state of the art sound recording facility with research and educational capabilities for sound recording and music engineering. Students are expected to have prior musical experience, working knowledge of Fourier transforms, and working knowledge of basic electronics. Topics covered: recording engineering (microphones, amplifiers, and mixing, filtering, special effects). Physics, mathematics, and psychophysics of sound and music (acoustics, speech and singing, hearing, pitch, stereo perception). Musical instrument function (mechanical and electronic)", "completed": false}, {"dept_code": "ENGR", "id": "0711", "course_title": "HONORS ENGINEERING ANALYSIS AND ENGINEERING COMPUTING", "description": "In this course, we will learn basic programming skills using MATLAB and C. In addition, we will address teamwork and professional integrity, both important aspects of engineering. This is a team-based, hands-on course, in which most of our class time will be spent working in teams to develop programs, solve problems, and participate in discussions, using what we learn in the course.", "completed": false}, {"dept_code": "ENGR", "id": "1000", "course_title": "LAB EXPERIENCES", "description": "Provide opportunities to students to volunteer in a research lab to determine if undergraduate research is an area that the student would like to further engage in for course credits, for payment from a PI, or for summer research experience.", "completed": false}, {"dept_code": "ENGR", "id": "1017", "course_title": "MANUFACTURING FOR THE FUTURE: FLEXIBLE, GREEN, AND DIGITAL", "description": "What is flexible device manufacturing? What is green manufacturing? What is cybermanufacturing? Importantly, how do these emerging \"types\" of manufacturing differ from traditional manufacturing? It is important to recognize that global manufacturing is undergoing major transformations nowadays. The confluence of new advanced materials, emerging fabrication technologies, and connected cyber-physical systems is creating paradigm shifts for the ways products are conceived, made, distributed, used, and disposed. In the ever-increasing competition of \"making things\" of value to consumers, many industries are now reinventing themselves to cope with this new reality. This class covers the fundamentals behind major global trends, and their implication for the future of manufacturing from an engineering perspective. Topics covered include the following: (1) How the need for flexible and wearable devices is driving innovation in new materials and fabrication processes beyond the traditional microfabrication techniques adopted in the semiconductor industry. (2) How protein-based materials, degradable polymers, and novel recycling technologies are paving the way for more sustainable manufacturing of consumer products. (3) How data analytics and internet of things (IoT) technologies are enabling a new generation of digital manufacturing systems referred to as Industry 4.0, and beyond.", "completed": false}, {"dept_code": "ENGR", "id": "1029", "course_title": "INTRODUCTION TO ENGINEERING FOR HUMANITY", "description": "Engineering is commonly perceived as being impartial, providing purely technical solutions to defined problems for the good of all. In reality, most engineering solutions have greatly benefited the wealthiest of peoples of the world while hundreds of millions continue to live in extreme poverty. This course will consider the central role engineering must play in sustainable human development. It will introduce the practical frameworks that have been developed for small-scale, community level engineering projects that directly address poverty. These frameworks include aspects of community development, planning, project management and assessment necessary for engineers to apply their technical skills. In addition, the course will introduce appropriate technologies with examples for: water and sanitation, energy and shelter.", "completed": false}, {"dept_code": "ENGR", "id": "1050", "course_title": "PRODUCT REALIZATION", "description": "This interdisciplinary course will focus on product analysis, product redesign and product development. Student teams will work with industrial sponsors to develop product plans for emerging and existing products.", "completed": false}, {"dept_code": "ENGR", "id": "1062", "course_title": "START UP FUNDAMENTALS", "description": "This course is offered within the Swanson School of Engineering to undergraduate and graduate students. At the undergraduate level, the class is part of the new Certificate in Innovation, Product Design and Entrepreneurship. The class is designed to introduce the student to the core business concepts behind innovation and entrepreneurship. The class is highly interactive, and students will be required to participate in groups and individually. Grading is heavily weighted around participation in the group project which will be ongoing throughout the semester. The class is taught by Babs Carryer, Director of Education & Outreach, Innovation Institute at Pitt. Guest speakers, who are experts in their fields, will supplement the core teaching. Topics covered will include: ideation, problem/solution, market opportunity, competitive analysis, customer discovery, pitching, funding, finance, legal issues, team building, and innovation within existing companies.", "completed": false}, {"dept_code": "ENGR", "id": "1090J", "course_title": "ENGINEERING COOPERATIVE PROGRAM - UPJ", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1090P", "course_title": "ENGINEERING COOPERATIVE PROGRAM - PITTSBURGH", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1091", "course_title": "SCHOOL OF ARTS AND SCIENCES COOPERATIVE EDUCATION", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1092", "course_title": "ENGRG INT'L COOPERATIVE PROGRAM", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1093", "course_title": "CMP SCI COOPERATIVE PROGRAM", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1098", "course_title": "INTERNATIONAL SENIOR DESIGN EXPERIENCE", "description": "This one credit course is focused on understanding globalization and technology with a particular emphasis on sustainability design and international experience. By the end of this course, students should understand the basic history, government, and economic strategies, related to their country; produce a final design that is the most cost-effective design possible, as funding for construction is limited and repairs in the future would be undertaken by members of the community; be able to define 'globalization' and 'sustainability' and identify how it is impacting their respective fields of study and future employment; gain awareness of differences in the business environments of the U.S. In relationship to the rest of the world.", "completed": false}, {"dept_code": "ENGR", "id": "1099", "course_title": "SPECIAL PROJECT", "description": "Student develops an individual project under supervision of a faculty member. Project may be experimental, design oriented, or instructional. A written report is prepared.", "completed": false}, {"dept_code": "ENGR", "id": "1430", "course_title": "PORTUGUESE 3 FOR ENGINEERS", "description": "This third semester of Brazilian Portuguese is specifically designed for engineering students who will be doing research and/or studying in brazil. The course covers technical and educational terminology through examination of Brazilian sustainable engineering case studies while further advancing the students' knowledge and ability in Brazilian Portuguese. The course will further enhance the cognitive skills of engineering students, and give them an appreciation of the interrelation of career paths, language skills, and cultural awareness. This course is required for all IGERT fellows.", "completed": false}, {"dept_code": "ENGR", "id": "1451", "course_title": "EXPLORATORY DATA SCIENCE", "description": "In this course, we will learn data science and analysis approaches to identify statistically significance relationships and better model and predict the behavior of these systems. We will assemble and explore real-world datasets, perform clustering and pair plot analyses to investigate correlations, and logistic regression will be employed to develop associated predictive models. Results will be interpreted, visualized and discussed. We will introduce basic elements of statistical analysis using R Project open source software for exploratory data analysis and model development. R is an open-source software project with broad abilities to access machine-readable open-data resources, data cleaning and munging functions, and a rich selection of statistical packages, used for data analytics, model development and prediction. This will include an introduction to R data types, reading and writing data, looping, plotting and regular expressions, so that one can start performing variable transformations for linear fitting and developing structural equation models, while exploring for statistically significant relationships.", "completed": false}, {"dept_code": "ENGR", "id": "1627", "course_title": "CHINA TODAY: INDUSTRY, INNOVATION, EDUCATION", "description": "This short course will educate students on the impact of modern china on engineering solutions in a global and societal context, improve student's knowledge of contemporary issues relating to the engineering and business profession. At the end of the course, students will have a general understanding of the corporate, geo-political, cultural and social factors that define the Chinese landscape at the present time. An in-depth paper exploring one of these factors will be required. This short course will explore how these three factors interact in china and in the perceived position of china as a world economy.", "completed": false}, {"dept_code": "ENGR", "id": "1628", "course_title": "BRAZIL TODAY", "description": "This introductory course, offered jointly by Pitt and CMU, explores how current thematic factors interact to influence brazil's position in the world today and into the future. The 3-day, weekend course will touch upon issues including: education, industrial growth, economic development, business influence, exports and socio-economic shifts. Course requirements include attendance, brief written reflections, and a final paper.", "completed": false}, {"dept_code": "ENGR", "id": "1700", "course_title": "INTRODUCTION TO NUCLEAR ENGINEERING", "description": "Introduction to nuclear science and technology; applications of nuclear engineering; careers in nuclear industry; nuclear history; reactor types; elementary nuclear and reactor physics; nuclear radiation and safety; fuel cycle; regulations and sustainability.", "completed": false}, {"dept_code": "ENGR", "id": "1702", "course_title": "NUCLEAR PLANT TECHNOLOGY", "description": "Current and future reactor systems; nuclear power plants; balance of plant configuration; fuel cycle management; reactor operation principles; reactor plant economics; analysis and design of nuclear systems; design projects.", "completed": false}, {"dept_code": "ENGR", "id": "1716", "course_title": "THE ART OF MAKING: AN INTRODUCTION TO HANDS-ON SYSTEM DESIGN AND ENGINEERING", "description": "Engineering is fundamentally a creative process in which ideas are generated and transformed into new systems and devices in the world to meet human needs. The term engineer shares its origins with ingenious: one definition of engineer is 'a skillful inventor.' In this course, we will explore tools and techniques for inventing, designing and prototyping systems. This course is based on experiential learning: through interactive discussions, small-team exercises, maker assignments, workshops and hands-on projects, students will obtain an introduction to design thinking, 'maker culture' and systems engineering. ENGR 1716 is an upper division version of freshman honors ENGR 0716. It is for sophomore, junior and senior level students. We will explore user-centric design principles, low-resolution prototyping and experience prototyping, basic building elements for systems such as sensors, computer controllers, actuators and displays, materials and methods for prototyping, and ways to analyze and troubleshoot systems. Students will gain an introduction to 'smart systems': automated systems that can sense the world and automatically respond in useful ways. We will also focus on the user interface: how to create control and display interfaces that enhance users' ability to operate systems effectively and efficiently.", "completed": false}, {"dept_code": "ENGR", "id": "1905", "course_title": "CURRENT ISSUES IN SUSTAINABILITY", "description": "This course will introduce the core principles of sustainability (i.e. Social, economic, and environmental) from the perspective of several disciplines and research fields. Covering a variety of topics such as urban infrastructure, energy policy and the environment, sustainable water-use, habitat sustainability and biodiversity, the curriculum and schedule are updated annually to reflect advancements in the field of sustainable engineering and science, and to continually incorporate current topics. While the course is primarily taught by the sustainability faculty fellows it will also consist of various guest lectures by sustainability faculty and senior practitioners working throughout the Pittsburgh region. Course assignments will consist of a series of essays and assignments and culminate in a team term project. This is a required course for the undergraduate sustainability certificate and the M.S. in Sustainable Engineering.", "completed": false}, {"dept_code": "ENGR", "id": "1907", "course_title": "SUSTAINABILITY CAPSTONE", "description": "Building upon students' previous experience and skills, this course will focus on enabling interdisciplinary student teams to synthesize comprehensive solutions to complex real-world Sustainability challenges. This is a project-based course. Project topics will be developed in consultation with instructors and sustainability stakeholders. Innovative solutions will require the application of critical thinking and collaboration to resolve. By the end of the course the students will have a deeper understanding of 1) the multi-faceted nature of Sustainability solutions 2) approaches to problem solving across fields and 3) how to communicate sustainable solutions and concepts in an interdisciplinary team environment.", "completed": false}, {"dept_code": "ENGR", "id": "1909", "course_title": "SUSTAINABLE FOOD SYSTEMS", "description": "Our food system is a multifaceted network of interconnected systems and relationships. In order to be able to feed ourselves well into the future, it must be sustainable. A sustainable food system is a system in which healthy food is provided to people while balancing the environmental, social and economic impacts. These dynamics force stakeholders to confront synergies and tradeoffs in agricultural practices, harvesting, transportation, manufacturing and distribution, healthy diets, and a reduction in wasted food.", "completed": false}], "links": [{"source": "0011", "target": "0016"}, {"source": "0011", "target": "0081"}, {"source": "0135", "target": "0145"}]}