{"nodes": [{"dept_code": "JPNSE", "id": "0001", "course_title": "FIRST YEAR JAPANESE 1", "description": "The first step in Japanese language study. The student will acquire a basic competence in speaking, understanding, reading and writing. Emphasis is placed on speaking and understanding as the student learns the sound system, basic vocabulary and essential sentence patterns. Writing will include the katakana and hiragana syllabaries.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "0003", "course_title": "SECOND YEAR JAPANESE 1", "description": "The third term in the sequence of Japanese language instruction designed to increase the student's proficiency in speaking and understanding of modern standard Japanese through the introduction of more complex grammatical structures and idiomatic expressions. Writing will include about 300 additional kanji characters.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "0007", "course_title": "JAPANESE CULTURE AND CIVILIZATION", "description": "This course introduces students to fundamental characteristics of the culture and civilization of Japan from earliest times to the present. As a gateway to more specialized training, it is designed for students having little or no previous knowledge of Japan. Students can expect to leave with a basic grasp of important historical periods, an appreciation of key figures and places of cultural significance, and an awareness of important social changes from earliest times to the present day. Students will improve their analytical skills as they read from outstanding examples of Japanese literature; they will synthesize relevant information about Japanese art, architecture, religion, literature, society, and history from lectures and background readings in order to present well-reasoned arguments about Japan; and they will develop a nuanced understanding of Japan's place in a global context. This course aims to a) improve cultural literacy about Japan and the Japanese, b) increase familiarity with principal historical periods, c) introduce basic geography ' location of principal Asian countries, Japanese islands, and Japanese cities, and d) identify important political, social, cultural, artistic, and literary themes for each of the principal periods covered.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "0083", "course_title": "INTRODUCTION TO JAPANESE LITERATURE", "description": "This course introduces, through English translations, some of the outstanding works which make up the literary heritage of Japan. The student becomes acquainted with a non-Western literary tradition by exploring similarities and differences in ways of thinking and modes of expression. Readings include selections from ancient poetry, classical Romances, forms of drama, early modern fiction, haiku poetry and modern novels.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1020", "course_title": "THIRD YEAR JAPANESE 1", "description": "The first term of the third-year Japanese language course whose primary goal is to develop a broad competency in speaking and reading through materials of academic and cultural interests and the discussion of those materials. The selection of reading materials is made in such a way that most of the characters in the Kyooiku Kanji list is covered.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1050", "course_title": "FOURTH YEAR JAPANESE 1", "description": "A fourth-year Japanese language course for students interested in reading news stories, editorials, journal articles and other special interest items. The goals are to increase vocabulary and to develop the ability to read unfamiliar material as a tool for future research.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1085", "course_title": "INTRODUCTION TO EAST ASIAN CINEMA", "description": "This course investigates the ways in which film addresses and treats the major socio-cultural issues in modern society through a critical study of the works of Chinese and Japanese master filmmakers. The course focuses on changes in marriage and family patterns, women's roles and the plight of youth.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1570", "course_title": "RELIGION IN JAPAN", "description": "This course serves as a historical, doctrinal and practical introduction to the major religious traditions of Japan both classical and modern-day.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1700", "course_title": "INTRODUCTION TO THEORY AND PRACTICE OF TRANSLATION", "description": "This is an introductory course that answers to a growing interest in the theory and practice of translation from Japanese to English. The genres of texts that will be dealt with include literary works of various kinds (novels, poems, children's books), magazine and newspaper articles, web posts, manga, subtitling of anime and other videos, and texts of technical nature. Students will first learn broadly about the discipline of translation studies, including a history of translation and issues in translation (invisibility of the translator, culturally specific translatability issues, etc.). Students will then learn specific types of translation issues that come up when translating Japanese into English, using excerpts from a variety of genres as case studies. Special attention is paid to the structural differences between Japanese and English, cross-cultural differences in stylistics, writing with clarity, reference work, etc.", "completed": false, "prereq_count": 0}, {"dept_code": "JPNSE", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false, "prereq_count": 0}], "links": []}