{"nodes": [{"dept_code": "LATIN", "id": "0101", "course_title": "BEGINNING LATIN 1", "description": "This course is the first in a two-semester sequence providing an introduction to the sounds, vocabulary, and basic grammatical structures of the Latin language. In this course, students will begin to develop competence in reading and translating Latin, both from exercises in a beginning textbook as well as from select Latin stories that illustrate Roman mythology, history, and daily life. Students who complete the course requirements with a C- or higher may proceed to the next course in the sequence (LATIN 0102). Note that this course is a hybrid course, consisting of three 50-minute scheduled in-class meetings and a fourth session to be completed asynchronously online. All online work will take place on Pitt-supported applications. Note: If you have previous experience in Latin, you are encouraged to contact the course instructor to discuss the possibility of placement into an intermediate or advanced level course.", "completed": false, "prereq_count": 0}, {"dept_code": "LATIN", "id": "0210", "course_title": "INTERMEDIATE LATIN: PROSE", "description": "In this course students consolidate their grasp of Latin grammar and develop their skills of comprehension through close reading of selected prose texts, most usually drawn from Caesar and Cicero.", "completed": false, "prereq_count": 0}, {"dept_code": "LATIN", "id": "1402", "course_title": "ADV READINGS IN LATIN DRAMA", "description": "In this course students read selected works by Roman dramatists. The specific authors and works read vary from term to term; the course may be repeated for credit when the material covered is different.", "completed": false, "prereq_count": 0}, {"dept_code": "LATIN", "id": "1800", "course_title": "HONORS COURSE/MAJORS", "description": "In this course undergraduate majors in classics who wish to graduate with honors (and are otherwise qualified) write an honors paper, usually in conjunction with a Latin reading course at the 1300 or 1400 level.", "completed": false, "prereq_count": 0}], "links": []}