{"nodes": [{"dept_code": "SOCWRK", "id": "1000", "course_title": "INTRODUCTION TO SOCIAL WORK", "description": "Explores social work in terms of what the profession seeks (its goals); what it does to achieve those goals (its direct practice methods); which principles are to be reflected in all professional social work activity (its values and ethics); how the profession evolved (its history); which social issues are of particular concern to social workers (its special mission re: poverty, racism, sexism, among others); what types of agencies/services involve professional social workers (its fields of practice); and how effective is professional social work (its evaluative systems). This is a service learning course and requires 45 hours of volunteer service as part of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1005", "course_title": "FOUNDATIONS OF THE WELFARE STATE", "description": "The objective of this course is to examine the nature and structure of social welfare services and institutions; historical and cultural foundations of how societies have provided welfare services for people; current issues in the provision of services.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1011", "course_title": "INTRODUCTION TO GENERALIST METHODS: SOCIAL WORK WITH INDIVIDUALS AND FAMILIES", "description": "Teaches interventive skills in casework with individuals and families, with emphasis on the problem-solving psychosocial, and behavioral approaches.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1013", "course_title": "SOCIAL WORK WITH GROUPS", "description": "Introduces the student to social group work as a method in social work practice. The history of the development of groups in social work with emphasis on practice in the United States is also presented. Remedial, reciprocal and social goals models will be analyzed in relation to the worker's use of self, group, structure, group process, phase development and the agency functions used to achieve individual and group goals.", "completed": false, "prereq_count": 1}, {"dept_code": "SOCWRK", "id": "1015", "course_title": "HUMAN BEHAVR & SOCL ENVIRONMENT", "description": "The objective of this course is to view the range of human needs and behavior as related to various conditions of the urban scene. Examines social, political, economic, and cultural factors which influence individual, group, and community social functioning.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1020", "course_title": "INTRODUCTION TO SOCIAL WORK RESEARCH", "description": "This course is oriented to the reader and user of social work research. Using standard methodology texts and actual research studies, the lectures and discussions are designed to enable students to read and assess studies relevant to social work practice. In this process, the development and conduct of social research, as it applies to the issues and concerns of social work practice, is described and analyzed.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1024", "course_title": "PRACTICUM SEMINAR AND LAB 1", "description": "The objective of this course is for students to be able to identify their feelings and behaviors as well as those of their clients and colleagues which affect the course of their interventions within their practice area.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1025", "course_title": "PRACTICUM 1", "description": "Placement in an agency will be made according to interest and educational need. Evaluation will be made of the student's ability to use classroom theories to enhance service.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1058", "course_title": "ECONOMICS AND SOCIAL WORK", "description": "This course provides an understanding of basic economic theory, and discusses its application to social welfare policy.", "completed": false, "prereq_count": 1}, {"dept_code": "SOCWRK", "id": "1059", "course_title": "CHILD AND FAMILY ADVOCACY", "description": "This is a practical skills course in legal advocacy for non-lawyers. The emphasis is on practical techniques and courtroom skills to enhance the professional effectiveness of social workers in the courtroom setting. Typical areas of discussion include rules of evidence, legal procedure, expert witnesses, interview techniques, cross-examination, law reform, case review and readings and the legal rights of children.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1063", "course_title": "AFRICAN-AMERICAN HEALTH ISSUES", "description": "Course will focus on black health issues from analytical, theoretical and practical perspectives. These perspectives will be introduced through cross-examination of health topics which are critical to the black population, the development of health policies and conceptual models for health promotion and disease prevention.", "completed": false, "prereq_count": 0}, {"dept_code": "SOCWRK", "id": "1079", "course_title": "CHILD WELFARE SERVICES", "description": "Engages students in the study of child welfare, its historical roots, the services provided to families and children, the problems and policy issues in the current child welfare system and culturally competent practice. The study will focus on the etiology, rationale for service, and the current and future provision of services, with emphasis given to legislative mandates for service.", "completed": false, "prereq_count": 1}], "links": [{"source": "1000", "target": "1058"}, {"source": "1000", "target": "1079"}, {"source": "1011", "target": "1013"}]}