{"nodes": [{"dept_code": "ENGFLM", "id": "0355", "course_title": "VISUAL LITERACY", "description": "This is an online course. Visual literacy is an emerging area of study which deals with the growing importance of visual culture in our contemporary world and how we interpret what is seen. This course will emphasize the process of critically viewing specific media artifacts and provide tools to students that will allow them to comprehend and evaluate information presented by a variety of forms of visual media, including television, video, film, photography, and the internet. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "0400", "course_title": "INTRODUCTION TO FILM", "description": "This is a basic course on the visual arts that offers the student abroad introduction to the medium of film. As part of this overview, the class will consider such issues as: the process of contemporary film production and distribution; the nature of basic film forms; selected approaches to film criticism; comparisons between film and the other media.", "completed": false}, {"dept_code": "ENGFLM", "id": "0401", "course_title": "INTRODUCTION TO VISUAL CULTURE", "description": "This course develops skills to interpret visual culture in contemporary life. Using a wide variety of media, including film, television, advertisements, fashion magazines, museum exhibits, comic books, painting, graffiti, video games, the web, and photography, the course focuses on understanding how conceptions of visuality, gender, race, and politics shape definitions of high and low culture as well as questions of knowledge and being. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "0530", "course_title": "FILM ANALYSIS", "description": "This course introduces students to the art of the cinema, and to the techniques for its formal and iconographic analysis. It examines the nature of shot composition and visual framing, the use of color, the role of lighting as a pictorial element, the potentials of camera movement, the modes of editing and the nature of image/sound montage. It also introduces students to dominant cinema forms--narrative, experimental, documentary, etc.--And connects the cinema to visual arts (like painting and sculpture).", "completed": false}, {"dept_code": "ENGFLM", "id": "0540", "course_title": "WORLD FILM HISTORY", "description": "This course both introduces students to techniques of film analysis and acquaints them with major works and movements in international cinema. The course pays particular attention to the evolution of film narrative and visual style through landmarks in film development--European avant-garde films, British documentary, Italian neo-realism, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "0570", "course_title": "INTRODUCTION TO NEW MEDIA", "description": "In this course we will look at how new media -- ranging from television, computers, digital image production, video games, to social media platforms and smart phones -- have begun to supplant the social and cultural prominence of film and other traditional media. We'll look at how these media work: at the history and theory of their development, at the changes they have brought about in a broader media culture, and at their social status and significance (e.g., The place they occupy in culture, the kinds of interactions they make possible). This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "0712", "course_title": "CRITICAL MAKING", "description": "The Maker movement is an emerging social and media form that is at once highly networked and post-digital. Making is situated at the intersection of social media, the online gift economy, and a participatory, interventionist engagement with one's physical environment. Drawing on open source ideals and innovation structures -the free sharing of code to enable collaborative development - making has become an attempt to democratize material culture through networked access to tools. MakerSpaces and MakerHubs have become critical nodes in efforts to materialize the virtual gift economy of the Internet. In this course we will engage the intellectual and practical roots of this new medial and social form and engage in our own critical making projects, utilizing scanning, modeling, and 3D printing technologies. We will begin by looking at the history and philosophy of open source software development, and then the political, social, cultural, and technological developments that have together given rise to critical maker culture. We will then learn some of the basic tools of scanning, modeling, and 3D printing. After initial modeling and printing assignments, students will form groups and develop collaborative final projects that involve materializing complex conceptual relationships from a topic of your choice and in a medium of your choice. The aim of this course is to \"close the circuit\" between creative conceptual production, social networking, and materialized object relationships. Critical making is about critically engaging and creatively remaking the world around us. By the end of the semester, you will become a critical maker! This is a Critical Studies course with Production elements and counts for Category III towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1290", "course_title": "AMERICAN FILM 1", "description": "This course explores the development of American film from 1895 to 1939. Though the course will emphasize the evolution of American film style and genre, attention will also be paid to the history of the American film industry, and the relationship between Hollywood cinema and the broader cultural context of American society. The course will provide the student with the historical and aesthetic background with which to better appreciate the American cinema of today and yesterday. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1400", "course_title": "SUPERHEROES ON FILM AND TELEVISION", "description": "This course explores a wide range of issues relevant to the superhero genre in popular media, including: the origins of the genre; various cultural critics' responses to it; the intersections between superhero narratives, audiences, and the cultural and historical contexts that produce them; and the ever-changing form and structure of the genre itself. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1470", "course_title": "FILM DIRECTORS", "description": "This is a course that changes topics every term; please see the Topic title and/or Class Notes for the specific director. This course looks at the mode of production of films and works to understand the interweaving contributions of directors, producers and screenwriters. It will also consider less personal forces--social climate, studio style, genre and audience taste. It examines the films of particular directors for signs of personal style, theme, or personal preoccupation. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1485", "course_title": "FILM AND POLITICS", "description": "This course examines film production, economics and forms of representation as reflections of political attitudes. We will study a variety of narrative and non-fiction films which reveal differing political points of view, ranging from those that legitimize the dominant culture to those which criticize, if not challenge, dominant attitudes. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1671", "course_title": "MAKING THE DOCUMENTARY", "description": "This is a production course in which students will research, define, and schedule their own projects. The class covers all stages of producing a documentary from the idea through development, preproduction, production and postproduction and will examine the fundamentals of the art of documentary making: artistic identity, point of view and storyteller, form and style, and light and sound etc. Students will develop and produce original documentary short film in a collaborative learning environment, working in small groups (of two or three students). They will write, develop, and shoot their own short documentary project (8 to 10 minutes). While those interested in writing or filmmaking will find practical uses for their skills in this course, students from all disciplines - writing, science, film studies, or general liberal arts - are welcomed, and will find benefit in the acquisition of skills for presenting, representing, and persuading via sound and image. No filmmaking experience is necessary. This is a Production course and counts for Category III towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1695", "course_title": "HORROR FILM", "description": "This course will investigate the key films and critical discussions surrounding the horror genre from its silent film beginnings to the present. We will use horror as a lens to ask wide-ranging questions about spectatorship, theory, history, aesthetics, and politics that have shaped and continue to transform film and media studies. This course examines horror subgenres, the ways that producers and directors have developed the genre, and the ways horror film exploits social attitudes and values to generate audience involvement. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1703", "course_title": "GENDER AND FILM", "description": "This course examines and questions aspects of gender and sexuality in international cinema. While the course considers the intersectional realities affecting masculinity and femininity on-screen, it will also consider who is behind the camera and ideas of \"authentic\" representation. Attention will also be paid to the social and historical context in which these films were made, in an attempt to understand the relationship between art and ideology. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}, {"dept_code": "ENGFLM", "id": "1752", "course_title": "TELEVISION ANALYSIS", "description": "This course studies television as a visual medium, an industry, and as a cultural force by examining the forms television programming takes and the way these structures influence viewer response. We will examine specific television genres from longstanding series types (sitcoms, cop shows, serials, etc.) to the gendered forms of \"quality\" television. This is a Critical Studies course with Production elements and counts for Category II towards the Film and Media Studies major and minor.", "completed": false}], "links": []}