{"nodes": [{"dept_code": "INFSCI", "id": "0010", "course_title": "INTRODUCTION TO INFORMATION, SYSTEMS AND SOCIETY", "description": "Introduction to the concepts, principles, and skills of information science for students with no programming experience. Topics include the need for information and the use of information, data collection, coding, storage and retrieval, information processing, information display, and the evaluation of information. This course is intended for students enrolled in programs other than the BSIS major.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "0013", "course_title": "COMPUTER METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing xml-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "0310", "course_title": "COMPUTATION IN INFORMATION SCIENCE", "description": "The objective of this course is to introduce the mathematical and computational techniques used in information science with an emphasis on modeling and analysis of information technology (i.e., computers, data centers, communication networks). Topics course covers fundamental concepts, such as probability, statistical analysis of measurement data, matrix methods, graph theory, and simulation and modeling techniques. Also Covers Basic mathematical concepts that are relevant to information science, including matrix operators, probability, graph theory, binary codes, and entropy.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "0410", "course_title": "HUMAN-CENTERED SYSTEMS", "description": "This course is an introduction to the study of the design and implementation of human-centered systems. Human-centered systems place the human at the center of the design process. This course will look at theoretical foundations and formal methods from a variety of fields including computer science, psychology and sociology; the actual design process, the dynamics associated with focusing on the individual, small groups and society; and may include selected special topics (instructor dependent) from the following: geospatial reasoning, mobile interaction, multimedia, ubiquitous computing, haptic interaction, virtual reality, wearable computing and sensor based systems.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "0510", "course_title": "DATA ANALYSIS", "description": "This course will provide an introduction to programming, data processing, and data analytics using Python for highly motivated students with little or no prior experience in programming. The course will focus on learning the Python programming language in the context of working with data, planning and organizing programs, commonly-used algorithms, data management, data cleaning, basic machine learning, data mining, and fundamentals of computational modeling.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "0530", "course_title": "DECISION-MAKING IN SPORTS", "description": "Students will be introduced to concepts related to data collection, data quality, data analysis and modeling, as well as data visualization, through the context of sports analytics. Data and analytics have been part of the sports industry dating to the 1870s, when the first boxscore in baseball was recorded. Recently, advanced data mining and machine learning techniques have been incorporated into the operations of sports franchises. In this course, students will become familiar with data science concepts and data analysis techniques, the interpretation and use of probabilities, the notion of overfitting and how to avoid it, and the components of a useful visualization.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "0610", "course_title": "NETWORKS AND INFORMATION", "description": "Networks are present in most aspects of our lives. On a daily basis, we rely on communication networks to get our work done, on transportation networks to travel around the city or aroundthe world, and on social networks (both physical and virtual) for our well being. There are many other ways in which networks enter our lives in visible and invisible ways. This course is an introductory look into the science of networks and how that science affects us in what we do. As a result, we will study some of the basic ideas that emerge out of network science with a particular attention to the ways in which these ideas arise in the networks that touch our lives on a regular basis. One of the principal types of networks that we will study will be computer communications networks. Thus, a secondary goal of this course is to introduce students to some of the principal ideas and technologies in computer networks.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1023", "course_title": "INNOVATION & ENTREPRENEURSHIP IN INFORMATION TECHNOLOGY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "1082", "course_title": "INFORMATION SCIENCE COOPERATIVE PROGRAM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "1400", "course_title": "ANALYSIS OF INFORMATION SYSTEMS", "description": "This course provides state-of-the-art skills in requirements management and scope management, which is critical for successful IT projects. Topics include best practices in eliciting, documenting, verifying and modeling requirements. This is an active learning course where students develop an analysis model for a realistic IT project which can serve as a foundation for an analysis model that is suitable for inclusion in the student's IT portfolio.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1420", "course_title": "USER-CENTERED DESIGN", "description": "Introduces principles and programming of interactive systems. Interaction techniques are surveyed and incorporated into the design of interfaces.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1430", "course_title": "USER EXPERIENCE ENGINEERING", "description": "This course presents the fundamental principles of user experience (UX) engineering across three broad categories of designs and products - digital products, virtual worlds, and physical spaces. This course will cover a broad range of topics, including specifying, designing, and evaluating user experiences, understanding the role of user experience in the design of digital products, virtual environments, and physical spaces, and the roles of psychology, sociology, and psychometrics in user experience design. This is an active learning course where students will be expected to read research papers, participate in class discussions, and work with external stakeholders.", "completed": false, "prereq_count": 2}, {"dept_code": "INFSCI", "id": "1440", "course_title": "SOCIAL COMPUTING", "description": "This course focuses on how social groups form and evolve, how members of these groups interact with each other, and how these groups are supported and augmented with computer systems. The course is interdisciplinary, drawing from the fields of computer science, psychology, and sociology. It covers key theories and technologies of social computing in terms of (1) computer systems supporting social behavior and (2) socially intelligent computing carried out by groups. Students will have a chance to explore social computing systems, get experience with social data analyses and focus on design, and evaluation of a social software as their final project for the course.", "completed": false, "prereq_count": 3}, {"dept_code": "INFSCI", "id": "1450", "course_title": "GAME DESIGN", "description": "Games have become ubiquitous in our modern world. In addition to entertainment, elements of games are present in everything from promotional advertisements to university classrooms. This course focuses on the exploration of game design in its many permutations. Join us as we critique and design all manner of entertainment and serious game. The class itself is designed as a multiplayer game experience to immerse and engage the student in game design on a fundamental level. One of the final goals of this class is for each student to have designed two separate games in their entirety. These games may be useful in the follow-up course, Immersive Media Technologies.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1500", "course_title": "DATABASE MANAGEMENT CONCEPTS AND APPLICATIONS", "description": "This course introduces students to the practical methodologies of data design, management, storage, and retrieval in the context of relational database management systems. This course covers fundamental concepts of effective database development process, including entity-relationship model, normalization, structured query language (SQL), basics of transaction management and physical database design.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1550", "course_title": "SPATIAL INFORMATION", "description": "Introduction to geographic information system (GIS) concept and technology including spatial data sources, spatial data models and structures, spatial database management, map projection systems, geocoding and Georeferencing, spatial analysis, spatial data visualization (maps), GIS applications (e.g., Address-location finding, navigation, routing), and commercial GIS software packages.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1570", "course_title": "NETWORK AND WEB DATA TECHNOLOGIES", "description": "This course is about the core technologies and standards for web based distributed systems that we use to build Web applications. It includes an overview of the standardization process and the standards organizations. The course will introduce client and server-side technologies for the web with emphasis on front-end technologies such as HTML5, JavaScript, CSS, responsive design etc. and a set of back-end technologies and APIs.", "completed": false, "prereq_count": 3}, {"dept_code": "INFSCI", "id": "1600", "course_title": "SECURITY AND PRIVACY", "description": "The objective of this course is to provide an understanding of information security ranging from threats, vulnerabilities, and attacks to protection, detection, and response. Students will develop the ability to converse with the terminology used in information security (e.g., confidentiality, authentication, integrity, availability). The course will cover the basics of security issues in operating systems, applications, and databases. This is followed by an examination of the architecture and generalized protocol/operational aspects of information networks to identify how security attacks (e.g., denial of service) are possible. Basics of security mechanisms such as cryptography, firewalls, and secure protocols for networks will be presented. The course will include a discussion of privacy and human factors in security (e.g., usable security).", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1630", "course_title": "COMMUNICATION NETWORKS", "description": "The focus of this course is on the Internet â\u0080\u0093 the most widely-used communication network. Provides an introduction to data communications and networking, particularly examining elements of today's Internet. Students will learn how applications are supported and communicated through services offered by the Internet. Covers features of transport layer protocols, routing protocols, and medium access protocols. Also, the course will explore physical layer technologies and provide a basic introduction to multimedia networking and network management concepts.", "completed": false, "prereq_count": 1}, {"dept_code": "INFSCI", "id": "1690", "course_title": "CLOUD COMPUTING", "description": "This course provides an overview of the concepts and design principles behind existing cloud solutions. Topics include large scale data processing techniques such as mapreduce/hadoop and its related ecosystem, overview of virtualized commercial cloud models, system virtualization, hypervisors and virtualized platforms. Design of cloud storage systems such as key-value stores and geographically distributed storage systems. Introduction to security and privacy issues in cloud computing, issues of data and execution privacy in modern commercial cloud services.", "completed": false, "prereq_count": 3}, {"dept_code": "INFSCI", "id": "1700", "course_title": "DATA-DRIVEN COMMUNICATION", "description": "Digital transformation is disrupting traditional business models, enabling organizations to not only increase client value, but develop entirely new business models that drive exponential growth and deliver a significant competitive advantage. Harnessing this technology requires the ability to be better problem solvers and transform data into answers. In this course, students will build upon their problem solving, data analytics, and communication skills. They will learn how to translate complex technical topics into actionable insights, leverage storytelling to influence and persuade, and visualize data for impact. In summary, students will use advanced information economics, data, their knowledge of human-centered systems, and include digital transformation in organizations and communities for ideation and communication to diverse audiences. This course may serve as a capstone for students in the Information Science major.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "1720", "course_title": "INTERNSHIP", "description": "Supervised work in an information environment providing a frame of reference for understanding and an opportunity to apply the skills, methodologies, and theories presented in information science courses.", "completed": false, "prereq_count": 0}, {"dept_code": "INFSCI", "id": "1740", "course_title": "TEAM-BASED CAPSTONE PROJECT", "description": "Learn how to solve real-world problems and experience the satisfaction of seeing a project through from start to finish. Gain hands-on experience working directly with clients and observe how senior leaders make difficult decisions. Build skills in requirements gathering, scope management and stakeholder management. Strengthen project management and interpersonal skills by working in a team-based setting under the guidance of faculty. Performance will be evaluated and graded based on the overall project success and assessments from the client, faculty and student peer reviews.", "completed": false, "prereq_count": 0}], "links": [{"source": "0310", "target": "0510"}, {"source": "0310", "target": "0610"}, {"source": "0410", "target": "1400"}, {"source": "0410", "target": "1420"}, {"source": "0410", "target": "1430"}, {"source": "0410", "target": "1440"}, {"source": "0410", "target": "1450"}, {"source": "0410", "target": "1570"}, {"source": "0510", "target": "1430"}, {"source": "0510", "target": "1440"}, {"source": "0510", "target": "1500"}, {"source": "0510", "target": "1570"}, {"source": "0610", "target": "1440"}, {"source": "0610", "target": "1570"}, {"source": "0610", "target": "1600"}, {"source": "1400", "target": "1690"}, {"source": "1500", "target": "1550"}, {"source": "1500", "target": "1690"}, {"source": "1600", "target": "1630"}, {"source": "1600", "target": "1690"}]}