{"nodes": [{"dept_code": "PS", "id": "0200", "course_title": "AMERICAN POLITICS", "description": "This course is, quite generally, designed to provide students with a basic working knowledge of the basic goals of the constitutional framers, giving students an understanding of the purposes of the American political system; the essential structures (or institutions) within the American political system, the behavior (broadly defined) of the actors within the American political system, the purpose and performance of the linkage institutions in the United States (possibly including political parties, elections, and interest groups); and the types of policies that are often produced by a system with the characteristics of those found in the United States. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0300", "course_title": "COMPARATIVE POLITICS", "description": "This course provides students with basic information about a range of political systems outside the United States and teaches them to use that information to examine major theories about politics. The course is also designed to help students understand the government and the politics of the United States in comparative perspective and to develop some understanding of comparative methodology and the logic of comparison as a social science method. Depending on the interests, area of expertise, and inclinations of the particular instructor, some regions and topics might be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0500", "course_title": "INTERNATIONAL RELATIONS", "description": "This course aims to increase students' knowledge of the history of the modern state system and, in particular, political developments during the past few decades. It introduces students to basic concepts and analytic frameworks that political scientists employ to understand world politics, enhancing students' knowledge of international institutions that play important roles in world politics and exploring current issues in world affairs relating to human welfare and security. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0550", "course_title": "INTRODUCTION TO GLOBAL STUDIES", "description": "Global Studies is a rapidly growing interdisciplinary field that explores how people interact with one another and with nature across existing boundaries, over long distances, and in ways that affect the entire planet. It provides new and exciting ways of looking at connections and divisions in the world beyond the confines of particular places, nation states, and regions. This course provides an introduction to the field. It examines current global trends and issues in ways that encourage you to think critically about how we analyze, interpret, and respond to global interactions and their consequences for different regions, localities, and groups. It gives particular attention to the concept of globalization, highlighting the controversies surrounding its use and engaging core debates about the impact of global and transnational processes on economic relations, politics and governance, cultural interactions, and the environment.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0600", "course_title": "POLITICAL THEORY", "description": "This course is designed to introduce students to the idea of normative political theory and to important authors and concepts in the western political theory tradition. Students will learn to understand both historical and contemporary debates surrounding important political concepts such as authority, justice, liberty, and democracy, and to appreciate the differences among normative, empirical, logical, and faith-based political claims. Students will learn to read critically and analytically, to make simple normative arguments, and to explain the specific role of normative arguments in political science and political life. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0700", "course_title": "RESEARCH METHODS IN POLITICAL SCIENCE", "description": "The course provides an introduction to scientific inquiry applied to the study of politics. The main emphasis of this course is to introduce political science majors to key analytical concepts and to their application to the study of politics. The course covers the logic of scientific inquiry, research design, and quantitative methods.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0702", "course_title": "INTRODUCTION TO COMPUTATIONAL SOCIAL SCIENCE", "description": "This course will serve as the overall introduction to computational social science. It will showcase why computational social science is needed and distinct, and briefly introduces students to cutting edge applications of computational social science across topics that range from climate change and public health to cybersecurity.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1000", "course_title": "HONORS THESIS-MAJORS", "description": "Students prepare a thesis, under guidance of a faculty advisor, which is read and evaluated by a committee of three faculty members.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1201", "course_title": "CONSTITUTION AND CIVIL LIBERTIES", "description": "The course will explore major topics in the area of civil liberties and civil rights which have concerned the Supreme Court in recent years and which have provoked extensive political and social controversy. Examples include decisions about discrimination, privacy, freedom of speech and assembly, and conflicts between freedom of the press and a fair trial.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1213", "course_title": "LAW AND POLITICS", "description": "Examines the relationship between law and values, law and power, and law and discretion. Legal reasoning is examined as applied to statutory, case, and constitutional law.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1232", "course_title": "POLITICAL ATTITDE & PUBLIC OPIN", "description": "This course explores the formation and measurement of mass public opinion. Topics include: how individuals gather information; the formation of political ideology, political attitudes, and political preferences; the stability of public opinions across different issues; the relationship between mass public opinion and government policy (both what it is, and what it should be); and methods for measuring public opinion, including public opinion surveys.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1262", "course_title": "HEALTH POLICY IN UNITED STATES", "description": "This course is an introduction to current problems of health care and health policy in the United States. Description and analysis of the proposals, current practices, and the reactions of interest groups will be the central theme of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1264", "course_title": "AMERICAN POLITICS THROUGH FILM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1281", "course_title": "CAPSTONE SEMINAR IN AMERICAN POLITICS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1291", "course_title": "WOMEN IN POLITICS - ANALYSIS", "description": "This course will consider political issues and explore the changing political role of women as citizens, candidates, office-holders, and policymakers. The emphasis will be on the American political experience, although examples will be drawn from other countries. This class will include a significant training in a specific analysis method or methods to complement the course topic, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1293", "course_title": "LEGISLATIVE PROCESS - ANALYSIS", "description": "This course provides an analysis of the legislative process in modern democracies with primary attention devoted to the legislative process in the United States. The history and meaning of representation is analyzed as is the behavior of participants in the legislative process. The impact of social-economic forces on decision-making in the United States is studied as are the roles of interest groups, political parties, the executive branch, and the judiciary. This class will include a significant training in a specific analysis method or methods to complement the course topic, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1309", "course_title": "COMPARATIVE REGIONALISM (EUROPE AND ASIA)", "description": "More than 80% of today's international trade is generated through regional trading arrangements. 65% of international trade is produced by Europe and Asia, two of the largest and most integrated regions in the world. If you are interested in international policy issues, including peace and security, aid, development and trade, or transnational policy issues such as climate change, people trafficking, and managing health pandemics, this course is for you. How can you best prepare yourself for international policy work in a government agency, an international organization, or an international non-governmental organization? Start with this course to gain an understanding of the regional dynamics in Europe and East Asia, and how these regions are shaping the international order. Are you looking to acquire new practical skills? In this course students will conduct primary and secondary research, and learn to use Tableau, a data visualization software, to present their research findings.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1321", "course_title": "LATIN AMERICAN POLITICS", "description": "This course compares and contrasts the governments and political processes throughout Latin America. It offers a detailed look at several countries, and also provides a comparative framework to discuss the rise, fall, and quality of democracy.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1326", "course_title": "EAST ASIAN POLITICAL ECONOMY 1950-PRESENT", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1327", "course_title": "POLITICS OF REVOLUTION", "description": "Politics is often about conflict, but sometimes that conflict takes place within legislative bodies and other times in the streets. Most of what we study in political science courses focuses on conflict within the electoral framework, but this course asks what happens when citizens take conflict into their own hands. This course will examine the conditions that prompt people to organize on behalf of their collective interests, how protest movements evolve, and under what conditions they succeed. The first half of the class will cover theoretical topics: the causes, strategies, and consequences of protest activity. The second half of the class will focus on types of protest (political protests, revolutionary movements, social movements, riots, and guerrillas) through comparative case studies. Most case studies in class will be based on examples within the Western hemisphere (North, central, South America, and the Caribbean) - a geographical region with an enormous variety of types, causes, and consequences of protest movements - but students will be encouraged to become independently familiar with protest movements around the world.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1341", "course_title": "GOVERNMENT AND POLITICS USSR/RUSSIAN FEDERATION", "description": "A survey of the political systems in the USSR (1917-1991) and its major successor, the Russian Federation (1991-present). The first section deals with the period from the Bolshevik Revolution in 1917 until the mid-1980s. The second section examines the efforts to reform the political system under general Secretary Gorbachev. The final section deals with the collapse of the USSR in 1991 and the subsequent development of the Russian Federation as an independent state.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1351", "course_title": "GOVERNMENT AND POLITICS OF THE MIDDLE EAST", "description": "A survey of the developing political systems of the Middle East and their positions in world affairs. Considered are the growth of political institutions in the modern era, the nature of political leadership, the evolution of political attitudes, and the legacy of Western and Soviet imperialisms. The states dealt with are Iran, turkey, Iraq, Lebanon, Jordan, Syria, Egypt, and Israel. The course includes a diplomatic simulation exercise designed to illustrate the complexity of foreign policy interactions in the region.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1352", "course_title": "INTRODUCTION TO AFRICAN POLITICS", "description": "A general introduction to African politics at macro level for freshmen and sophomores with special focus on traditional African political system, European imperialism in Africa, African nationalism, independence and post-independence problems of nation-building and economic development.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1357", "course_title": "THE POLITICS OF FOOD, LAND, AND SUSTAINABILITY", "description": "The debates surrounding food and agricultural land are often seen as scientific and outside the realm of social scientists. Yet many of the key decisions regarding food production, distribution, and consumption are decidedly political. This course provides students with the concepts and theories necessary for understanding and analyzing the various policies and proposals put forth by food producers, consumer groups, politicians, government regulators, and other food-related interest groups. This course is based on the premise that rational and desirable policy goals for any society are to create and maintain food systems that promote health, protect the environment, are sustainable, and support the livelihoods of participants, but that powerful forces in society including large businesses seeking profits and school boards protecting budgets may oppose this premise in theory or practice. Hence: politics. The course considers how the U.S. and other governments develop policies aimed at ensuring a sufficient, nutritionally adequate, safe, affordable, and sustainable food supply. Drawing on contemporary case studies, it examines: why and how governments establish food and nutrition policies; how stakeholders in the food system use the political system to influence policy; the cultural, social, economic, and political factors that influence stakeholder and government positions on policy issues.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1381", "course_title": "CAPSTONE SEMINAR IN COMPARATIVE POLITICS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1386", "course_title": "POLITICS OF LEADERSHIP", "description": "The life and work of every politician and statesman is a unique story, which can illustrate much about extremely complex and convoluted nature of politics. This course will study some of the key politicians and statesmen of the 20th and 21st centuries as the positive and negative examples of political leadership. Moreover, relying on the vast scholarly literature on this subject, the course will review different types of leadership (charismatic, institutional, hereditary, and others) in different political systems and regimes (authoritarian, liberal-democratic, and monarchial) and very importantly, will focus on leadership personalities, tactics, techniques and skills in order to fully dissect and understand the key characteristics of good and bad, effective and ineffective leadership.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1502", "course_title": "INTERNATIONAL LAW AND PROBLEMS OF WORLD ORDER", "description": "International law provides an important framework through which state and non-state actors interact at the global level on a great many number of topics. This course will start with a survey of the sources, processes, institutions, and politics of public international law. We'll then explore historical manifestations of international criminal law related to mass atrocity crimes such as genocide, war crimes (i.e., attacking civilians, rape, and torture), and crimes against humanity (i.e., slavery and apartheid). Throughout the term, we will reflect on the stakes of defining actions and policies as \"mass atrocity crimes,\" the construction of popular and official discourses through which crimes and bystander actions are justified, the power and effects of international legal instruments, and the politics of pursuing justice through international tribunals or other legal mechanisms. [WARNING: This course covers a wide array of emotionally difficult topics.]", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1503", "course_title": "INTERNATIONAL ORGANIZATION", "description": "This course focuses on the interplay among states, intergovernmental organizations, civil society organizations, and multinational corporations. Cases are drawn from a broad range of issue areas, including economic relations, human rights, peace and security, and the environment. The objective is to better understand the dynamics and evolution of formal and informal international institutions and what difference they make, in light of globalization and emerging geopolitical changes.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1504", "course_title": "NATIONALISM", "description": "Theories of nationalism, ethnicity, and race are examined and are contrasted with theories of modernization and socialism. Particular emphasis is placed on ethnonationalism in developed Western countries, such as Britain, France, Spain, Belgium, and Canada, and on ethnic politics in the U.S. Comparisons are drawn with nationalism in other types of political systems, particularly the USSR, Yugoslavia, and selected Middle East and African countries.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1513", "course_title": "FOREIGN POLICIES--CHANGING WORLD", "description": "The aim of this course is to introduce students to the analysis of foreign policy as a form of political behavior and to the specific factors influencing the foreign policies of several of the world's most powerful states. The lectures and readings follow several intertwining themes, covering: 1) the conceptual and analytical tools utilized to investigate and compare the foreign policies of states; 2) the nature of certain phenomena which present countries with complex and dangerous international problems, e.g. security, interdependence; 3) the particular sources, processes and outcomes involved in the foreign policies of several states including the United States, Russia and others. The approach is analytical and though some of the readings and lectures are historical, the emphasis is on the contemporary context. It is also comparative, offering students a look at how these states' domestic culture, processes and institutions affect their foreign policies. (International relations field)", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1514", "course_title": "POLITICAL STRATEGY INTERNATIONAL RELATIONS", "description": "Strategic interdependence dominates international relations - how one state behaves not only affects its own outcomes but other states' outcomes as well. Game theory has become a primary method of studying strategic interdependence. This class offers a brief primer in elementary game theory and then surveys the major formal findings in international relations, with focuses on explanations for war and design of international institutions.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1516", "course_title": "TRANSATLANTIC POLICY ANALYSIS", "description": "This new skills based course aims to provide students with crucial analytical and professional skills pertinent to the transatlantic policy world. Among them are: to read analytically and critically and to speak knowledgeably about a range of transatlantic issues that concern political scientists and policy makers, including immigration, environmental protection, social policies, and trade and economic development; and to communicate such policy analysis in a clear and persuasive manner accessible to a wide range of policy focused audiences at the international and national levels.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1519", "course_title": "GLOBAL ENERGY POLICY", "description": "This course explores energy policy and policymaking. Energy represents a crucial input for any modern society. Consider a typical day: your electric alarm wakes your up, you take a warm shower, you drink a cup of hot tea, you take the bus to school, you navigate internet, you cook a meal. None of these can be done without energy. Thus, how energy is provided, how abundant it is, how much it costs, and how clean it is all affect everybody's daily lives. This makes energy important. Yet energy is also complicated. It must be transformed from primary fuels that are geographically concentrated, require modern technology, and can have all kinds of side effects on our lives. This makes energy a highly contention political problem. This course thus investigates the nuances of energy policy, from the very local to the global. We will examine everything from oil to renewable energy and try to understand how and why politics matters.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1534", "course_title": "CIVIL WARS", "description": "This course explores why peace sometimes lasts a long time and sometimes falls apart quickly after Civil Wars. We will examine how the international community deals with civil conflicts and what can be done to ensure a long-lasting peace in war-torn countries. Emphasis will be placed on the factors that increase the durability of peace and aid the establishment of long-term prospects for reconciliation to rebuild societies after wars. Students will gain knowledge of theories that explain whether and how peacekeeping forces, agreement design, power-sharing institutions, mediation, foreign aid, and post-war elections help domestic belligerents reach and keep peace.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1536", "course_title": "HUMAN SECURITY", "description": "This is a topics course in international relations focusing on the politics of human security. The politics of human security is an area of evolving interest within the field of international relations. Currently, few political science departments offer courses on the topic and there is little agreement on what should be included in such a course. The general consensus is that 'human security' differs from 'national security' in that the latter is concerned with the well-being of the state, while the former is concerned with the well-being of individuals. In this course, we will focus on how violence, political oppression, poverty, and ecological destruction threaten individual welfare and what the international community is (and is not) doing to address these concerns.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1555", "course_title": "GLOBAL STUDIES MINI COURSE", "description": "This mini course will be offered in Fall and Spring terms. The basic descriptions differ in each term and can be found below. Additionally, specific information will be added to the Notes section as it becomes available and edited by individual events and instructors each term. Fall Terms: Global Health: This course engages the interdisciplinary nature of global health by approaching the issue through the lens of the Sustainable Development Goals (SDG) developed by the United Nations. With an applied focus, the course will assist students in engaging and advocating for a community on a global health issue through a policy memo. For more information see the Global Studies web site or contact global@pitt.edu. Spring Terms: Cities in Transformation: This course views cities as hubs where patterns, connections, discussions, and the processes shape such issues as social justice, economic development, technology, migration, the environment among others. By examining cities as a lens, this course encourages students to examine cities as a system for discussing social processes being built and rebuilt. For more information see the Global Studies web site or contact global@pitt.edu.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1556", "course_title": "GLOBAL STUDIES POP-UP COURSE", "description": "\"In conjunction with its semester-long series on the global legacies of 1989, the University Center for International Studies is pleased to offer students the opportunity to enroll in this 1-credit pop-up course that tracks the series. 1989 changed everything. It opened the door to German re-unification, the European Union, the enlargement of NATO, globalization, two decades of U.S. superpower status, political realignments in Latin America and Africa, and the rise of Asia. This series will explore the impact and global legacies of the Cold War thirty years after the Iron Curtain fell. Students who enroll will attend at least 10 events, one of which must be the concluding roundtable on December 5. In addition, they will write three short reflection essays.\"", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1581", "course_title": "CAPSTONE SEMINAR IN INTERNATIONAL RELATIONS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1614", "course_title": "THEORIES OF JUSTICE", "description": "This course addresses the key intersection between two important topics in contemporary political theory: justice and globalization. The first half of the course will cover the highly influential works of John Rails as well as reactions from Robert Nozick, Onora O'Neill, and Susan Moller Okin. The second half of the course will weave in the issue of globalization to questions of justice 'again using rails' work and various respondents as a vehicle for doing so. The course ends with a significant applied project on the intersection of globalization and justice that will challenge students to consider the current state of justice in a particular global case of their choosing.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1692", "course_title": "DEMOCRATIC THEORY-ANALYSIS", "description": "Democracy is a centrally important concept in political science. Those who wish to study almost any aspect of politics ' from election campaigns to domestic policy processes to international relations ' will, at some point, be expected to articulate a theory of democracy. Even those who study authoritarian regimes often use democratic regimes as counterpoint examples. In short, a well-rounded political scientist must know something about both democratic institutions and democratic theory. This course aims to provide students with an appreciation of the varieties of democratic thought, a knowledge of the great debates in the field, and a sense of how democratic ideals have been approximated in institutional forms. This class will include a significant training in a specific analysis method or methods to complement the course topic, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1693", "course_title": "POLITICAL THEORY & THE FUTURE-ANALYSIS", "description": "Political Science has been effective at charting the patterns of the past and diagnosing concerns of the present, but consideration of the future is a different matter. This course deals with how to conduct \"future-regarding\" inquiry effectively, and seeks to train students in this analytical method of approaching a variety of topics that will be critical areas of political life and change in the future. The course covers why the future is difficult for political institutions and political thinkers to deal with and what attempts to effectively regard the future do exist. Automation, the nature of war, relations between generations, climate change, privacy, and many more topics will be covered in the process of learning to be more \"future-regarding\". This class focuses on significant training in a specific analysis method or methods to complement the study of Political Theory, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1910", "course_title": "INSTITUTE OF POLITICS INTERNSHIP/SEMINAR", "description": "Students selected for the institute of politics internship will register for this course for the experiential component of their internships. The purpose of the internship experience is to provide the student with direct exposure to the process of public decision-making. Each student will spend nine hours a week working with an individual or office directly involved in the policy making process. Students will be given specific responsibilities and will be expected to be an active and integral part of the office in which they are placed. The details and terms of each placement will be carefully worked out and agreed upon by the student, the placement supervisor and the placement sponsor. Utmost care will be taken to insure that the student is placed in a situation that will maximize his/her exposure to all office activities and that the student is not left unsupervised and uninvolved. Students from all disciplines may apply, but preference will be given to students in their junior and senior years. Students must report to their placement for at least nine hours a week and fulfill any agreed upon responsibilities. Students will also be required to keep a written journal which describes and analyzes their internship experience", "completed": false, "prereq_count": 0}], "links": [{"source": "0200", "target": "1281"}, {"source": "0300", "target": "1381"}, {"source": "0500", "target": "1581"}]}