{"nodes": [{"dept_code": "DENHYG", "id": "1110", "course_title": "BIOLOGICAL SCIENCES 1", "description": "This introductory level course is the first of 3 sequential courses in the biological sciences, each of which represents an interdepartmental integration of gross and neuroanatomy, histology and physiology. Through lectures and assigned readings, students will gain insight into structure-function relationships of cells, tissues, organs, and organ systems of the body. This course deals with the cell, epithelium, connective tissue, the skeletal system, myology, blood, the lymphatic system, neural histology, and introductory neural physiology.", "completed": false}, {"dept_code": "DENHYG", "id": "1112", "course_title": "INTRODUCTION TO DENTAL HYGIENE", "description": "This course is designed to introduce dental hygiene students to the techniques and information necessary for comprehensive patient care.", "completed": false}, {"dept_code": "DENHYG", "id": "1113", "course_title": "INTRODUCTION TO DENTISTRY", "description": "This course provides an overview of the activities of each dental specialty; also, it may include oral anatomy, dental materials and dental charting. The lectures introduce the student to the content and scope of each specialty area; the services delivered with emphasis on dental hygiene interaction.", "completed": false}, {"dept_code": "DENHYG", "id": "1114", "course_title": "DENTAL ANATOMY", "description": "This course is designed to help students identify the normal structures with the oral cavity. The use of correct terminology is stressed in order to effectively communicate with members of the dental profession. The student will be able to differentiate normal formation of teeth from abnormalities.", "completed": false}, {"dept_code": "DENHYG", "id": "1116", "course_title": "DENTAL HYGIENE PRECLINIC", "description": "Dental hygiene preclinic is established as the preclinical time for students to observe, discuss, and practice the skills required to perform the oral prophylaxis. Each student works and progresses at his/her own rate and must demonstrate consistent mastery of the skills taught.", "completed": false}, {"dept_code": "DENHYG", "id": "1117", "course_title": "CHEMISTRY, BIOCHEMISTRY AND NUTRITION", "description": "The course is designed to give the students the fundamental principles and concepts of chemistry, biochemistry and nutrition as they are related to physiological and pathological aspects of oral health and the practice of dental medicine. The course is not designed to make the student an expert in chemistry, biochemistry and nutrition but rather to provide the basic principles of these sciences which will enable the student to more effectively manage oral disease.", "completed": false}, {"dept_code": "DENHYG", "id": "1370", "course_title": "INTRODUCTION TO CLINICAL PERIODONTICS", "description": "This course concerns the healthy periodontium, changes with aging, and changes to disease. Classification of periodontal diseases, etiology, histopathology and prevention are discussed. This course teaches the student the role of the hygienist in clinical management, treatment and control of periodontal disease.", "completed": false}, {"dept_code": "DENHYG", "id": "1373", "course_title": "BIOLOGICAL SCIENCES 3", "description": "This introductory level course is the third of three sequential courses in the biological sciences, each of which represents an interdepartmental integration of gross and neuroanatomy, histology, and physiology. Through lectures and assigned readings, students will gain insight into structure-function relationships of cells, tissues, organs and organ systems of the body. This course deals with the gross anatomy, histology, and physiology of the respiratory, digestive, urinary, and endocrine systems. Wound healing is covered.", "completed": false}, {"dept_code": "DENHYG", "id": "1375", "course_title": "ANESTHESIA FOR DENTAL HYGIENIST", "description": "This course introduces the student to the entire spectrum of pain and anxiety control techniques currently in use in dentistry. Emphasis is placed on the basic physiology of the pain phenomena and the relevant clinical pharmacology of local anesthetics. The general topic of preoperative patient assessment is integrated with a practical and systematic approach to the recognition, management, and prevention of specific medical emergencies that may occur in a dental office.", "completed": false}, {"dept_code": "DENHYG", "id": "1411", "course_title": "DENTAL PHARMACOLOGY", "description": "This course provides oral hygiene students with the opportunity to become familiar with pharmacotherapeutics as utilized by all health professionals. All drug groups are considered in order to familiarize students with the dental patient's therapeutic status. The therapeutics and adverse effects of the drugs are discussed.", "completed": false}, {"dept_code": "DENHYG", "id": "1412", "course_title": "PUBLIC HEALTH DENTISTRY", "description": "Public health dentistry is that portion of the dental hygiene curriculum which prepares students to promote oral health and prevent oral disease in the community through organized community based programs. It provides students with a broad understanding of the social, political, and economic forces directing the system. The approach taken within this course provides students with knowledge and skills necessary to meet specific dental health needs of community groups as distinct from the traditional clinical approach which is designed to meet the needs of individuals.", "completed": false}, {"dept_code": "DENHYG", "id": "1417", "course_title": "DENTAL HYGIENE SEMINAR 3", "description": "This course is designed to compliment the dental hygiene 3 clinical experience. Students will be exposed to various traditional and non-traditional dental therapeutic techniques including, but not limited to subgingival irrigation with antimicrobial agents, an update of new dental products and devices as well as the presentation of case studies for analyses. The goal of the course is to enhance the clinical and didactic skills of the dental hygienist.", "completed": false}, {"dept_code": "DENHYG", "id": "1419", "course_title": "DENTAL HYGIENE CLINIC 3", "description": "This course provides clinical sessions in which the student's integrate and apply knowledge and concepts learned in previous courses to provide comprehensive dental hygiene care to individual patients.", "completed": false}, {"dept_code": "DENHYG", "id": "1420", "course_title": "ETHICS HEALTH CARE PROFESSIONAL", "description": "This course is designed to introduce health-care professionals to the principles of ethics. Various aspects of ethics will be discussed including the decision making process on which evaluation is based.", "completed": false}, {"dept_code": "DENHYG", "id": "1421", "course_title": "SPECIAL NEEDS DENTISTRY", "description": "The goals of this course are to introduce the dental/dental hygiene student to common developmental and acquired disabling conditions and issues related to the dental care of patients with special needs. The material presented will aid the student in assessing, planning, implementing and monitoring treatment for the patient with special needs.", "completed": false}, {"dept_code": "DENHYG", "id": "1422", "course_title": "HEALTH PROMOTIONS THROUGH THE LIFE SPAN", "description": "This course will examine common health issues found throughout the human lifespan with the intention of helping students gain a holistic perspective of the clinical patient experience. The course content is designed to provide the student with relevant issues affecting the various physical stages of the human life cycle, with special emphasis on the most under-served populations of pediatrics and geriatrics. The content will be developed using the following themes: biological, psychological, social, environmental, and medical aspects of different age populations and their relationship to dental hygiene care. While there are not specific prerequisites for this course, it is recommended that enrolled students have successfully completed 45 college credits prior to course enrollment. Students not within the Dental Hygiene Program must obtain permission from the course instructor to enroll. Hybrid course format including weekly online synchronous course meetings.", "completed": false}, {"dept_code": "DENHYG", "id": "1901", "course_title": "ALLIED HEALTH EDUCATION", "description": "His course provides the student with knowledge and experience in classroom and clinical dental education. Emphasis is placed on the development of objectives and instructional units, teaching methods, learner characteristics, learning styles and conditions, instructional resources, utilization of media, and the evaluation process.", "completed": false}, {"dept_code": "DENHYG", "id": "1915", "course_title": "INTRODUCTION TO PEER TUTORING IN DENTAL HYGIENE EDUCATION", "description": "This selective course will allow participants to develop the skills necessary to provide peer tutoring as part of the School of Dental Medicine Peer Tutoring Program. The course is open to second year dental hygiene and bachelor's degree completion students. The course is the first of two consecutive courses to fulfill credits towards the B.S. Degree Completion Program in Dental Hygiene and is highly recommended for those pursuing the education track.", "completed": false}, {"dept_code": "DENHYG", "id": "1921", "course_title": "HEALTH MANAGEMENT SEMINAR", "description": "This seminar course is designed to provide the student with a broad based understanding of the health care delivery system. Emphasis will focus on leadership, management, quality assurance, development of dental health programs, and current health care delivery issues.", "completed": false}], "links": []}