{"nodes": [{"dept_code": "AFROTC", "id": "0001", "course_title": "HERITAGE AND VALUES OF UNITED STATES AIR FORCE 1", "description": "AS 100, \"Heritage and Values of the United States Air Force,\" is a survey course designed to introduce students to the United States Air Force and provides an overview of the basic characteristics, missions, and organization of the air force.", "completed": false}, {"dept_code": "AFROTC", "id": "0003", "course_title": "EVOLUTION OF AIR AND SPACE POWER", "description": "As200 course designed to examine general aspects of air & space power, through historical perspective. Course covers time period from the first balloons & dirigibles to space age global positioning systems of the Persian Gulf War. Historical examples provided to extrapolate development of a capabilities & missions to demonstrate evolution of what has become today's USAF Air & Space Power. Course provides cadets with knowledge level understanding of air & space power from an institutional doctrinal & historical perspective. LLAB mandatory for AFROTC Cadets & complements course.", "completed": false}, {"dept_code": "AFROTC", "id": "0005", "course_title": "FRESHMAN LEADERSHIP LAB", "description": "The as100 and as200 leadership laboratory courses (LLABS) include a study of air force customs and courtesies, drills and ceremonies, and military commands. The LLAB also includes studying the environment of an air force officer and learning about areas of opportunity available to commissioned officers.", "completed": false}, {"dept_code": "AFROTC", "id": "0006", "course_title": "SOPHOMORE LEADERSHIP LAB", "description": "The as100 and as200 leadership laboratory courses (LLAB) include a study of air force customs and courtesies, drill and ceremonies, and military commands. The LLAB also includes studying the environment of an air force officer and learning about areas of opportunity available to commissioned officers.", "completed": false}, {"dept_code": "AFROTC", "id": "0007", "course_title": "TEAM AND LEADERSHIP 1", "description": "Focuses on laying the foundation for teams and leadership. The topics include skills that will allow cadets to improve their leadership on a personal level and within a team. The courses will prepare cadets for their field training experience where they will be able to put the concepts learned into practice. The purpose is to instill a leadership mindset and to motivate sophomore students to transition from AFROTC cadet to AFROTC officer candidate.", "completed": false}, {"dept_code": "AFROTC", "id": "1005", "course_title": "JUNIOR LEADERSHIP LAB", "description": "The as300 and as400 LLABS consist of activities classified as leadership and management experiences. They involve the planning and controlling of military activities of the cadet corps, and the preparation of briefings and other oral and written communications. LLABS also include interviews, guidance, and information which will increase the understanding, motivation, and performance of other cadets.", "completed": false}, {"dept_code": "AFROTC", "id": "1006", "course_title": "SENIOR LEADERSHIP LAB", "description": "The as300 and as400 LLABS consist of activities classified as leadership and management experiences. They involve the planning and controlling of military activities of the cadet corps, and the preparation of briefings and other oral and written communications. LLABS also include interviews, guidance, and information which will increase the understanding, motivation, and performance of other cadets.", "completed": false}, {"dept_code": "AFROTC", "id": "1013", "course_title": "LEADING PEOPLE AND EFFECTIVE COMMUNICATION 1", "description": "AS 300, \"LEADING PEOPLE AND EFFECTIVE COMMUNICATION,\" teaches cadets advanced skills and knowledge in management and leadership. Special emphasis is placed on enhancing leadership skills and communication. Cadets have an opportunity to try out these leadership and management techniques in a supervised environment as juniors and seniors.", "completed": false}, {"dept_code": "AFROTC", "id": "1015", "course_title": "NATIONAL SECURITY AFFAIRS/PREPARATION FOR ACTIVE DUTY", "description": "AS 400, \"NATIONAL SECURITY AFFAIRS/PREPARATION FOR ACTIVE DUTY,\" is designed for college seniors and gives them the foundation to understand their role as military officers in American society. It is an overview of the complex social and political issues facing the military profession and requires a measure of sophistication commensurate with the senior college level. The final semester provides information that will prepare the cadets for active duty.", "completed": false}], "links": []}