{"nodes": [{"dept_code": "EFOP", "id": "1001", "course_title": "SOCIAL FOUNDATIONS OF EDUCATION", "description": "Students in the course have the opportunity to develop a foundational understanding of the dynamics of schooling in society by addressing the cultural aspects that underlie society's educational ideas and practices. Through an interdisciplinary approach, readings and activities are designed for school practitioners, or those contemplating careers in education, to engage in the study of those cultural aspects and consequences. The general intent of foundational study is to introduce students to interpretive uses of knowledge Germane to education and to establish a basis for lifelong learning through normative and critical reflection on education within its historical philosophical, cultural and social contexts. Special emphasis is focused on the role of schooling in cultivating the habits necessary for democratic citizenship which include ongoing efforts to secure equitable and just social relations, and to advance the common good.", "completed": false}, {"dept_code": "EFOP", "id": "1359", "course_title": "GENDER, EDUCATION, AND INTERNATIONAL DEVELOPMENT", "description": "In this course, we look at gendered dimensions of education and development in international contexts. We look cross-culturally, across space, and across \"development\" continua and paradigms. We examine gendered issues through three modules that represent diverse levels of educational practice - basic education, higher education, and non-formal and informal education. In order to provide focus in this rich and complex field, we hone in on key policy orientations that build sequentially, starting with the most fundamental issues of access and equity, continuing with capacity building, and extending to sustainability and creating social change. Since this class is feminist by design, we explicitly link policy with agency, theory with advocacy, and reflection with action. Each course section also contains a strand on advocacy and action, through which students are able to create a synthesis of module lessons through a personal, analytical standpoint piece.", "completed": false}], "links": []}