{"nodes": [{"dept_code": "ECE", "id": "0101", "course_title": "LINEAR CIRCUITS AND SYSTEMS", "description": "This course covers the fundamentals of linear electric circuit analysis used throughout the electrical and computer engineering curricula. Students learn basic concepts and terminology of electrical engineering and develop knowledge and skills to analyze, evaluate, and design electrical circuits in class and in an accompanying laboratory where they build prototyping and analysis skills using modern test equipment. Primary topics include electric variables and circuit elements, Kirchhoff's and Ohm's Laws, mesh and node equations, Thevenin and Norton equivalent circuits, first- and second-order circuits, time- and frequency-domain analyses, ideal transformers, and AC power. PREREQUISITES: PHYS 0175 and ENGR 0012 or ENGR 0016 COREQUISITE: ECE 0401", "completed": false}, {"dept_code": "ECE", "id": "0111", "course_title": "LINEAR CIRCUITS TRANSFER LAB", "description": "Linear Circuits Transfer Lab", "completed": false}, {"dept_code": "ECE", "id": "0201", "course_title": "DIGITAL CIRCUITS AND SYSTEMS", "description": "In this course, students study the fundamental building blocks used in the design of modern digital electronics and computers. Students learn how to use and combine digital components to create circuits that perform fundamental computing tasks such as arithmetic and storage of information. Primary topics covered include Boolean algebra and binary arithmetic, combinational and sequential logic circuits, Finite-State Machine (FSM), Hardware Design Language (HDL), and Register Transfer Level (RTL) for digital design. Students extend their knowledge to practice by way of hands-on laboratory exercises where various software and hardware tools are used to design and test solutions for real-world applications. After completing this course, students understand the design of digital computing systems at their most fundamental level and are able to craft such systems using modern tools and techniques.", "completed": false}, {"dept_code": "ECE", "id": "0211", "course_title": "DIGITAL CIRCUITS AND SYSTEMS CREDIT LAB", "description": "Digital Circuits and Systems Credit lab for transfer students. Associated with ECE 0201.", "completed": false}, {"dept_code": "ECE", "id": "0301", "course_title": "ECE PROBLEM SOLVING WITH C++", "description": "This course covers fundamental concepts and techniques in software design for solving problems in electrical and computer engineering (ECE) using C++. Students learn procedural and object-oriented program development, as well as basic control structures, data structures, and algorithms. Students apply these skills in crafting and testing structured programs to solve problems of interest in ECE, such as linear circuits and systems, digital circuits and systems, and linear algebra and differential equations, through assignments that are tied to concepts covered in these other core sophomore courses of ECE.", "completed": false}, {"dept_code": "ECE", "id": "0401", "course_title": "ECE ANALYTICAL METHODS", "description": "This course provides the fundamental mathematical background to solve problems in electrical and computer engineering (ECE). The main objective is to cover topics from calculus, linear algebra, differential equations, and complex analysis most relevant to electrical and computer engineering. Primary topics include matrices, vectors, systems of equations, determinants, double integrals, first- and second-order ordinary differential equations, complex numbers, Eulers identity, phasor analysis, signal waveforms, Laplace transform, transfer functions, frequency response, and an introduction to the Fourier transform. Students also learn to solve mathematical problems based upon these topics, both analytically and using the MATLAB programming environment.", "completed": false}, {"dept_code": "ECE", "id": "1110", "course_title": "COMPUTER ORGANIZATION AND ARCHITECTURE", "description": "This course provides a detailed introduction into the basics of computer design common to most computer architectures including topics of digital computer data representation, arithmetic and logic units, instruction formats, control, microprocessor architecture, and memory systems. This course includes a heavy focus on assembly language and its interaction with a RISC computer architecture.", "completed": false}, {"dept_code": "ECE", "id": "1140", "course_title": "SYSTEMS AND PROJECT ENGINEERING", "description": "This course covers system and software engineering processes, tools, and common practices through lectures and labs. Both the waterfall model and agile methods, specifically Extreme Programming and Scrum, are presented and used in developing a term-long group project. Students experience firsthand each of the concepts covered throughout the term by specifying, designing, and building an integrated working hardware/software system with equal contribution from each of the 5 or 6 team members. During the group project, full lifecycle documentation is created, UML is used for designing the system and a fully working system is developed, tested, and publicly presented. During the course students will use an IDE, UML, code repository, defect tracking, testing, scheduling, and documentation tools.", "completed": false}, {"dept_code": "ECE", "id": "1145", "course_title": "SOFTWARE CONSTRUCTION AND EVOLUTION", "description": "In this course, students will learn about software engineering principles related to software construction, maintenance, and evolution, focusing on standards and techniques for developing maintainable, flexible software. Topics covered include: version control and branching, test-driven development, design patterns, coding standards and documentation, exception handling, refactoring, and code review. Students will apply knowledge of these topics in assignments, peer code reviews, and a course project with multiple iterations.", "completed": false}, {"dept_code": "ECE", "id": "1150", "course_title": "COMPUTER NETWORKS", "description": "The course covers a theoretical understanding of technology involving, as well as problem solving skills for, interconnected devices where potential methods of interconnection are fundamental to the system design. Fundamentals related to wireless network systems and networks of computers or embedded digital devices, especially the lower levels of the stack, are emphasized. Coverage includes data link protocols, medium access control, addressing, routing, and transport protocols.", "completed": false}, {"dept_code": "ECE", "id": "1175", "course_title": "EMBEDDED SYSTEMS DESIGN", "description": "This course introduces the fundamental challenges, methodologies, and techniques for designing different components of embedded computing systems, including microprocessors, I/O, memory and caches, and external sensors and actuators. Various system design issues including power management, real-time operating system design and system scheduling will also be discussed. Laboratory activities provide the students with the opportunities of gaining hands-on project experiences with modern embedded and mobile computing platforms such as microcontrollers, smartphones, sensors and wearables, as well as practicing these programming platforms over real-world embedded computing applications.", "completed": false}, {"dept_code": "ECE", "id": "1192", "course_title": "INTRODUCTION TO VLSI DESIGN", "description": "Understand basic concepts and introductory techniques of modern integrated digital circuit design using Complementary Metal-Oxide-Semiconductor (CMOS) transistors. Learn how to design/simulate essential CMOS circuits for digital Very Large Scale Integration (VLSI) designs using state-of-the-art Computer Aided Design (CAD) tools.", "completed": false}, {"dept_code": "ECE", "id": "1195", "course_title": "ADVANCED DIGITAL DESIGN", "description": "This course is designed to teach both the theoretical and practical considerations in the design of computing systems. It introduces the students to modern computer aided design (CAD) tools, languages, and techniques. The student is exposed to a variety of design experiences that complement their knowledge of digital circuits and microprocessors. Students will complete a series of laboratory assignments and learn how to implement large-scale, complex digital systems with commercial CAD tools. Designs will be prototyped using Field Programmable Gate Arrays (FPGA) and verified using electronic test equipment.", "completed": false}, {"dept_code": "ECE", "id": "1212", "course_title": "ELECTRONIC CIRCUIT DESIGN LAB", "description": "An electronic circuits laboratory experience with emphasis on circuit applications and design. Topics include: multi stage amplifier design; operational amplifier applications; analog-digital conversion applications, active filters.", "completed": false}, {"dept_code": "ECE", "id": "1238", "course_title": "DIGITAL ELECTRONICS", "description": "Switching behavior of semiconductor devices; logic circuit families; DTL, TTL, Schottky, Ecl, CMOS, i2l; regenerative logic circuits; semiconductor memories; spice circuit simulation.", "completed": false}, {"dept_code": "ECE", "id": "1247", "course_title": "SEMICONDUCTOR DEVICE THEORY", "description": "Electrical properties of solids, energy levels, semiconductor theory, diodes, bipolar junction transistors, field effect transistors.", "completed": false}, {"dept_code": "ECE", "id": "1250", "course_title": "NANOTECHNOLOGY & NANO-ENGINEERING", "description": "The course introduces nanoscale devices created from a range of nanomaterials including carbon nanotubes (CNTS), nanoparticles (NPS), and nanowires (NWS). Theories of operation, fabrication techniques and applications of Nano devices will be discussed. The course combines lecture, laboratory work, and web-supported project-based learning.", "completed": false}, {"dept_code": "ECE", "id": "1266", "course_title": "APPLICATIONS OF FIELDS AND WAVES", "description": "Plane waves, the wave equation, poynting vector, transmission lines, wave guides, antennas and radiation applications.", "completed": false}, {"dept_code": "ECE", "id": "1286", "course_title": "ANAL & DSGN ANLG INTGRTD CRCT", "description": "Introduction to spice. Multiple transistor circuits, internal structure of operational amplifiers. Current sources and current steering circuits, active loads. Frequency response of directly coupled, capacitive coupled and tuned amplifiers. Analysis and design of multistage amplifiers. Feedback and frequency compensation in operational amplifiers.", "completed": false}, {"dept_code": "ECE", "id": "1390", "course_title": "INTRO TO IMAGE PROCESSING", "description": "Introductory subjects in image processing include image spaces and image representation, image enhancement, edge detection, edge and region based segmentation, and feature extraction and object recognition. Spatial and frequency domain approaches will be addressed with emphasis on spatial domain approaches. Some problems are solved on the computer in the c programming language.", "completed": false}, {"dept_code": "ECE", "id": "1395", "course_title": "INTRODUCTION TO MACHINE LEARNING", "description": "Machine Learning methods are at the core of many recent advances in \"intelligent computing\". Current applications include machine perception (vision, speech recognition), control (process control, robotics), data mining, time-series prediction (e.g. in finance), natural language processing, text mining and text classification, bio-informatics, neural modeling, computational models of biological processes, and many other areas. This is an introductory undergraduate course on machine learning and its applications in different areas. The course will briefly cover techniques for visualizing and analyzing multi-dimensional data along with algorithms for projection, dimensionality reduction, regression, clustering, classification and neural networks, and deep learning. A main course objective is to present various approaches to classifier design so that students can make judicious choices when confronted with real pattern recognition problems. However, it is important to emphasize that the design of a complete pattern recognition system for a specific application domain requires domain knowledge, which is beyond the scope of this course. Students will use available tools and libraries to implement some algorithms using MATLAB.", "completed": false}, {"dept_code": "ECE", "id": "1472", "course_title": "ANALOG COMMUNICATION SYSTEMS", "description": "Analysis of modern analog communication systems, including the theory underlying their design and practical implementation issues. Various forms of amplitude and angle modulation. Amplifiers, mixers, detectors, phase-lock loops, and the design of transmitters and receivers. Probability, random signals, optimal receivers, noise and performance analysis. Case studies including telephone, commercial radio, and television.", "completed": false}, {"dept_code": "ECE", "id": "1560", "course_title": "DIGITAL SIGNAL PROCESSING", "description": "This course provides students with theoretical background and practical experience in data acquisition and digital signal processing related to computer-based measurements. The course addresses the representation, analysis, and design of discrete time signals and systems. Topics covered include implementation of discrete systems, discrete-time Fourier analysis and the FFT algorithm, analysis of discrete systems in terms of poles and zeros, and design of infinite and finite impulse response filters.", "completed": false}, {"dept_code": "ECE", "id": "1674", "course_title": "MECHATRONIC SYSTEMS", "description": "This course covers Mechatronic system design providing an understanding of each of the basic engineering disciplines and their interactions involved: controls (control laws, analytic tools and error budgets), mechanical systems (motors, bearings, ballscrews, gears etc.), electrical systems (controllers, power amplifiers, sensors, cable management), and software engineering (embedded computing & PLCs). This course will emphasize designing mechatronic systems from a control system perspective.", "completed": false}, {"dept_code": "ECE", "id": "1701", "course_title": "FUNDAMENTALS OF ELECTRIC POWER ENGINEERING", "description": "This is a first course in electric power engineering for electrical and computer engineers. The course provides the fundamental background to solve some common problems in electric power engineering, and to design power systems using engineering assumptions based on this background. The main objective is to cover topics in AC single phase and three phase power, transformers, transmission lines and electric machinery by integrating their knowledge of linear circuit analysis, electricity, and magnetism to these power systems topics. Students will also gain knowledge of power systems simulation using the PowerWorld simulator. This course will provide the prerequisite knowledge for the study of load flow, symmetrical components, and fault analysis which will be covered in a later course.", "completed": false}, {"dept_code": "ECE", "id": "1770", "course_title": "SPECIAL TOPICS: ELECTRONIC MICROPROCESSOR SYSTEMS", "description": "An undergraduate course dealing with special topics of current interest in power.", "completed": false}, {"dept_code": "ECE", "id": "1771", "course_title": "ELECTRIC MACHINERY", "description": "Application of magnetostatics to the design of magnetic circuits, actuators, sensors and rotating electric machines. Performance characteristics of transformers, induction machines, synchronous machines and DC machines. Includes a laboratory.", "completed": false}, {"dept_code": "ECE", "id": "1776", "course_title": "MICROGRID CONCEPTS & DISTRIBUTED GENERATION TECHNOLOGIES", "description": "This course describes fundamental concepts related with the development of microgrids and the integration of distributed generation. Technical topics are divided into three modules. The first module introduces microgrid components and discusses the main types of microsources. The second focuses on energy storage technologies. The third includes system integration topics, such as power electronics interfaces; dc and ac architectures,; economics, operation, stabilization, and control; reliability aspects; grid interconnection, and microgrids as part of the \"smart\" grids. This course also aims at preparing students to conduct research or helping them improve their research skills.", "completed": false}, {"dept_code": "ECE", "id": "1885", "course_title": "DEPARTMENTAL SEMINAR", "description": "Seminars are designed to acquaint the student with aspects of engineering that are not normally encountered in classes and school activities and include a wide range of topics such as the significance of engineering as a profession, and ethical problems in engineering and skills required for a successful engineering career.", "completed": false}, {"dept_code": "ECE", "id": "1890", "course_title": "ECE PROTOTYPING FUNDAMENTALS", "description": "In this course students will learn fundamental prototyping techniques used in the design of electronic systems. This includes Printed-Circuit Board (PCB) Design, soldering, manufacturing and various other hands-on skills. The learning objective of this course is to prepare students with practical skills that are often needed in design-oriented electrical and computer engineering courses and projects.", "completed": false}, {"dept_code": "ECE", "id": "1895", "course_title": "JUNIOR DESIGN FUNDAMENTALS", "description": "This course teaches students the engineering design process. Emphasis is placed on the development of fundamental hands-on-skills commonly used in the design of modern electrical and computer engineering technologies. Students participate in a series of mock design experiences, culminating in the participation of an actual design project. After completion of this course, students will be able to design a system that meets specifications and satisfies a stakeholder's needs and requirements. Students will also learn how to create functional design prototypes and verify them.", "completed": false}, {"dept_code": "ECE", "id": "1896", "course_title": "SENIOR DESIGN PROJECT", "description": "This is a rigorous, capstone design course where students apply the analytical and synthesis skills they have developed during undergraduate coursework to the design of a working prototype. Students work in teams to identify and analyze a real problem, design a hardware/software solution, and construct, test and then evaluate the effectiveness of the prototype. The primary goal of this course is to provide students with a culminating, major design experience that incorporates engineering standards and realistic constraints, preparing them for professional engineering practice.", "completed": false}], "links": [{"source": "0201", "target": "1192"}, {"source": "0201", "target": "1238"}, {"source": "0301", "target": "1395"}, {"source": "1895", "target": "1896"}]}