{"nodes": [{"dept_code": "HIST", "id": "0010", "course_title": "PROFESSIONAL DEVELOPMENT SEMINAR", "description": "You are at a family function and one of your relatives over hears what your major is asks you \"do you know what you call a BA in history?\" Then before you can answer or walk away, he/she responds with \"waiter!\" While this is the accepted wisdom of what happens to a history, is this the reality of life after college? The answer to that is an emphatic \"no!\" Therefore, in this class you will find out why this is false. Then you will prepare for the real world by practicing and implementing the skills needed to navigate your way through the process of finding a job or going on to graduate school.", "completed": false}, {"dept_code": "HIST", "id": "0089", "course_title": "MAGIC, MEDICINE AND SCIENCE", "description": "Dietary purges, ritualistic spells, mystical transformation, and the balance of self with nature. In each of these approaches is the presence of magic. Magic is a phenomenon common to all societies. In this course, we will study how it has contributed to religion, medicine, the healing arts, and to the emergence of modern scientific thought. Also the extent to which similar systems of belief have given birth to science, religion, magic and therapeutic practice will be explored.", "completed": false}, {"dept_code": "HIST", "id": "0100", "course_title": "WESTERN CIVILIZATION 1", "description": "The study of others leads back to ourselves. We learn about men and women from the past in order to compare their experience to our own, hoping that the comparison will make us more aware of the opportunities and limitations of present-day life. As an introduction to history, this course tries to suggest the excitement and uncertainties of studying the past. We begin at the time of the crusades, and continue through Renaissance and Reformation to the eve of Industrial Revolution.", "completed": false}, {"dept_code": "HIST", "id": "0101", "course_title": "WESTERN CIVILIZATION 2", "description": "A history of the West from the Industrial Revolution to the late Twentieth Century, the period when Europe and its overseas extensions dominated world history.", "completed": false}, {"dept_code": "HIST", "id": "0125", "course_title": "RELIGIONS OF THE WEST", "description": "This course is a historical introduction to the religious traditions that developed in ancient Near East and the Mediterranean. Our major emphasis is on the history of the religious traditions that emerged in late antiquity in this area and which continue to be major world religions: Judaism, Christianity, and Islam. We will also touch on Zoroastrianism. We focus on key concepts, historical developments, and contemporary issues. Throughout the course, we also examine interactions among these religious traditions. In the last part of the course we examine the issue of globalization and the spread of these religions around the world as well as the presence of \"non-Western\" religion in the \"West.\" The course also serves as an introduction to the academic study of religion and provides a foundation for further coursework in Judaism, Christianity, and Islam. No prior knowledge of any of the religions studied is expected or assumed.", "completed": false}, {"dept_code": "HIST", "id": "0150", "course_title": "HISTORY OF MODERN IRELAND", "description": "This class will examine how Britain came to Ireland and why in the context of that period (16th and 17th centuries). It will also examine the very complex relationships between the Catholic church and the British crown in the 17th century, as these relationships played a great role in the Cromwellian era. This will lead us to the heart of the class where we will trace the very complex relationship between modern Irish republicanism and Cromwell.", "completed": false}, {"dept_code": "HIST", "id": "0187", "course_title": "WORLD WAR II-EUROPE", "description": "The causes of WW II are surveyed, including World War I, the Russian Revolution, the Great Depression, and the rise of fascist regimes. The determinants of German expansionism will be discussed and related to the outbreak of war in 1939. The military struggle receives attention, but such topics as economic mobilization, propaganda, occupation policies, resistance movements and the Holocaust are also discussed. The course concludes with an analysis of war time diplomacy, the Postwar settlement, and the onset of the Cold War.", "completed": false}, {"dept_code": "HIST", "id": "0200", "course_title": "BETWEEN KAFKA AND HITLER: HOW CENTRAL EUROPE SHAPED THE MODERN WORLD", "description": "This course offers an introduction to the historical experience of Central Europe, the most diverse and dynamic region of modern Europe. Close to twenty nations with together more than 200 million people exist today between the rivers Rhine and Dnepr, between the Baltic and the Aegean Seas, from Germany in the west to Estonia in the northeast and Greece in south. Since the 1800s, this region made its mark on the world through an astounding cultural and intellectual creativity. People like Hegel and Marx, Kafka and Freud, Albert Einstein and Marie Curie changed the way we think. Yet 20th-century Central Europe was also a place of unprecedented mass violence and destruction, the main theater of two world wars and the site of the Holocaust. During the Cold War, it became the focal point of a global ideological conflict that divided the world into east and west. Ever since the fall of the Iron Curtain, Central Europe is the place where these divided worlds are growing together again. The study of this region and the socioeconomic and cultural forces that shaped it provides a fascinating lens for a better understanding of the modern world. This includes the fact that many of those who built Pittsburgh came from Central Europe and left their mark in this city. The course serves as core course for the Central European Studies Certificate", "completed": false}, {"dept_code": "HIST", "id": "0301", "course_title": "RUSSIA TO 1917", "description": "This course analyzes the major social and economic problems of the Russian Empire from the emancipation of 1861 through the Revolution of 1917. The emphasis is on understanding the major issues that precipitate the first \"socialist\" Revolution in European history.", "completed": false}, {"dept_code": "HIST", "id": "0302", "course_title": "SOVIET RUSSIA", "description": "This course examines the history of the USSR from 1917 to the present. Particular attention is paid to the revolutionary transformation of society, the construction of the Soviet state and Soviet society, and to the ways in which state and society relate.", "completed": false}, {"dept_code": "HIST", "id": "0403", "course_title": "HISTORY OF MODERN SOUTHEAST ASIA: COLONIAL ERA TO PRESENT", "description": "This is an introductory survey course in the political and cultural history of Modern Southeast Asia from 1815 through 1978 or roughly from the growth of European colonialism within the region through the end of the Khmer Rouge regime in Cambodia. It will emphasize the expansion of European influence in the political and economic spheres, the growth of nationalism, and the process of decolonization in Southeast Asia. It will also focus on the new political and cultural forces that transformed the region over the course of the 19th and 20th centuries.", "completed": false}, {"dept_code": "HIST", "id": "0501", "course_title": "MODERN LATIN AMERICA", "description": "History of the Latin American republics from independence, in 1825, to the present.", "completed": false}, {"dept_code": "HIST", "id": "0521", "course_title": "CARIBBEAN HISTORY", "description": "Examines historical roots of modern Caribbean. Examines major historical developments from period of subjugation of indigenous population through era of slavery to rise of modern nationalism and impact of American intervention. Also analyzes related socioeconomic systems and institutions. Selected country case studies included.", "completed": false}, {"dept_code": "HIST", "id": "0601", "course_title": "UNITED STATES 1865-PRESENT", "description": "An introduction to American history from the Civil War to the present which emphasizes selected topics on changes in American society and politics as an earlier agrarian society became an industrial-urban one and as the nation took up an ever larger role in world affairs.", "completed": false}, {"dept_code": "HIST", "id": "0612", "course_title": "ORIGINS OF AMERICAN CAPITALISM", "description": "This course surveys the history of North American capitalism from the time of the first European settlements up through the emergence of a recognizably modern economy in the aftermath of the Civil War. It focuses in particular on the ways in which ordinary people made a living, how and why those ways changed over time, and what those changes in turn can tell us about the evolving structural determinants of the system as a whole.", "completed": false}, {"dept_code": "HIST", "id": "0670", "course_title": "AFRICAN AMERICAN HISTORY TO 1877", "description": "This course examines African American history and culture from its inception with the Transatlantic Slave Trade to its transformation during the Civil War. Topics discussed include the African and Native American captivity practices that served as the precursors to African chattel slavery; the origins and rationale behind the creation of the social category of \"race;\" the differences between African chattel slavery in the French, Spanish, and British colonies; the regional variances in slavery in the southern and northern United States and in Indian nations; methods of resistance used by African American women and men; and the multifaceted ways in which African Americans played a part in the abolitionist movement and in their own emancipations.", "completed": false}, {"dept_code": "HIST", "id": "0675", "course_title": "WITCHES TO WALDEN POND", "description": "A survey of American religious history from the colonial period through the civil war.", "completed": false}, {"dept_code": "HIST", "id": "0678", "course_title": "UNITED STATES AND THE HOLOCAUST", "description": "With increasing interest in the Holocaust in Europe, this course focuses on the American side of the Atlantic - on issues of anti-Semitism and anti-immigrant sentiment in this country and on America's response to the Holocaust. We will also look at some post-Holocaust issues as well.", "completed": false}, {"dept_code": "HIST", "id": "0700", "course_title": "WORLD HISTORY", "description": "This course is an introductory survey of world history, by which is meant an overview of major processes and interactions in the development of human society since the development of agriculture some 10,000 years ago. It is a selective overview, emphasizing large-scale patterns and connections in political, social, cultural, technological, and environmental history, yet it also provides balance among regions of the world. It encourages students to apply historical techniques to issues of their own interest.", "completed": false}, {"dept_code": "HIST", "id": "0707", "course_title": "SEX AND GENDER: A GLOBAL HISTORY OF THE MODERN WORLD", "description": "How do ideas of sex and sexuality change over time? Can we understand global history through the lens of sex? This course will survey topics in global history and the history of sex and sexuality from the eighteenth to the twentieth century. We will explore continuities and changes in the definitions of sex and sexualities, the science and politics of sex and reproduction, the relationships between sex, sexuality, and imperialism, the sexual construction of social and cultural differences in different nations, changing portrayals of sex and sexuality by the state and by the media, social and legal activism with regard to issues of sex and sexuality, and the value of using sex and sexuality as a historical framework for issues in social, cultural, and political history.", "completed": false}, {"dept_code": "HIST", "id": "0753", "course_title": "RISE OF ISLAM: 500-1200 CE", "description": "This course seeks to impart an understanding of the Islamic tradition by exploring the religion's formative period. It integrates two intertwined themes: (1) early Islamic empires as geopolitical formations; and (2) the development of ideas, from ritual to philosophy to law. The first centuries of Islam are fascinating for many of the same reasons they are complex and even controversial: Surviving primary sources are fragmented, partisan, and often retrospective; a tremendous range of voices competed to define the new religion; and nearly all subsequent Muslim thinkers would harken back to this period to legitimize their own positions. The central goal is to develop an understanding of the diversity of voices in this early period and consider why certain conceptualizations of religion displaced others; and then follow those voices beyond the Arabian Peninsula to examine manifestations in the North African and Central Asian borderlands.", "completed": false}, {"dept_code": "HIST", "id": "0755", "course_title": "RELIGION IN ASIA", "description": "This course serves as an introduction to the major religious traditions of South and East Asia. During the course of the semester, we encounter Hinduism and Jainism; the native Confucian, Daoist (Taoist), and popular traditions of China; and the Shinto, folk and new religions of Japan. Buddhism, which originated in India but later spread to East Asia, is examined in its relation to the history of both Chinese and Japanese religions. We approach these traditions through lectures and discussion based on Chinese classical and popular literature, secondary scholarship, and films, which inform us about cultural and historical context, beliefs, practices, and personal experience. In the process we expect to learn something about the ways in which non-Western religious traditions see themselves and their world on their own terms, and to see how/if they can complement our own worldviews.", "completed": false}, {"dept_code": "HIST", "id": "0760", "course_title": "INTRODUCTION TO PUBLIC HISTORY", "description": "The course will introduce students to the theory, methodology, and practice of Public History. Public History is the employment of professional historical methods by public and private agencies to engage communities in shaping the presentation of the past into usable histories. Through the course, students will be able to analyze how Public historians and the Public collaborate to explain individual and collective human behavior through a variety of methods, mediums, and contexts. Moreover, students will learn how Public Historians and the Public create and express historical meaning for their local, state, national, and global communities.", "completed": false}, {"dept_code": "HIST", "id": "0795", "course_title": "HISTORY OF AFRICA BEFORE 1800", "description": "Surveys history of Africa from earliest times to eve of European civilization. Looks at Africa from the inside out and aims at promoting an appreciation of Africa's contribution to world civilization and an understanding of the historical processes that have shaped modern Africa. Major themes and topics include ancient kingdoms, Islam the slave trade and the European contact.", "completed": false}, {"dept_code": "HIST", "id": "1000", "course_title": "CAPSTONE SEMINAR", "description": "This course seeks to acquaint history majors with proper techniques of historical research and writing.", "completed": false}, {"dept_code": "HIST", "id": "1001", "course_title": "INTRODUCTORY SEMINAR", "description": "This course introduces its students to the ways historians work. Either by focusing on various interpretations of a common event or series of events, or by looking at historiographical literature in general, the course demonstrates the diversity of historical interpretation.", "completed": false}, {"dept_code": "HIST", "id": "1030", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}, {"dept_code": "HIST", "id": "1046", "course_title": "NATIONALISM", "description": "Theories of nationalism, ethnicity, and race are examined and are contrasted with theories of modernization and socialism. Particular emphasis is placed on ethnonationalism in developed Western countries, such as Britain, France, Spain, Belgium, and Canada, and on ethnic politics in the U.S. Comparisons are drawn with nationalism in other types of political systems, particularly the USSR, Yugoslavia, and selected Middle East and African countries.", "completed": false}, {"dept_code": "HIST", "id": "1083", "course_title": "HISTORY OF SPORTS", "description": "The course will survey the history of sports, focusing primarily on the 20th century. We will balance consideration of professional sports with that of the games the people play. We will look both at the impact of television as well as the new fitness (revolution). Topics considered will include women in sports, the commercialization of culture and collegiate sports. A major focus will be the role in sports in Pittsburgh in the past 50 years.", "completed": false}, {"dept_code": "HIST", "id": "1084", "course_title": "FOOD AND HISTORY", "description": "The subject of food production, preparation, and consumption is examined from a variety of disciplinary perspectives in this reading seminar. The course contrasts pre-industrial and modern diets and food systems.", "completed": false}, {"dept_code": "HIST", "id": "1124", "course_title": "NORTHERN IRELAND: THE TROUBLES - 1969-1994", "description": "Ex-republicans and loyalists: \"you've been in Belfast for 2 weeks. Do you understand the conflict any better now?\" Pitt students: \"no. We are more confused now than when we arrived.\" Ex-prisoners: \"good! You've learned something.\" Contradictory? Confusing? Confusing? All of the above? If you say, \"\"all of the above\" then you will find this class \"intriguing.\" You will move beyond the \"inherited histories\" concerning the conflict in Ireland and investigate the roots of the Irish conflict. By the end, you will come to realize that history is rarely black and white and that there are many \"truths\" and shades of grey.", "completed": false}, {"dept_code": "HIST", "id": "1126", "course_title": "FRENCH REVOLUTION", "description": "This course will consider various theories of the social sources of revolutions and evaluate them in the light of historical research.", "completed": false}, {"dept_code": "HIST", "id": "1132", "course_title": "GERMANY IN THE COLD WAR", "description": "This course examines the history of Germany from World War I to the present by studying German history in its international context. Students will learn to distinguish between political, social, economic and cultural trends that were specific to Germany from those that were common throughout Europe and beyond. Topics include WWI's impact on European societies, the economic and political crisis of the interwar years and the explosion of creativity, the establishment of the Nazi State, WWII as turning point of European and global history, Germany's Cold War division and the unexpected reunification of 1990, as well as European integration as the game-changing innovation of the postwar years.", "completed": false}, {"dept_code": "HIST", "id": "1197", "course_title": "BLACK DEATH: PLAGUE AND HISTORY", "description": "The Black Death, the great epidemic of 1347-1350's was the most profound epidemiological-ecological crisis Europe had ever experienced. Between 30 and 70% of the population of the western world vanished. In the wake of this demographic disaster economic, psychological, social, literary and even artistic processes were profoundly altered. This epidemic can be traced through extensive primary sources ranging from literature to art history - from population statistics through village desertions. This course will introduce these data and examine the consequences of the Black Death.", "completed": false}, {"dept_code": "HIST", "id": "1315", "course_title": "STALIN", "description": "This course examines the USSR during Stalin's reign, 1929-53. Each facet of his reign--industrial development, collectivization, class war, and repression--receive detailed attention as does WWII and the Cold War.", "completed": false}, {"dept_code": "HIST", "id": "1426", "course_title": "MODERN TAIWAN 1500-1980", "description": "This course teaches students about the social, cultural and economic factors that have shaped modern Taiwan, a critically important nation in the development of globalization in Asia.", "completed": false}, {"dept_code": "HIST", "id": "1446", "course_title": "EAST ASIAN POLITICAL ECONOMY, 1950-PRESENT", "description": "This upper-level course compares the political, economic, and social development of East Asian societies over the past three generations, with a focus on Japan, South Korea, and greater China. It focuses on the political circumstances that have taken each country down the path it has taken, and how these paths now shape the future prospects of each country as well as of East Asia as a region. The first half of the course will focus on country-specific historical studies, tracing the development path each country has taken in the post-war period. Some common themes repeat themselves in each of the country case studies: the role of the state, the interaction between domestic and international factors, the relationship between bureaucrats and politicians, and the development of various institutions. Other topics and readings highlight national specificities, revealing unique circumstances that differentiate the experiences of one country form another. The second half of the course will focus on common themes and contemporary challenges shared by countries in East Asia including, but not limited to, rapidly aging populations, industrialization and green technology, competition for energy sources and commodities, and food security.", "completed": false}, {"dept_code": "HIST", "id": "1475", "course_title": "EAST ASIAN BUDDHISM", "description": "The transmission of Buddhism to East Asia was a momentous development in the history of world cultures and religions. Not only did it precipitate major changes in the cultures of China, Korea and Japan, it also was attended by transformations within Buddhism itself. Beginning with an introduction to the basic concepts of Buddhism, this course examines the major doctrinal, meditative, devotional, and institutional traditions and themes within Chinese and Japanese Buddhism in historical perspective. Particular attention is paid to the problems of transmission of thought and practices from one culture to another and to the ways in which Buddhism changed to meet those challenges and make itself relevant to the members of East Asian societies. We strive to develop an awareness of how Chinese and Japanese Buddhism interacted with and helped to shape East Asian history as well as to cultivate sensitivity to and appreciation of East Asian Buddhism as a contribution to our understanding of the human experience", "completed": false}, {"dept_code": "HIST", "id": "1476", "course_title": "RELIGION AND HEALING IN CHINA", "description": "This course examines the major traditions and themes that constitute religion in China. The origins and development of Confucianism, Daoism, Buddhism, popular and family religion, and religion and the state are presented within an overall historical framework. As China becomes more and more central to the world's modern commodity culture, some have predicted a decline in traditional religious values and practices. In fact, the reverse is true: from Taiwan and Hong Kong through mainland China, increasing prosperity is resulting in an increased \"investment\" in religion. In addition to the study of religious ideas, practices, and institutions in premodern China, the course ends by looking at contemporary beliefs and practices and issues of politics, class, and gender. Our purpose is to gain some exposure to Chinese religious thought and practice, to identify dominant themes underlying Chinese values and behavior, and to explore the syncretic nature of religion in China as each tradition finds expression in and comes to influence other aspects of Chinese religion and culture. In this way, we hope to come to understand the critical role played by the various traditions in the unfolding of Chinese history and in the formation of the Chinese view of the world.", "completed": false}, {"dept_code": "HIST", "id": "1477", "course_title": "RELIGION IN JAPAN", "description": "This course provides an historical overview of religion in Japan from the 3rd century BCE up to the present. It introduces many of the fascinating events, texts, doctrines, institutions, personalities, and practices in the history of religion in Japan. It also examines issues related to myth, shamanism, ritual, art, and politics. During the course, questions such as the following are addressed: How did religious institutions both condemn and condone violence? What are the different paths to enlightenment in Japanese Buddhism? What made a person \"holy\"? Why did the government make people step on pictures of Jesus?", "completed": false}, {"dept_code": "HIST", "id": "1522", "course_title": "BRAZIL", "description": "The course begins with an overview of Brazilian culture and of the country's enormous resource base. Cultural change is traced through the pre-Columbian, colonial, imperial, and republican periods. A major theme throughout is the evolution of a Portuguese heritage into today's distinctive Brazilian national culture. The country is then divided into five regions as a means of understanding its internal diversity. Popular American ideas about subjects like carnival, the Amazon Rainforest, coffee, Copacabana Beach, and the huge foreign debt are also dealt with.", "completed": false}, {"dept_code": "HIST", "id": "1585", "course_title": "US-LATIN AMERICAN RELATIONS", "description": "A survey of US-Latin American from 1800 to the present.", "completed": false}, {"dept_code": "HIST", "id": "1610", "course_title": "UNITED STATES COLONIAL", "description": "This is an upper division course that develops the history of the North American English colonies from around 1400 through the early 1760s.", "completed": false}, {"dept_code": "HIST", "id": "1611", "course_title": "AMERICAN REVOLUTION 1763-1791", "description": "This is an upper division course that considers the history of Revolutionary America between the 1750s and the 1790s.", "completed": false}, {"dept_code": "HIST", "id": "1614", "course_title": "CIVIL WAR HISTORY", "description": "This is an upper division course that considers the impact of the Civil War upon the development of the United States.", "completed": false}, {"dept_code": "HIST", "id": "1619", "course_title": "UNITED STATES SINCE 1945", "description": "Social, economic, and political changes in American society since World War II. Topics include the post-industrial economy, urbanization, women, minorities, education, political movements, government, parties, and political participation. Emphasis is on the massive changes during those years and the impact on people, institutions and government.", "completed": false}, {"dept_code": "HIST", "id": "1625", "course_title": "HISTORY OF THE AMERICAN FRONTIER", "description": "This course explores the settlement and development of frontier regions across the continent, emphasizing 19th century experiences. Diverse and distinctive frontier societies emerged from the processes associated with land acquisition, exploration, Indian relations, Westward migration, economic development, social organization, governance, and urbanization. The different and conflicting interpretations of the frontier experience raise important questions and perspectives about the character of American society.", "completed": false}, {"dept_code": "HIST", "id": "1660", "course_title": "GENDER AND SEXUALITY IN THE US TO 1865", "description": "This upper-level course is part of a two-course sequence which surveys the history of women in the United States. Part 1 focuses on women's experiences from the 1600s to the 1880s with special attention to class, ethnic, and geographic differences among women.", "completed": false}, {"dept_code": "HIST", "id": "1669", "course_title": "HISTORY OF BLACK PITTSBURGH", "description": "This course will explore the role and experiences of black Pittsburghers over the past 200 years of the city's history.", "completed": false}, {"dept_code": "HIST", "id": "1672", "course_title": "RELIGION AND SEXUALITY", "description": "Though American political ideologies have often tried to situate both sexuality and religion as private matters that have no bearing on public life, the topics we discuss in this course reveal that quite the opposite is true. This course will trace how religion and sexuality have played an intertwined and formative role in the development of the political and social history of the United States. We will take a chronological approach to our subjects, locating the intersections between religion and sexuality throughout the course of American history, from Puritan attempts to control women's sexuality to contemporary debates over reproductive rights and same-sex intimacy.", "completed": false}, {"dept_code": "HIST", "id": "1691", "course_title": "LATINO HISTORY", "description": "This course will analyze the forces shaping population movements between Latin America and the United States and how these have evolved over time. We will explore how Latino immigrants have integrated, resisted, and adapted to the forces impacting their lives in the United States over the last century and a half, creating new ethnic, racial, and regional identities in the process. We uncover the varied experiences of Latinos and Latin American immigrants with racism and discrimination, identity formation, community building, work and labor struggles, and social mobility as we map out the heterogeneous mosaic of Latin American and Caribbean diasporas in the United States.", "completed": false}, {"dept_code": "HIST", "id": "1706", "course_title": "DRUGS IN GLOBAL HISTORY", "description": "This course examines the global development of the modern \"pharmaceutical era\" through historical, anthropological, and sociological analyses. It traces the ever-increasing role played by chemical substances in shaping conceptions of health, treatment, and society itself from the early modern period until the present day. Topics include pharmaceuticals as an arena for competing and complimentary interests, the social character of drugs (both legal and illegal), the blurred lines between medicinal and recreational use, and the evolvement of government and scientific regulation of medications.", "completed": false}, {"dept_code": "HIST", "id": "1720", "course_title": "WEST AFRICA IN THE ERA OF THE SLAVE TRADE", "description": "This course provides an introduction to the history the societies of West and West-Central Africa. It explores the enormous linguistic and cultural variation among these societies and examines their political, economic and social evolution during the centuries of the trans-Atlantic slave trade (roughly 1600 to 1850). Students are encouraged to think about how complex historical processes occurring around the entire Atlantic Ocean basin affected the development of states and societies in Western Africa.", "completed": false}, {"dept_code": "HIST", "id": "1746", "course_title": "ATHLETICS OF THE ANCIENT WORLD", "description": "This course examines athletic competition, popular games, gladiatorial and other exhibitions of the ancient Greeks and Romans. Much emphasis on the social/cultural context and underlying values. Attention to relevant artistic archaeological, and historical settings.", "completed": false}, {"dept_code": "HIST", "id": "1749", "course_title": "ISLAM & CONFLICT IN GLOBAL CONTEXTS", "description": "This course will investigate political, social, and ideological conflict involving international political actors (both states and non-states) claiming motivation by, or inclusion within, the contemporary tradition of political Islam. Lecture topics within this course will take a global approach, analyzing political, social, and/or sectarian conflict in central and southern Europe (to include religious conflict and ethnic on the Balkan peninsula in the late twentieth century); southern and southeastern Asia (to include religious tension on the Indian subcontinent and on the island nation of Sri Lanka); East Africa (to include recent political violence centering around the self-declared caliphate \"Boko Haram,\"); and the middle east (to include ongoing international efforts to interdict against the expansion of the self-styled Islamic state in Iraq and Syria). Lectures in this course will aim to explore the means by which international conflict and violence involving these (and other) actors is bound by the tenets, institutions, or characteristics of Islam. These investigations will include inroads into a well-framed understanding of the recent increase in the presence and/or influence of Islamic political movements and the rising influence of international Islamic political parties in each of the aforementioned geographic locale. Course investigations will simultaneously explore the growing trend towards the transnational movement of goods, ideas, and peoples spurred on by or otherwise connected to the ideological tenets of contemporary Islam. The focus within these investigative pursuits will be on connective, global, and conceptual themes within seemingly disparate political movements and actors. Conceptual themes to be investigated include, but are not limited to the structures of global capitalism, economic inequality, gender inequality, minority rights, human rights, colonialism and imperialism, democracy and governance, modernity versus traditionalism, and secularism versus religiosity. Each of these themes is to be unraveled and explored in various contemporary global contexts focusing in particular on the polities and societies in the aforementioned conflict zones.", "completed": false}, {"dept_code": "HIST", "id": "1775", "course_title": "ORIGINS OF CHRISTIANITY", "description": "This course presents a historical-critical investigation of Christian origins. Special attention is paid to varieties of 1st century Hellenistic and Palestinian Judaism within the Greco-Roman world. Primary readings include selected Biblical passages and apocrypha, 1st century historians and philosophers (Josephus, Tacitus, Suetonius, and Philo), the New Testament corpus (including Paul and the Pastorals), and selected readings from the Dead Sea Scrolls. In addition there will be assignments from various modern New Testament critics, historians, and theologians.", "completed": false}, {"dept_code": "HIST", "id": "1781", "course_title": "ROMAN HISTORY", "description": "This course surveys the history of Rome from the earliest times through the late empire, with particular emphasis on political and social developments during the late republic and early empire.", "completed": false}, {"dept_code": "HIST", "id": "1783", "course_title": "GREEK HISTORY", "description": "This course surveys the history of ancient Greece, with special emphasis on political and social developments during the fifth century B.C.", "completed": false}, {"dept_code": "HIST", "id": "1790", "course_title": "MEDITERRANEAN WORLD SINCE 1500", "description": "With uniformity and diversity in the Mediterranean world as its overarching theme, this course examines the singularly important role of \"the sea between the lands\" from the fall of Rome to the present day. Concentrating on the lands and people of the Northern shore from Gibraltar to Anatolia, the focus alternates between thematic approaches to the Mediterranean region as a whole and specific attention to the sub-regional histories of Iberia, Italy, and the Balkans.", "completed": false}, {"dept_code": "HIST", "id": "1801", "course_title": "GLOBAL STUDIES CAPSTONE COURSE", "description": "This course serves as the annual capstone course for Global Studies certificate students and others writing BPhil or honors theses on global topics, past or present. Taught by the UCIS Visiting Professor in Contemporary Global Issues (GSC post-doc), the course is a workshop for student writing complemented by readings selected to initiate productive conversations that link the students' various research projects and that locate those projects in the appropriate historical, social, and cultural context(s). It is designed, generally speaking, to provide students with dedicate hours in their work weeks to devote to thesis writing, to help students frame and contextualize their research through renewed engagement with literature on relevant topics, and to ensure that thesis projects are well connected to broader global processes.", "completed": false}, {"dept_code": "HIST", "id": "1906", "course_title": "ATLAS INTERNSHIP", "description": "The Digital Atlas Design Internship supports student research by teaching interns how to use digital tools and methods to explore the global past. Students manage a semester-long independent research project using an interactive, public-facing platform that utilizes GIS and web design skills gained during the internship. Students engage with both world history and digital humanities while developing a spatial database about a topic of their choosing. Experience with digital methods or GIS is not necessary, and students can receive publication credit for their work. To learn more about the Digital Atlas Design Internship, please visit https://www.worldhistory.pitt.edu/digital-atlas-design-internship. You can also view past internship projects by visiting our project gallery at https://www.worldhistory.pitt.edu/projects.", "completed": false}, {"dept_code": "HIST", "id": "1910", "course_title": "READING HISTORICAL RUSSIAN", "description": "This mini-course is designed to improve students' ability to read and understand Russian-language texts from the Russian Empire and Soviet Union. It focuses on texts that have never been translated, thus offering a unique glimpse into the past made possible only through investment in language study. It is targeted at students who have completed equivalent of at least 4 semesters of Russian language study, as well as heritage speakers.", "completed": false}], "links": []}