{"nodes": [{"dept_code": "PORT", "id": "0101", "course_title": "ELEMENTARY PORTUGUESE 1", "description": "Basic elements of Brazilian Portuguese emphasizing a development of speaking, reading and writing skills. Introductory course.", "completed": false}, {"dept_code": "PORT", "id": "0102", "course_title": "ELEMENTARY PORTUGUESE 2", "description": "The second half of this introductory course continues to develop skills in the speaking, reading and writing of Portuguese.", "completed": false}, {"dept_code": "PORT", "id": "0103", "course_title": "INTERMEDIATE PORTUGUESE 3", "description": "A continuation of the development of conversational as well as writing skills.", "completed": false}, {"dept_code": "PORT", "id": "0120", "course_title": "CONVERSATION", "description": "An intermediate course in Portuguese conversation.", "completed": false}, {"dept_code": "PORT", "id": "1010", "course_title": "PORTUGUESE FOR SPANISH SPEAKERS 1", "description": "Portuguese for Spanish speakers is designed as an accelerated introductory course for native speakers of Spanish or English speakers with fluency in Spanish. It will be the equivalent of Portuguese 0001/1001 and Portuguese 0002/1002. This course concentrates on aspects of the Portuguese language that are most difficult for Spanish speakers, such as pronunciation, vocabulary, idioms and grammatical structures particular to Portuguese.", "completed": false}, {"dept_code": "PORT", "id": "1458", "course_title": "CULTURES OF THE PORTUGUESE SPEAKING WORLD", "description": "This course presents an overview of the contemporary cultures of the Portuguese-speaking world It is especially designed for students with little to no previous knowledge of these geographical regions. In the course, students will explore contemporary social realities throughout the Portuguese-speaking world (namely Brazil, Angola, Mozambique and Cape Verde) through the close and critical reading of texts, literature, film, short videos, podcast episodes, TV programs, among other mediums. Students will be exposed to issues regarding gender, race, nation, sexuality, class, status, among other issues within a contemporary context. Students are expected to engage in critical discussions with the materials and the varying perspectives of their peers. The purpose of this course is not to merely passively digest content but to also think and express oneself critically in reaction to cultural representations both from the perspective of the respective nation and also from US perspectives. It is also necessary to keep in mind that rather than attempting an exhaustive survey of the Portuguese-speaking world in its entirety, the course provides merely a glimpse into the cultural offerings of these diverse and vast geographical regions; it is also an attempt to promote global and cultural understanding. Hopefully, through this exposure, it is also a starting point for further exploration and research in studies of the Portuguese-speaking world and beyond.", "completed": false}], "links": [{"source": "0101", "target": "0102"}, {"source": "0102", "target": "0103"}]}