{"nodes": [{"dept_code": "HPS", "id": "0427", "course_title": "MYTH AND SCIENCE", "description": "The Greeks in the sixth to fourth century B.C. Initiated forms of thinking we have from then on called \"scientific\" and \"philosophical\". This course examines the question of how science is distinguished from \"non-science\" by studying the role of myth and science in ancient Greece. The aim is to understand what distinguishes the ideas of the first scientists and philosophers from those earlier beliefs called myth.", "completed": false}, {"dept_code": "HPS", "id": "0430", "course_title": "GALILEO AND CREATION OF MODERN SCIENCE", "description": "Galileo is the father of modern science. This course explores his revolutionary discoveries, his attack on Aristotle's natural philosophy, and his transformation of the notion of science, and his epoch-making clash with the religious authorities of the time.", "completed": false}, {"dept_code": "HPS", "id": "0515", "course_title": "MAGIC, MEDICINE AND SCIENCE", "description": "This course introduces students from all backgrounds to humanistic ecology, an interdisciplinary method of learning which combines the humanities with science. Humanistic ecology teaches how to integrate scientific research, philosophy, pedagogy, literature, and health in a holistic framework. Students will learn about classical forms of self-transformation, healing, and knowing that will help them find original pathways to knowledge and wellbeing.", "completed": false}, {"dept_code": "HPS", "id": "0611", "course_title": "PRINCIPLES OF SCIENTIFIC REASONING", "description": "This course will provide students with the skills to understand and assess scientific claims that confront them in daily life. Special attention will be given to reasoning based on samples, evaluating hypotheses and causal claims, as well as common mistakes in scientific reasoning.", "completed": false}, {"dept_code": "HPS", "id": "0612", "course_title": "MIND AND MEDICINE", "description": "Mind and medicine deals with fundamental problems and questions that arise in considering the nature of mental health, mental illness, and branches of medicine that aim to promote mental health and treat mental illness. We will begin by considering the concepts of 'health', 'disease' and 'illness' in general, and several different models of medicine. From there we will move on to a consideration of the nature of explanation in medicine generally. We will examine some explanatory successes in the domain of physical health and disease, and consider how those successes were achieved. In the second half of the course we will look at controversies over the question of whether there is such a thing as mental illness, and if so, how one is to define, diagnose and treat it. In order to better understand what is at stake, we will explore these controversies by focusing on a specific mental illness, schizophrenia. Looking at recent research on schizophrenia will allow us to see the extent to which the kind of understanding we have achieved in physical medicine is or is not to be expected with serious mental illness. Students who successfully complete this course will be able to identify and analyze different philosophical approaches to selected issues in medicine and psychiatry; have gained insight into how to read and critically interpret philosophical arguments; and have developed skills that will enable them to think clearly about foundational questions as future or current health care providers, policy makers, and consumers. This course is also part of a core sequence leading to certification in the Conceptual Foundations of Medicine Certificate Program, and is a companion course to HPS 0613 (Morality and Medicine) but may be taken independently. The course is of particular interest to pre-medical and pre-health care students.", "completed": false}, {"dept_code": "HPS", "id": "0613", "course_title": "MORALITY AND MEDICINE", "description": "Ethical dilemmas in the practice of health care continue to proliferate and receive increasing attention from members of the health care profession, ethicists, policy makers, and the general public as health care consumers. In this course we will examine a number of ethical issues that arise in the context of contemporary medical practice and research by analyzing articles and decision scenarios. Topics to be covered typically include the physician-patient relationship; informed consent; medical experimentation; termination of treatment; genetics; reproductive technologies; euthanasia; resource allocation; and health care reform. Students who successfully complete this course will be able to identify and analyze different philosophical approaches to selected issues in medical ethics; have gained insight into how to read and critically interpret philosophical arguments; and have developed skills that will enable them to think clearly about ethical questions as future or current health care providers, policy makers, and consumers. This course is part of a core sequence leading to Certification in the Conceptual Foundations of Medicine Certificate Program, and is a companion course to HPS 0612 (Mind and Medicine) but may be taken independently. The course is of particular interest to pre-medical and pre-health care students.", "completed": false}, {"dept_code": "HPS", "id": "0619", "course_title": "QUANTUM KARMA: SCIENCE IN HINDU AND BUDDHIST TRADITIONS", "description": "We have likely all encountered arguments in which sweeping claims are made about the relationship between religion and science. These claims often generalize on the basis of a limited knowledge of a few locally visible religious traditions. This course offers students an opportunity to explore the way science has interacted with some of the traditions often neglected by these debates. In particular, we will explore how the close relationship between European imperialism and scientific institutions created new parameters for conversations about Hindu and Buddhist traditions. This led intellectuals in these traditions to develop systems of thought that integrate scientific and religious ideas. These ideas played an important role in processes of decolonization, the development of religious nationalism, and the transnational spread of Hindu and Buddhist traditions.", "completed": false}, {"dept_code": "HPS", "id": "0628", "course_title": "PARADOX", "description": "The purpose of this course is to use the natural appeal of paradoxes to introduce students to the methods of philosophical analysis and to give them a taste of the basic content of a wide range of branches of philosophy of science.", "completed": false}, {"dept_code": "HPS", "id": "1616", "course_title": "ARTFCL INTELGNC & PHIL OF SCI", "description": "This course investigates the problem of mechanizing reasoning. For the case of deductive inference, it draws on work in symbolic logic and computation theory. For the case of inductive inference, it draws on work in confirmation theory from philosophy of science and learning theory.", "completed": false}, {"dept_code": "HPS", "id": "1653", "course_title": "INTRO TO PHILOSOPHY OF SCIENCE", "description": "This course provides a broad, introductory survey of current issues in philosophy of science and treats philosophical problems such as confirmation, which are common to all sciences, as well as problems peculiar to individual sciences.", "completed": false}], "links": []}