{"nodes": [{"dept_code": "CHEM", "id": "0100", "course_title": "INTRODUCTION TO GENERAL CHEMISTRY", "description": "This non-lab, 3-credit course develops fundamental concepts, basic calculations, and problem-solving skills in General Chemistry. This course is designed for those who seek to gain knowledge and ability as a foundation to subsequently taking General Chemistry 1, or those students desiring to fill a Natural Science GER with a Chemistry experience without plans of taking additional Chemistry courses. Topics typically introduced include Measurement, Matter, Energy, Atoms, Elements, Molecules, Chemical Composition, Chemical Reactions, Stoichiometry, Periodic Properties of the Elements, and Bonding. A background in chemistry is not necessary while a fundamental knowledge of math is required and facility with basic algebraic concepts is recommended. Students concerned about their ultimate success in Chem 0110 are encouraged to talk to their advisor about the benefits of completing the Introduction to Chemistry course prior to enrolling in General Chemistry I.", "completed": false}, {"dept_code": "CHEM", "id": "0110", "course_title": "GENERAL CHEMISTRY 1", "description": "Chemistry 0110 and 0120 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize applications to industrial and environmental chemistry and biochemistry. CHEM 0110 covers stoichiometry, the properties of solids, liquids and gases, thermochemistry and the electronic structure of atoms and molecules.", "completed": false}, {"dept_code": "CHEM", "id": "0120", "course_title": "GENERAL CHEMISTRY 2", "description": "Chemistry 0110 and 0120 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize applications to industrial and environmental chemistry and biochemistry. CHEM 0110 covers stoichiometry, the properties of solids, liquids and gases, thermochemistry and the electronic structure of atoms and molecules.", "completed": false}, {"dept_code": "CHEM", "id": "0250", "course_title": "INTRODUCTION TO ANALYTICAL CHEMISTRY", "description": "This course is concerned with the rigorous treatment of equilibria that are of analytical importance and with an introduction into electroanalytical methods, emission and absorption spectrophotometry, and modern separation methods, particularly chromatography.", "completed": false}, {"dept_code": "CHEM", "id": "0260", "course_title": "INTRODUCTION TO ANALYTICAL CHEMISTRY LAB", "description": "The primary objectives of this course are to introduce the student to current analytical methods and to cultivate sound experimental technique. Laboratory work includes ion exchange separations, complexometric and potentiometric acid-base titrations, and absorption spectrophotometry.", "completed": false}, {"dept_code": "CHEM", "id": "0310", "course_title": "ORGANIC CHEMISTRY 1", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0320", "course_title": "ORGANIC CHEMISTRY 2", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0330", "course_title": "ORGANIC CHEMISTRY LABORATORY 1", "description": "Chemistry 0330 is devoted to the purification, characterization, and identification of organic molecules using the techniques of recrystallization, distillation, thin-layer, column and gas-liquid chromatography, melting point determination, and infrared and nuclear magnetic resonance spectroscopy.", "completed": false}, {"dept_code": "CHEM", "id": "0345", "course_title": "ORGANIC LABORATORY", "description": "This single semester two-credit Organic Laboratory course will provide an introduction to modern organic laboratory techniques used routinely in both industry and academics. The lab will emphasize practical applications of the reactions covered in the Organic 1 and Organic 2 lectures. The goals of the course are to provide students with practical experience in executing and analyzing organic transformations as well as practical experience in modern laboratory techniques.", "completed": false}, {"dept_code": "CHEM", "id": "0350", "course_title": "PRINCIPLES OF ORGANIC CHEMISTRY", "description": "A one-semester course in organic chemistry that will introduce students to fundamental principles including molecular structure, organic reactions, and mechanisms. As rigorous as the traditional two-term organic chemistry course, topics are chosen for their relevance to students entering a biological sciences-oriented career.", "completed": false}, {"dept_code": "CHEM", "id": "0410", "course_title": "GENERAL CHEMISTRY 1", "description": "See chemistry 0110. This course is for students who need to take lecture without lab.", "completed": false}, {"dept_code": "CHEM", "id": "0420", "course_title": "GENERAL CHEMISTRY 2", "description": "See chemistry 0120. This course is for students who must take lecture without lab.", "completed": false}, {"dept_code": "CHEM", "id": "0430", "course_title": "GENERAL CHEMISTRY 1 LABORATORY", "description": "Laboratory that accompanies CHEM 0110.", "completed": false}, {"dept_code": "CHEM", "id": "0440", "course_title": "GENERAL CHEMISTRY 2 LABORATORY", "description": "Laboratory that accompanies chemistry 0120.", "completed": false}, {"dept_code": "CHEM", "id": "0710", "course_title": "UHC GENERAL CHEMISTRY 1", "description": "Chemistry 0710 and 0720 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize the fundamental principles of chemistry as exemplified by applications to industrial and environmental chemistry. Chemistry 0710 covers stoichiometry, electronic structure of atoms and molecules, periodic behavior, theories of bonding, and spectroscopy.", "completed": false}, {"dept_code": "CHEM", "id": "0730", "course_title": "UHC ORGANIC CHEMISTRY 1", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0745", "course_title": "ORGANIC LABORATORY: ANTIBIOTIC DISCOVERY", "description": "The two-credit CURE Organic Chemistry Laboratory Course serves as an alternative to the Organic Chemistry Laboratory Course (CHEM 0345). This research-based laboratory course has been developed as part of an integrated 2-semester sequence in collaboration with the Department of Biological Sciences. One major goal of this course is to offer undergraduate students an opportunity to perform authentic scientific research in the laboratory course. This collaborative course sequence engages the students in learning approaches towards antibiotic discovery in order to address the world's current antibiotic crisis. Students start out in the biology course by isolating bacterial strains that display antibiotic activity. This biology course is followed up with the organic chemistry lab course that affords the students the opportunity to develop strategies for antibiotic isolation and purification using chemical separation techniques, and to characterize these unknown antibiotics through spectroscopic techniques commonly used in organic chemistry. Students are encouraged to take the biology Small World course (BIOSC 0067) prior to this CURE Organic Chemistry Lab course. However, the Small World course is not required for the students to enroll in this course.", "completed": false}, {"dept_code": "CHEM", "id": "0910", "course_title": "CHEMICAL PRINCPL HEALTH PROFESSN", "description": "This is a one term course covering general and biological chemistry designed primarily for students enrolled in the school of nursing or preparing for health related professions. The course covers aspects of general chemistry including atomic structure and bonding and equilibria. A brief introduction to organic chemistry including physical properties and representative reactions of common functional groups and finally the chemistry of the major classes biomolecules and metabolism.", "completed": false}, {"dept_code": "CHEM", "id": "0960", "course_title": "GENERAL CHEM FOR ENGINEERS 1", "description": "Essentially the same as CHEM 0110, but a total of 3 credits only and has no lab. Enrollment limited to school of engineering students.", "completed": false}, {"dept_code": "CHEM", "id": "1000", "course_title": "MATHEMATICS FOR CHEMISTRY", "description": "", "completed": false}, {"dept_code": "CHEM", "id": "1130", "course_title": "INORGANIC CHEMISTRY", "description": "Modern bonding theories are developed to the level that permits some understanding of the effects of structure and bonding on chemical properties. Periodic relationships are discussed and applied to selected families of elements. Emphasis is placed on those aspects of structure, bonding and periodic relationships that are helpful in unifying a large body of chemical knowledge. Selected topics of current interest in inorganic chemistry are discussed.", "completed": false}, {"dept_code": "CHEM", "id": "1250", "course_title": "INSTRUMENTAL ANALYSIS", "description": "The basic principles and instrumentation of important methods and their application to analysis and research problems. The coverage includes spectroscopic and electrochemical methods and chromatography. Equilibrium and dynamic aspects of each are considered.", "completed": false}, {"dept_code": "CHEM", "id": "1255", "course_title": "INSTRUMENTAL ANALYSIS LAB", "description": "The laboratory component of CHEM 1250. Students will be introduced to state of the art instrumentation being used in contemporary analytical chemistry.", "completed": false}, {"dept_code": "CHEM", "id": "1310", "course_title": "SYNTHETIC ORGANIC CHEMISTRY", "description": "This advanced undergraduate course builds onto sophomore organic I and II courses by applying the learned principles to the synthesis of FDA-approved drug molecules. The emphasis of the course will be on analyzing the molecular structures of drugs in a retrosynthetic fashion, followed by developing suitable synthetic routes to these molecules. The reaction mechanisms of key steps of theses syntheses will be discussed in detail. Further discussion will include fundamental functional group interconversions, chemoselectivity, and protecting group use, enantioselective synthesis, and organometallic chemistry. Students will learn about the complexities of modern drug molecules, how their structures can be analyzed, and how they are synthesized.", "completed": false}, {"dept_code": "CHEM", "id": "1410", "course_title": "PHYSICAL CHEMISTRY 1", "description": "Basic lecture course dealing with quantum theory, atomic and molecular structure, symmetry, spectroscopy and diffraction methods.", "completed": false}, {"dept_code": "CHEM", "id": "1420", "course_title": "PHYSICAL CHEMISTRY 2", "description": "Basic lecture course dealing with gases, kinetic theory, chemical thermodynamics, equilibria, and chemical kinetics.", "completed": false}, {"dept_code": "CHEM", "id": "1430", "course_title": "PHYSICAL CHEMISTRY LABORATORY 1", "description": "Approximately 8 experiments are performed during the term. Experiments are selected to illustrate important principles of physical chemistry and to make the student familiar with important experimental methods. The course is intended to make the student think critically about reliability of experimental results and to attempt to interpret them in the light of his previous chemical experience.", "completed": false}, {"dept_code": "CHEM", "id": "1431", "course_title": "TOPICS IN PHYSCL CHEM WRIT PRAC", "description": "This course provides an opportunity for students to explore a current physical chemistry research topic and create a \"journal ready\" manuscript. The research topic will be chosen during the first two weeks of classes in consultation with the professor. A comprehensive outline and first draft will be prepared then reviewed with the professor. The paper is revised at least once before final submission and is a minimum of 15 pages. Conferences will be by appointment.", "completed": false}, {"dept_code": "CHEM", "id": "1440", "course_title": "PHYSICAL CHEMISTRY LABORATORY 2", "description": "This course has one four hour lab each week. Approximately 7 experiments are performed during the term, with an emphasis on the macroscopic properties of matter. The course is designed to expand upon the principles and techniques covered in Chem 1430 as well as to introduce the student to other scientific methods for investigating properties of materials. There is a lab fee.", "completed": false}, {"dept_code": "CHEM", "id": "1480", "course_title": "INTERMEDIATE PHYSICAL CHEMISTRY", "description": "A lecture course emphasizing application of principles of thermodynamics to solutions of electrolytes and non-electrolytes, electrochemical cells, physical chemistry of surfaces and macromolecules.", "completed": false}, {"dept_code": "CHEM", "id": "1620", "course_title": "ATOMS, MOLECULES AND MATERIALS", "description": "This course will use qualitative molecular orbital theory to understand the design and performance of new materials. A link will be made between \"small molecule\" intuition and the solid-state perspective on large molecules. Clusters and solids.", "completed": false}, {"dept_code": "CHEM", "id": "1711", "course_title": "UNDGR RESEARCH WRITING PRACTICUM", "description": "Chem 1711 will require the student to write a report in the form of a major research paper and will include a historical background to the project, an experimental or methods sections and a discussion of the results and their meaning.", "completed": false}, {"dept_code": "CHEM", "id": "1810", "course_title": "CHEMICAL BIOLOGY", "description": "Revolutionary transformations in chemistry and biology have led to the merging of these disciplines where contributions from both fields impact our molecular and quantitative understanding of biology. Rapid growth in this area has been driven in part by students and researchers applying synthesis, quantitative analysis, and theoretical reasoning to the study complex cellular processes. This course focuses on enzyme mechanisms in biological pathways, kinetics and thermodynamics, and chemical tools to probe and screen components of the cell. Some other topics include DNA/RNA processing, macromolecular interactions, chemical signaling, posttranslational modifications, chemical syntheses of biomolecules, and development of assays for high throughput drug screening.", "completed": false}, {"dept_code": "CHEM", "id": "1880", "course_title": "CHEMICAL BIOLOGY FOR ENGINEERS", "description": "PeopleSoft Description: Chemical engineers have made significant contributions towards the development of pharmaceutical research and manufacturing, and there are now also growing opportunities in field of biotechnology. In this course students broadly examine the nomenclature, functions and mechanisms utilized by DNA, RNA and proteins and learn foundation knowledge in order to contribute to these fields. This includes examination of enzyme mechanisms of therapeutic targets and how pathways of enzymes can produce natural products, such as terpenes and polyketides, that are common antibiotic and antifungal agents. Specialized topics will also be considered such as the engineering of proteins with new catalytic functions and metabolic engineering to produce therapeutics and commodity chemicals. Students also learn about the molecular mechanisms involved in the cellular processes of replication, transcription and translation. These topics include recombinant DNA technology and new therapeutic strategies that have emerged in manufacturing such as antisense oligonucleotide technology.", "completed": false}], "links": [{"source": "0110", "target": "0120"}, {"source": "0120", "target": "0250"}, {"source": "0120", "target": "0310"}, {"source": "0120", "target": "0350"}, {"source": "0120", "target": "0730"}, {"source": "0120", "target": "1410"}, {"source": "0120", "target": "1480"}, {"source": "0250", "target": "0260"}, {"source": "0250", "target": "1250"}, {"source": "0260", "target": "1255"}, {"source": "0310", "target": "0320"}, {"source": "0310", "target": "0330"}, {"source": "0310", "target": "0345"}, {"source": "0310", "target": "0745"}, {"source": "0320", "target": "1310"}, {"source": "0320", "target": "1620"}, {"source": "0320", "target": "1810"}, {"source": "1000", "target": "1410"}, {"source": "1410", "target": "1420"}, {"source": "1420", "target": "1440"}]}