{"nodes": [{"dept_code": "SOC", "id": "0002", "course_title": "SOCIOLOGY OF EVERYDAY LIFE", "description": "This course takes as its object of inquiry the ordinary, familiar, routine, and unremarkable stuff of everyday life, beginning from the premise that, rather than being insignificant or inconsequential, what happens in everyday life crucially structures the world. As well, daily life is structured by larger social phenomena. As such, the study of everyday life provides a lens through which to explore such themes as the workings and effects of power, social change or the lack thereof, social inequality, quiescence and resistance, ideology, identity and difference, norms and normativity, subject formation and subjectivity, and practices of meaning making. Our mode of analysis will be to bring sociological concepts and theory to the sites and practices of everyday life to refine our sociological thinking and our understandings of the world. Along with exposing students to different schools of thought with regard to the study of everyday life, this course will provide students with the necessary tools to defamiliarize and denaturalize that which might seem natural, obvious, and axiomatic. It also is designed to help students think about the relationship between social processes and the individual and about what is at stake in understanding how they mutually affect one another in any given context.", "completed": false}, {"dept_code": "SOC", "id": "0005", "course_title": "SOCIETIES", "description": "This introductory course is devoted to furthering an understanding of life in America today by comparing it to a variety of societies worldwide. Among the societal aspects explored; political and economic systems, cultural styles, major religions and religious trends.", "completed": false}, {"dept_code": "SOC", "id": "0007", "course_title": "SOCIAL PROBLEMS", "description": "The major aims of this course are to understand the nature of important social problems in American society and analyze their causes and consequences. The two competing perspectives, one, that social problems are created when individuals fail to conform to societal norms, and two, that social problems are caused when institutions fail to meet changing needs and aspirations of individuals will be used in our analysis. Future trends and policy alternatives toward amelioration will be examined.", "completed": false}, {"dept_code": "SOC", "id": "0010", "course_title": "INTRODUCTION TO SOCIOLOGY", "description": "This course introduces the student to the discipline of sociology, its development, theories, major findings, and to the sociological interpretation of modern society. Emphasis will be given to the importance of careful empirical investigation for the understanding of recent social and cultural changes. Students should be prepared to encounter basic issues in sociological method and in theory; an inclination toward systematic and abstract reasoning will help.", "completed": false}, {"dept_code": "SOC", "id": "0140", "course_title": "CLASSICAL SOCIOLOGICAL THEORIES", "description": "This course will deal with the foundations of modern sociological theory through a study of major social theorists of the 19th and early 20th centuries.", "completed": false}, {"dept_code": "SOC", "id": "0150", "course_title": "SOCIAL THEORY", "description": "The aim of this course is to provide a survey of major developments in sociological theory in recent times. The classic background for these developments is included as part of the course. Lectures, readings and discussions help the student to acquire a grasp of the significance of theoretical analysis in sociology and of basic sociological problems addressed by a variety of theorists.", "completed": false}, {"dept_code": "SOC", "id": "0230", "course_title": "SOCIAL RESEARCH METHODS", "description": "Students begin to learn to do social research in this course. They learn how to define an appropriate problem, select an appropriate method, collect and analyze data, discuss their results, and draw conclusions. Students study both quantitative and qualitative methods.", "completed": false}, {"dept_code": "SOC", "id": "0317", "course_title": "GLOBALIZATION", "description": "The aim is to analyze the dynamics of civilization in today's interconnected world. How is people's social and cultural life shaped by their position in the world, by local traditions and distant forces? How have the independently coexisting civilizations of earlier centuries become incorporated into a global civilization in which colonial empires and the communist regime have given way to wider democracy and a capitalist regime with global dynamics? How is Western culture (beliefs, values and symbols) disseminated and embraced, modified or resisted in non-Western societies?", "completed": false}, {"dept_code": "SOC", "id": "0339", "course_title": "SOCIOLOGY OF RELIGION", "description": "This course will compare and contrast major classical and modern sociological theories of religion, including discussion of the renewed focus on religion in mainstream, general theory. Attention will be narrowed to a focus on relation between religions, states and individuals in comparative and historical perspective.", "completed": false}, {"dept_code": "SOC", "id": "0432", "course_title": "WEALTH AND POWER", "description": "In this course we aim to understand the fundamental structure and workings of modern capitalist society. We will examine the distribution of wealth, income, and power in both the US and globally, and consider the notions of democracy and imperialism in the context of what we broadly call, \"globalization\". Can we have political equality in societies with high degrees of economic inequality? Are corporations too powerful? Whose side does government usually take the little guys' or the corporations'? Why? How is it possible that the richest nation in the world also has more poverty than any other \"democratic\" country? We will explore these and many other topics from the macro- to the micro- levels of analysis", "completed": false}, {"dept_code": "SOC", "id": "0438", "course_title": "SOCIOLOGY OF THE FAMILY", "description": "This course introduces students to the sociological perspective on the family and analyzes how the structure and nature of family life are shaped by larger historical and social forces. We will look at how changes in the economy and technology affect the family; how ideas concerning gender roles affect male/female relationships and the socialization of children; how race, ethnicity, and class shape family life; and the wide variety of family forms, historical and contemporary.", "completed": false}, {"dept_code": "SOC", "id": "0444", "course_title": "URBAN SOCIOLOGY", "description": "The modern city is simultaneously many different things. It is an assortment of neighborhoods, it is a workshop with factories and offices, it is a crisscross of transportation arteries, it is a marketplace for the interplay of economic interests, it is an object which several different governments try to understand and control, and it is an astonishing mixture of religious, racial, ethnic, recreational, avocational, professional, educational, medical, political, social, and deviant communities. This urban complex will be studied with a sociological approach.", "completed": false}, {"dept_code": "SOC", "id": "0446", "course_title": "SOCIOLOGY OF GENDER", "description": "This course will analyze the various processes and institutions through which gender roles are defined and shaped in our society. It will analyze the interaction between individual conceptions of gender and larger social institutions such as the family, the workforce, the media, religion, etc. The current changes in these roles will be related to changes in other social institutions. We will also examine the multiple forms of inequality in our society--based on sex, race, class, and sexual preference--and see how they interact.", "completed": false}, {"dept_code": "SOC", "id": "0460", "course_title": "RACE AND ETHNICITY", "description": "This is a course presenting the central sociological interpretations of majority/minority relations. The course begins with a consideration of minorities around the world. With world minorities as a frame of reference, the course turns to the United States and its special opportunities and problems.", "completed": false}, {"dept_code": "SOC", "id": "0471", "course_title": "DEVIANCE AND SOCIAL CONTROL", "description": "This course raises questions about what is \"deviant\" and how certain actions and beliefs come to be considered deviant. It also raises questions concerning the social, structural and cultural determinants of the decision to view something as \"deviant\" and in need of \"control\". The course explores changes in the definition of behavior which lead the same behaviors to be considered 'sins', 'crimes', 'illnesses', and 'alternative life-styles'.", "completed": false}, {"dept_code": "SOC", "id": "0473", "course_title": "SOCIOLOGY OF GLOBALIZATION AND HEALTH", "description": "This course is designed to help students understand how economic and political globalization impacts health outcomes in the United States and around the world. In this course we will explore how a variety of global factors affect people's health and their access to health care. For instance, expanded international travel and migration contributes to the spread of infectious diseases and shapes a growing international labor market in health care. International economic policies such as patent law and trade agreements affect access to and delivery of health services and treatments and contribute to national, racial, and gendered inequities in health care. Climate change increases the prevalence of certain diseases and impacts availability of food and water. In addition, global economic forces shape the possibilities for national and local governments to provide for their citizens' basic human needs such as safe drinking water, nutrition, and a healthy environment. Students will gain enough familiarity with global processes to appreciate the multiple influences on human health that are relevant to careers in a variety of fields related to the physical and social sciences and the humanities. This course fulfills social sciences and foreign culture/international global general education requirements.", "completed": false}, {"dept_code": "SOC", "id": "0477", "course_title": "MEDICAL SOCIOLOGY", "description": "This is a course on socio-cultural aspects of health, illness, disease and (medical) treatment in American society. The historical transformation of American medicine into a powerful sovereign profession with unparalleled authority, autonomy and control over all aspects of health and illness will be examined. On the basis of this historical survey, recent empirical studies of distribution of health, disease and medical care will be examined as well as specific substantive issues and contemporary debates.", "completed": false}, {"dept_code": "SOC", "id": "1002", "course_title": "SOCIOLOGY HONORS SEMINAR", "description": "Sociology Honors Seminar (SOC 1002) is the first of a two semester sequence (SOC 1903, taken in the Spring semester, is the second) designed to facilitate students' independent research toward the completion of an honors thesis, a requirement for graduating with honors. The seminar affords students the opportunity to utilize the skills they have acquired as sociology majors, apply their sociological imaginations, dive deep into a topic that is important to them, and produce a work of original scholarly research. Each student will formulate a research problem, identify a faculty member who will serve as their advisor, design a research strategy, locate an appropriate research setting, and begin collecting data. By the end of the Fall semester, students will be well positioned to continue the remaining work on their theses in the Spring semester under Directed Research (SOC 1903) with their thesis advisors.", "completed": false}, {"dept_code": "SOC", "id": "1324", "course_title": "SOCIAL PROBLEMS AND MORAL CRUSADES", "description": "Social problems and moral crusades (SOC 1324) examines how and why certain issues become recognized as \"social problems\" and sometimes become the subject of \"moral crusades.\" Using a social constructionist approach, the course examines conflicts over how issues are defined and periods of intense media and public interest in particular problems. We will look at some new issues that are becoming recognized as social problems and we will analyze changes over time in long-standing conflicts, examining the origins of these conflicts, the reasons why they persist, and their likely outcomes.", "completed": false}, {"dept_code": "SOC", "id": "1359", "course_title": "CONTEMPORARY ARAB SOCIETY", "description": "", "completed": false}, {"dept_code": "SOC", "id": "1364", "course_title": "RACE AROUND THE WORLD", "description": "Beginning with colonialization, race has had a profound influence on local and global socioeconomic relations. This seminar explores the historical roots of race, the role race played in colonization and the transatlantic slave trade, how colonial legacies and globalization perpetuate the racial hierarchy in nations with little racial diversity, and how migration and international relations continue to shape and reshape a global conception of the racial order. As students explore race around the world, they will be encouraged to consider how the fight for racial justice can be both local and global.", "completed": false}, {"dept_code": "SOC", "id": "1365", "course_title": "RACE, CLASS, AND GENDER", "description": "This comparative course draws together a multidisciplinary set of readings to examine the intersection of race, gender and social and economic development in Latin America and the USA. Readings include theories of inequality and case studies.", "completed": false}, {"dept_code": "SOC", "id": "1386", "course_title": "FRENCH REVOLUTION", "description": "This course will consider various theories of the social sources of revolutions and evaluate them in the light of historical research.", "completed": false}, {"dept_code": "SOC", "id": "1405", "course_title": "RELIGION AND SEXUALITY", "description": "", "completed": false}, {"dept_code": "SOC", "id": "1421", "course_title": "BODY POLITICS: TECHNOLOGIES, DISABILITY, DIFFERENCE", "description": "My body is different from yours. Our bodies work as markers of difference. Our bodies have different capacities, powers, and abilities. Our bodies incorporate technologies, prostheses, extensions. The limitations of our bodies have, for some time, been something simply to overcome. We think we can overcome the limitations of our body physiology through technology. Plugging in, reconfiguring. Our bodies, like our minds, are supposedly plastic, capable of rewiring and change. Like upgrading an app, we work on our bodies and sculpt them at the gym. We work with our bodies in the workplace, feel fatigue, exert effort. We subject our bodies to surveillance at work, in urban spaces, in civic protests. Our bodies are increasingly machine-readable. Our bodies are being shaped by automation on factory floors and in warehouses, sensed and tracked by surveillance technologies. Our bodies will increasingly interact with, and be replaced by, robots.", "completed": false}, {"dept_code": "SOC", "id": "1445", "course_title": "SOCIETY AND ENVIRONMENT", "description": "The state of the environment reaches the pages of our newspapers every day. How did we get to this state? Throughout history, human societies have made use of the environment as all human activity is dependent on through puts of energy and materials. The course will seek to understand the social, economic, and political processes as they lead to impacts on the environment. Far from being 'out there', the state of the environment is integrally related to the ways societies work.", "completed": false}, {"dept_code": "SOC", "id": "1446", "course_title": "CONSUMPTION & EVERYDAY LIFE", "description": "The course is composed of three interrelated blocs: 1. The Times of Consumption: Modernity. The rise of the 'new' bourgeois consumer at the turn of the 20th Century through Veblen, Simmel, and Benjamin, and the Frankfurt School. This period includes changes in the architectures of the spaces of consumption, including the Parisian arcades and early department stores. 2. How We Consume Now. We learn about the transformations of consumption practices that accelerate in the twenty-first century. This includes new ways of consuming and experiencing nature, consuming food; the production of certain types of consumer bodies in terms of race, class and gender; and the growth and effectiveness of retail psychology. 3. The Spaces of Consumption: Globalization. The consumer-citizen in the age of Globalization, including the global spread of malls; agro-food networks that provide sushi and McDonalds to cities around the world, and the rise of supply-chain cities to produce goods for global consumers.", "completed": false}, {"dept_code": "SOC", "id": "1448", "course_title": "WORKING WOMEN", "description": "This course studies traditional patterns of women employment, recent gains and changes, and prospects for the future. One aim of the course is for students to gain an understanding of their own work experiences and career plans, as well as those of various groups of women, in relation to broad social and economic changes that are reshaping work in industrial societies.", "completed": false}, {"dept_code": "SOC", "id": "1500", "course_title": "CAPSTONE RESEARCH PRACTICUM FOR MAJORS", "description": "", "completed": false}, {"dept_code": "SOC", "id": "1706", "course_title": "TAIWAN DIASPORA", "description": "To better understand the fundamental thrust and impact of the Taiwanese diaspora, and its connection to globalization, this course is designed to explore the major forces that have shaped Taiwanese diasporic identities and overseas communities primarily during the 20thcentury. Students will read articles and books as well as journalists' reports to familiarize themselves with the range of concepts and debates that analyze Taiwanese-diasporic issues.", "completed": false}, {"dept_code": "SOC", "id": "1717", "course_title": "MODERN TAIWAN: 1500-1980", "description": "This course teaches students about the social, cultural and economic factors that have shaped modern Taiwan, a critically important nation in the development of globalization in Asia.", "completed": false}], "links": [{"source": "0150", "target": "1002"}, {"source": "0150", "target": "1500"}]}