{"nodes": [{"dept_code": "PUBSRV", "id": "0020", "course_title": "INTRODUCTION TO PUBLIC SERVICE", "description": "This course introduces students to the fields of public service. In addition to addressing the concept of public service, it provides students the opportunity to explore the various public service options. These include elected and appointed positions, volunteerism, and work in non-profit organizations. An effort will be made to give students an appreciation of the skills and talents required to effectively serve in these capacities. Classes will involve presentations by a variety of public service professionals, field visits and service learning opportunities.", "completed": false}, {"dept_code": "PUBSRV", "id": "0030", "course_title": "PUBLIC POLICY PROCESS", "description": "Objective: to stimulate independent, critical and creative thinking about processes of public policy formulation in complex and rapidly changing environments. Course provides an approach to understanding interrelationships between elements of public policy (policy problems, policy alternatives, policy actions, policy outcomes, policy performance) and specific skills necessary to formulate and implement policies (problem identification, forecasting, recommendation, monitoring, and evaluation).", "completed": false}, {"dept_code": "PUBSRV", "id": "0040", "course_title": "PUBLIC SERVICE TECHNOLOGIES", "description": "This course presents an overview of existing and emerging technologies that may be used by public service professionals to accomplish organizational goals or improve efficiency and effectiveness. Through discussions, readings, internet research and hands-on computer exercises, it will emphasize current information technology concepts, issues, and practices in the United States. In addition, it will provide students with a technology skill set utilized in subsequent courses and in the practice of a public service career.", "completed": false}, {"dept_code": "PUBSRV", "id": "1100", "course_title": "PRACTICES IN PUBLIC ADMINISTRATION", "description": "Examines practices, issues and concepts in governmental administration. Course deals with such matters as current and best approaches to administration, administration and politics, organizational structure and behavior, and decision making.", "completed": false}, {"dept_code": "PUBSRV", "id": "1120", "course_title": "HUMAN RESOURCES MANAGEMENT IN THE PUBLIC SECTOR", "description": "This course is an introductory survey of the understandings and skills needed by both managers and employees to cope with the myriad human resources management systems in public sector organizations. Specific topics include the history and evolution of human resources management, the legal environment, human resources planning, position classification and compensation, recruitment, promotion, termination, performance evaluation and training. Integrated with these topics will be the technical and legal concerns of labor relations and equal employment opportunity.", "completed": false}, {"dept_code": "PUBSRV", "id": "1200", "course_title": "PRACTICES OF NON-PROFIT MANAGEMENT", "description": "Introduction to forms of non-profit organizations and their roles in American society. Course evaluates how non-profit organizations define their policy and service roles and examines the context of how they are organized, governed, financed, staffed, and managed. Other topics to be examined are law and philanthropy, voluntarism, strategic planning and marketing, training and developing boards, staff and volunteers, and ethical behavior.", "completed": false}, {"dept_code": "PUBSRV", "id": "1210", "course_title": "FINANCIAL MANAGEMENT OF NON-PROFIT ORGANIZATIONS", "description": "Students are provided with an overview of the theories, practices and critical role of financial management in the non-profit sector. Major attention is focused on the tools and techniques that are necessary for the manager to effectively achieve an expanding mission in the face of a difficult and competitive revenue raising environment.", "completed": false}, {"dept_code": "PUBSRV", "id": "1230", "course_title": "FUNDRAISING FOR NON-PROFIT ORGANIZATIONS", "description": "This course is intended to help students become familiar with the major sources of financial resources available to support the program activities of non-profit organizations. It will introduce students to the basic component of grant proposals and other revenue raising techniques i.e. plan giving, general appeals and endowments.", "completed": false}, {"dept_code": "PUBSRV", "id": "1305", "course_title": "HEALTH, LAW AND ETHICS", "description": "This course addresses legal and ethical issues encountered by health care practitioners as well as those working in health care management and public health. Strong emphasis is placed on legal and ethical issues that occur within the realm of direct patient care. Topics include, but are not limited to: advance directives, decision making capacity, informed consent, organ donation, end of life decision making, surrogate decision making, and confidentiality. Students will be able to articulate common health care ethics principles, theories, methodology, laws, and concepts and use the same to analyze health care ethics cases. Students will also develop concrete logical arguments in support of a chosen ethical stance.", "completed": false}, {"dept_code": "PUBSRV", "id": "1310", "course_title": "DIVERSITY ISSUES IN PUBLIC SERVICE", "description": "This course analyzes public service from the perspective of minorities and women. The minorities examined are black American men and women, with lesser attention given to ethnic minorities, those over 45 and the handicapped. The experience and aspirations of these several minorities will be examined in terms of how minority culture illuminates the nature of public service.", "completed": false}, {"dept_code": "PUBSRV", "id": "1315", "course_title": "MANAGING PROJECTS AND CONTRACTS", "description": "This course provides students with the fundamentals of project management by examining key components of the project cycle, such as: problem identification, results-based planning and design strategies, implementation and scheduling strategies, monitoring and performance indicators, impact learning with evaluation studies, and data management and reporting systems. Students will also be introduced to team building concepts, managing project budgets, writing scopes of work, and legal issues in the management of contracts and administration of grants.", "completed": false}, {"dept_code": "PUBSRV", "id": "1390", "course_title": "THEORIES OF LEADERSHIP", "description": "This course is designed to acquaint students with multiple theories and practices associated with effective leadership. In answering the question, \"what is leadership\", it examines such theories as situational, participative, transformational, and servant leadership. It also addresses those leadership and administrative skills and practices usually associated with effective community organization and professional management.", "completed": false}, {"dept_code": "PUBSRV", "id": "1455", "course_title": "LAW, ETHICS AND PUBLIC POLICY IN THE MASS MEDIA", "description": "This course examines a variety of public policy issues as those issues are impacted by the role and significance of the news and entertainment media. It explores mass media law and policy, with particular attention to regulatory practices.", "completed": false}, {"dept_code": "PUBSRV", "id": "1910", "course_title": "INSTITUTE OF POLITICS INTERNSHIP/SEMINAR", "description": "While students are obtaining first-hand internship experience working with an official directly involved in policy making for the Pittsburgh region, they will learn in this seminar to analyze the policy-making process as an example of social problem-solving. They will learn the issues confronting the region; they will study the policy-making process; finally they will analyze the method of participant observation.", "completed": false}], "links": []}