{"nodes": [{"dept_code": "JS", "id": "0011", "course_title": "ELEMENTARY HEBREW 1", "description": "This course introduces students to the fundamentals of the Hebrew language. We study basic vocabulary, grammar and sentence structure, and learn to read and write Hebrew. Emphasis is learning to speak the language.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0025", "course_title": "INTERMEDIATE HEBREW 3", "description": "Students continue to develop the skills acquired in Hebrew 2 with emphasis on speaking and on understanding the spoken language. Readings this term include short stories and articles.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0037", "course_title": "ADVANCED HEBREW 5", "description": "This course is for advanced level students and uses Hebrew language literature, print and electronic media, film, and TV shows. Emphasis is placed on conversation, modern Hebrew literature, and composition.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0090", "course_title": "MYTHOLOGY IN THE ANCIENT NEAR EAST", "description": "The myths of the ancient near East are among the earliest written interpretations of the world and human existence. They are also among the most enduring, although they have only been unearthed in the last 200 years. In this course, we read myths from ancient Mesopotamia, Ugarit, and Israel. We study the myths as literary works, representative of the ideas and issues of the original cultural context in which they were shaped. These myths offer insight into the religious mentality of the ancient near east, as well as societal and political issues. We examine themes such as the presentation of the life of the gods, the relationship between the human and divine worlds, the issues of mortality and immortality, existence, fertility, kingship, and ethics. The primary goal of this course is to better understand these myths as they existed and developed in their ancient settings. Of course, because the myths are expressions of human thought, we may find that in studying them we also come to better understand ourselves.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0283", "course_title": "US AND THE HOLOCAUST", "description": "With increasing interest in the Holocaust in Europe, this course focuses on the American side of the Atlantic - on issues of anti-Semitism and anti-immigrant sentiment in this country and on America's response to the Holocaust. We will also look at some post-holocaust issues as well.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1259", "course_title": "ISRAELI FILM AND TELEVISION", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1270", "course_title": "GERMANY TODAY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1762", "course_title": "THE GUIDE TO THE PERPLEXED", "description": "", "completed": false, "prereq_count": 0}], "links": []}