{"nodes": [{"dept_code": "FMST", "id": "0120", "course_title": "INTRODUCTION TO FILM", "description": "This is an entry-level course on the visual arts that offers the student a broad introduction to the medium of film. As part of this overview, the class will consider such issues as: the process of contemporary film production and distribution; the nature of basic film forms; selected approaches to film criticism; comparisons between film and the other media. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0130", "course_title": "INTRODUCTION TO VISUAL CULTURE", "description": "This course develops skills to interpret visual culture in contemporary life. Using a wide variety of media, including film, television, advertisements, fashion magazines, museum exhibits, comic books, painting, graffiti, video games, the web, and photography, the course focuses on understanding how conceptions of visuality, gender, race, and politics shape definitions of high and low culture as well as questions of knowledge and being. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0150", "course_title": "FILM ANALYSIS", "description": "This course introduces students to the art of the cinema, and to the techniques for its formal analysis. It examines the nature of shot composition and visual framing, the use of color, the role of lighting as a pictorial element, the potentials of camera movement, the modes of editing and the nature of image/sound montage. It also introduces students to dominant cinema forms--narrative, experimental, documentary, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0170", "course_title": "WORLD FILM HISTORY", "description": "This course both introduces students to techniques of film analysis and acquaints them with major works and movements in international cinema. The course pays particular attention to the evolution of film narrative and visual style through landmarks in film development--European avant-garde films, British documentary, Italian neo-realism, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0280", "course_title": "HISTORY OF FRENCH CINEMA", "description": "This course will introduce students to the history of cinema in France from the beginnings of cinema to the present day. We will examine films from all periods and consider a diversity of forms and genres, including mainstream narrative films, art films, avant-garde experiments, blockbusters, and documentaries. No previous course experience with cinema is presumed as we will learn the basics of how to watch, discuss, and write about films and the film industry. The course will be taught in English; readings will be available in English; and all films with have English subtitles. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0303", "course_title": "ITALIAN CINEMA ICONS", "description": "Rotting zombies, evil witches, and merciless cowboys meet superstar directors, iconic actors, and award-winning composers in ITAL0085: Italian Cinema Icons. This course moves through the genres of Italian cinema and focuses on the most influential artists and on the most representative films. We are going to go from the war film masterpieces of the 1940s to the gory exploitation horror of the 1970s, from Sergio Leone's re-invention of western films to Mario Bava's rip-off of The Exorcist: this class really has something for everyone. So come enjoy what you love already and discover what you are going to love next. No previous course experience with cinema is presumed. The course will be taught in English; readings will be available in English; all films will have English subtitles. This would count as a Category 1 course for the FMS major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0320", "course_title": "RUSSIAN FILM: EISENSTEIN AND COMPANY", "description": "The course presents the history of Russian and Soviet films, filmmaking, and the film industry from the coronation of Tsar Nicholas II to the death of Stalin.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0505", "course_title": "INTRODUCTION TO NEW MEDIA", "description": "In this course we will look at how new media -- ranging from television, computers, digital image production, video games, to social media platforms and smart phones -- have begun to supplant the social and cultural prominence of film and other traditional media. We'll look at how these media work: at the history and theory of their development, at the changes they have brought about in a broader media culture, and at their social status and significance (e.g., The place they occupy in culture, the kinds of interactions they make possible). This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0800", "course_title": "FILMMAKING 1: FUNDAMENTALS", "description": "Filmmaking is a creative process that combines art, science, craft, and collaboration. This course is a hands-on introduction to the process, starting with the building blocks of motion pictures: light and cameras, composition, editing, and visual storytelling. You will complete two short videos over the course of the semester, shooting video with DSLR cameras and editing using Adobe Premiere Pro. In-class exercises will provide a deeper understanding of making moving images.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0826", "course_title": "POST-PRODUCTION", "description": "This course introduces students from film, video and photography to the desktop Macintosh computer-the preferred interface when dealing with graphics-related applications. Students will first become acquainted with and proficient in the mac operating system. The course will survey the most popular applications for manipulating photographic images, combining text with images, and doing simple video and audio editing on a mac. Students will integrate readings, lecture and in-class lab sessions to complete their own projects.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0845", "course_title": "FILMMAKING 2: SIGHT AND SOUND", "description": "In this hands-on course, you will continue to acquire the skills required to design, shoot and edit HD video. Demonstrations and in-class exercises introduce more professional camera operation, lighting, sound, special effects, and editing workflows. You will apply this new knowledge and facility to several out-of-class assignments of increasing sophistication over the course of the semester.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1200", "course_title": "INTRODUCTION TO EAST ASIAN CINEMA", "description": "This course investigates the ways in which film addresses and treats the major socio-cultural issues in modern society through a critical study of the works of Chinese and Japanese master filmmakers. The course focuses on changes in marriage and family patterns, women's roles and the plight of youth.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1220", "course_title": "NEW CHINESE CINEMA", "description": "Students will study Chinese films made by filmmakers of mainland China and Taiwan. They will learn about origins, development, themes, and styles with major directors and important films of new Chinese cinema being studied. Students will have an opportunity to understand contemporary Chinese culture and society.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1240", "course_title": "INTRODUCTION TO KOREA THROUGH FILMS", "description": "Introduces Korean cinema to students in broader (and at times narrow) cultural, social, and aesthetic contexts to investigate transnational media production and circulation, globalization, consumer culture, commercialization, and construction of national, ethnic and gender identities. Through this course, students will learn more about specific issues pertaining to Korea and its people, as well as gain familiarity with some prominent film directors of Korea's. They will develop a critical and historical consciousness of Korean visual culture, assessing the worth and content of the films.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1350", "course_title": "FILM DIRECTORS", "description": "This is a course that changes topics every term; please see the Topic title and/or Class Notes for the specific director. This course looks at the mode of production of films and works to understand the interweaving contributions of directors, producers and screenwriters. It will also consider less personal forces--social climate, studio style, genre and audience taste. It examines the films of particular directors for signs of personal style, theme, or personal preoccupation. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1410", "course_title": "FILM AND POLITICS", "description": "This course examines film production, economics and forms of representation as reflections of political attitudes. We will study a variety of narrative and non-fiction films which reveal differing political points of view, ranging from those that legitimize the dominant culture to those which criticize, if not challenge, dominant attitudes. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1416", "course_title": "GENDER AND FILM", "description": "This course examines and questions aspects of gender and sexuality in international cinema. While the course considers the intersectional realities affecting masculinity and femininity on-screen, it will also consider who is behind the camera and ideas of \"authentic\" representation. Attention will also be paid to the social and historical context in which these films were made, in an attempt to understand the relationship between art and ideology. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1508", "course_title": "TELEVISION ANALYSIS", "description": "This course studies television as a visual medium, an industry, and as a cultural force by examining the forms television programming takes and the way these structures influence viewer response. We will examine specific television genres from longstanding series types (sitcoms, cop shows, serials, etc.) to the gendered forms of \"quality\" television. This is a Critical Studies course with Production elements and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1525", "course_title": "HORROR FILM", "description": "This course will investigate the key films and critical discussions surrounding the horror genre from its silent film beginnings to the present. We will use horror as a lens to ask wide-ranging questions about spectatorship, theory, history, aesthetics, and politics that have shaped and continue to transform film and media studies. This course examines horror subgenres, the ways that producers and directors have developed the genre, and the ways horror film exploits social attitudes and values to generate audience involvement. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1532", "course_title": "SUPERHEROES ON FILM AND TELEVISION", "description": "This course explores a wide range of issues relevant to the superhero genre in popular media, including: the origins of the genre; various cultural critics' responses to it; the intersections between superhero narratives, audiences, and the cultural and historical contexts that produce them; and the ever-changing form and structure of the genre itself. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1740", "course_title": "MAKING THE DOCUMENTARY", "description": "This is a production course in which students will research, define, and schedule their own projects. The class covers all stages of producing a documentary from the idea through development, preproduction, production and postproduction and will examine the fundamentals of the art of documentary making: artistic identity, point of view and storyteller, form and style, and light and sound etc. Students will develop and produce original documentary short film in a collaborative learning environment, working in small groups (of two or three students). They will write, develop, and shoot their own short documentary project (8 to 10 minutes). While those interested in writing or filmmaking will find practical uses for their skills in this course, students from all disciplines - writing, science, film studies, or general liberal arts - are welcomed, and will find benefit in the acquisition of skills for presenting, representing, and persuading via sound and image. No filmmaking experience is necessary. This is a Production course and counts for Category III towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1777", "course_title": "DIGITAL STUDIO: ANIMATION", "description": "This is an advanced course designed for students to intensely experiment and explore the moving digital image in an art context. Students will explore the concepts and skills involved in working with digital animation - from pre to post-production. Each student will propose and undertake a final, self-designed project during the final four weeks of the term. Major effort, time, imagination, productivity, and involvement are expected throughout the term.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1846", "course_title": "FILMMAKING 3: STORY TO SCREEN", "description": "Building on your experiences in Filmmaking 1 and 2, you will continue to develop your style as a filmmaker while creating more ambitious work and improving your technical skills. Demonstrations cover HD video cameras and lenses, advanced lighting and sound techniques, creating a pre-production binder, and advanced post-production workflows using Adobe Creative Cloud software. In addition to creating short projects in class, significant outside work is required, as you will take a short film from concept to a polished final version.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1855", "course_title": "DIRECTING MOTION PICTURES", "description": "This course addresses some of the basic problems of designing and directing scenes for motion pictures. Some of the problems discussed are the relationship of film to reality, the meaning of cinematic techniques, continuity, shot selection, cut selection and visualization techniques. The format is a combination of lecture, screening and interactive group exercises. Extensive outside work is necessary.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1860", "course_title": "ELEMENTS OF SCREENWRITING", "description": "This course will explore developing character-based stories in the screenplay form. Students will be exposed to a variety of readings, including original screenplays, related prose, and texts which reinforce basic tenets of good story telling. Students will write a completed 1st Act for a 3 to 5 part screenplay, building from idea to outline with particular attention to structure and character development.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1880", "course_title": "DIGITAL CINEMATOGRAPHY", "description": "This course will cover advanced video technology and professional techniques of videography. Emphasis will be placed on high image quality and meeting broadcast specifications for video and audio. Professional-quality video cameras will be covered extensively.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1885", "course_title": "BROADCASTING", "description": "Broadcasting introduces students to television production through academic and hands-on experience, utilizing the University of Pittsburgh's new state-of-the-art television studios and equipment. In addition to students learning how to produce a live broadcast event for collegiate teams and a news broadcast, guest lecturers will talk about the industrial realities of the profession. Students will understand how to format and make a show rundown, apply graphics, utilize replay, work a television camera, comprehend audio application and mixing, produce and direct live events and news broadcast, as well as gain experience in front of the camera as news anchors, reporters and on-air talent for live events.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1886", "course_title": "BROADCASTING 2", "description": "The unique and dynamic Broadcasting 2 course will utilize every aspect of the state-of-the-art Pitt Studios, offering students a challenging and stimulating curriculum. Students will produce a Live Event Show Open (incorporating all pre-production elements), a Newscast, and a Podcast, incorporating video and animation marketing support. Students' projects will be crewed by classmates.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1893", "course_title": "HUMAN INTEREST STORIES FOR BROADCAST", "description": "Human Interest Stories for Broadcast will teach students how to present and tell a compelling story about a person, place, or thing in the confines of television broadcast, streaming, or social media platform. Writing techniques for television, research techniques, interview techniques, adding graphics, mixing sound and music, video, tracking and voice-over will be required for the feature packages ranging from :45 seconds in length to 3:00 minutes in length. This is a Category III class that combines critical and production elements. This course counts for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}], "links": [{"source": "0800", "target": "0845"}, {"source": "0800", "target": "1777"}, {"source": "0845", "target": "1846"}, {"source": "1885", "target": "1886"}]}