{"nodes": [{"dept_code": "ARC", "id": "0110", "course_title": "APPROACHES TO THE BUILT ENVIRONMENT", "description": "This foundational course for architectural studies majors seeks to acquaint students with contemporary ideas that affect our understanding of the built environment across the globe through a series of units dealing with different architectural issues and building types. The course engages in intensive reading of canonical texts in the field and current studies of issues shaping the built environment today.", "completed": false}, {"dept_code": "ARC", "id": "0112", "course_title": "GLOBAL ARCHITECTURE 1: PREMODERN", "description": "This course offers a global view of architectural and urban history from antiquity (c. 3500 BCE) to the early modern period (c. 1750 CE). The class is organized around three types of historical characters: travelers, believers, and makers and chronicles the built environments that they created or imagined. Each class session will be based around case studies that ask how a certain type of person (a craftsperson, a queen, or a monk)might have constructed and used their physical environments. Through the semester we will also address the concept of global as an environmental response by individuals and communities to connect with people and places that were different from themselves. Sometimes this happened through travel and migration or through trade or conquest. Other times persons remained stationary yet imagined and created worlds that connected the living and dead, the profane and the spiritual, or the mundane and the philosophical. Yet other times people were forced to move as enslaved persons or as nomads--these persons too made their worlds with the resources that were available to them. Studying the built environments of people who thought, lived, and comported themselves differently from \"us\" will prepare you to live, work, and play in a world increasingly marked by difference rather than homogeneity.", "completed": false}, {"dept_code": "ARC", "id": "0201", "course_title": "FOUNDATIONS STUDIO 1", "description": "The architectural studies seminar is intended to provide experience working on an advanced level with a specialized topic in architecture. In some years the seminar will deal with history or theory, in others with conceptual issues. For this offering it will focus on several particular problems in the development of Frank Lloyd wright's career in architecture.", "completed": false}, {"dept_code": "ARC", "id": "0902", "course_title": "ARCHITECTURAL STUDIES PROSEMINAR", "description": "", "completed": false}, {"dept_code": "ARC", "id": "1162", "course_title": "CAMPUS-COMMUNITY WORKSHOP", "description": "Architects and designers have a vital role to play as thinkers and advocates who work with organizations and communities to help imagine ways to reshape the environments in which we live and interact. Over the course of the term, students will investigate the Pitt campus and surrounding Oakland neighborhoods, conduct original research using primary and secondary sources, and think critically and creatively about ways the environment can be shaped to make positive change. Each student will develop an original, written proposal for either [1] an intervention that responds to a need, enhances the experience of being at the university, or improves the quality of life on campus or in an adjacent neighborhood; or [2] a research project that could be continued in a subsequent term for independent study credit.", "completed": false}, {"dept_code": "ARC", "id": "1202", "course_title": "ARCHITECTURE DESIGN STUDIO 2", "description": "This course is designed to give students who are majoring in architectural studies and who intend to pursue a professional degree in architecture at the graduate level exposure to a sophisticated conceptual framework for thinking about three-dimensional composition and architectural problem solving known as /system-based design/. The course is also intended to emphasize the necessity of excellent graphic skills and technical skills in model-making to communicating design ideas. This course is meant to serve as a capstone for the architectural studies major.", "completed": false}, {"dept_code": "ARC", "id": "1204", "course_title": "DESIGN STUDIO 4", "description": "", "completed": false}, {"dept_code": "ARC", "id": "1911", "course_title": "ARCHITECTURE AND DIGITAL MEDIA 1", "description": "An introduction to the graphic communication of architectural documents utilizing computer aided drafting (CAD) techniques. This introductory cad course is designed to give students a working knowledge of the AutoCAD drafting system. The course has been designed to better acquaint students with concepts, processes and skills required by professionals in the field to create and modify computer-generated drawings. Students will learn the commands and functions necessary to input, process and output two dimensional working drawings in the form of plans, elevations and sections. Three-dimensional visualization will also be covered as a means to explore massing and proportion. In addition to the fundamental design methods and practices for the creation of architectural drawings, exercises will focus on fundamental concepts such as scaling, dimensioning, annotating as well as maintenance of CAD drawing files through the use of operating system commands.", "completed": false}, {"dept_code": "ARC", "id": "1990", "course_title": "ARCHITECTURAL STUDIES INTERNSHIP", "description": "Academic credit is awarded for practical professional experience gained through a directed internship. The internship is arranged by the student through the university internship office in consultation with the director of architectural studies.", "completed": false}, {"dept_code": "ARC", "id": "1999", "course_title": "SENIOR THESIS", "description": "In this course a senior major in the history of art will research and write a research paper and present it as if for publication. The area and topic will be decided upon in consultation with a specific faculty member.", "completed": false}], "links": []}