{"nodes": [{"dept_code": "ARTSC", "id": "0020", "course_title": "LATIN AMERICA AND CARIBBEAN", "description": "The purpose of this course is to provide students with substantial knowledge concerning the geography, history, and culture of Latin America and the Caribbean and to introduce them to how issues related to the region are studied from a variety of disciplinary perspectives.", "completed": false, "prereq_count": 0}, {"dept_code": "ARTSC", "id": "0101", "course_title": "FIRST APPROACHES TO RESEARCH", "description": "First Approaches to Research is designed to teach students how to connect to research and creative projects across disciplines, interests, and methodologies. Driven by their own curiosities and the search for answers, students will learn the tools needed to launch meaningful undergraduate research careers.", "completed": false, "prereq_count": 0}, {"dept_code": "ARTSC", "id": "0111", "course_title": "RIGHT START 1", "description": "This course is designed to enhance the academic skills of new students participating in the student support services project (SSS). The course will use collaborative learning strategies to address such topics as note-taking, problem-solving, time-management, test-taking, and goal-setting. This course is very interactive and will use multiple methods of communication and technology to apprise students of course activities along with upcoming SSS events.", "completed": false, "prereq_count": 0}, {"dept_code": "ARTSC", "id": "0800", "course_title": "INTERCULTURAL EXPERIENCES", "description": "This course supports international students through exchange with domestic students prior to arrival at Pitt and throughout their first term on campus.", "completed": false, "prereq_count": 0}, {"dept_code": "ARTSC", "id": "1910", "course_title": "INSTITUTE OF POLITICS INTERNSHIP", "description": "This course represents the experiential component of the politics institute's undergraduate internship. The purpose of the internship experience is to provide the student with direct exposure to the process of public decision-making. Each student will work with an individual or office directly involved in the policy-making process. Students will be selected through a competitive process.", "completed": false, "prereq_count": 0}, {"dept_code": "ARTSC", "id": "1950", "course_title": "STUDY LAB: CRLA LEVEL 1 PEER TUTOR SEMINAR", "description": "This course is a seminar for peer tutors who work with fellow students on behalf of the Study Labs.", "completed": false, "prereq_count": 0}], "links": []}