{"nodes": [{"dept_code": "GEOL", "id": "0008", "course_title": "ENVIRONMENTAL SCIENCE, FRENCH TRAILER", "description": "A one credit French Language Trailer where we'll discuss the UN sustainability development goals related to GEOL 0840: Environmental Science topics. We'll focus on French vocabulary related to sustainability, air pollution, water pollution, environmental justice, and climate change. Class discussion/activities will be primarily in English. Readings for discussion will be in French with a target audience of policymakers or the public. Students should have taken the equivalent of two-years of high school French or of French 102 at Pitt, or have permission of the instructor to enroll.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "0055", "course_title": "GEOLOGY LABORATORY", "description": "The course consists of a laboratory structured to give students an overview as well as hands-on experience with the methodology used by earth scientists to study geologic processes.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "0800", "course_title": "GEOLOGY", "description": "Geology is the study of how the earth works. This class covers the classification and origin of basic rocks and minerals; examines the role of plate tectonics in shaping the earth and producing such hazards as earthquakes and volcanoes; and examines the forces that shape beaches and rivers and sometimes threaten our lives and property. We also survey the evidence for changing climate and the future of such resources as groundwater, fossil fuels, and ores.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "0840", "course_title": "ENVIRONMENTAL SCIENCE", "description": "This class is an interdisciplinary introduction to the science underlying environmental issues. Focusing on the principles of geology, biology, and chemistry and in their application to human impacts on the environment, strategies for sustainable management of environment and natural resources, and global change.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "0870", "course_title": "THE PLANETS", "description": "This course is an introduction to the worlds of our solar system. We will make extensive use of the most recent and dramatic images to discuss the nature, origin, and history of the planets and moons of our solar system", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1001", "course_title": "MINERALOGY", "description": "Physics and chemistry of minerals. Includes physical properties, crystal chemistry, crystal structure and symmetry, mineral identification using a petrographic microscope, and the processes of mineral formation and breakdown.", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1015", "course_title": "GEOLOGY COLLOQUIUM", "description": "Geology colloquium is open to undergraduate students in geology and planetary science. It is a formalization of the seminar series with weekly guest speakers from industry, academia and government. Each seminar will focus on a different research topic in earth sciences describing on-going projects of interest to students. The course may be taken multiple times.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1020", "course_title": "SEDIMENTOLOGY AND STRATIGRAPHY", "description": "Sedimentology is the study of the processes that produce modern and ancient sedimentary deposits. The lectures will focus on a variety of modern sedimentary systems (rivers, deltas, beaches, etc.) As well as their ancient equivalents. The class culminates with an exploration of how long-term changes in sediment supply and sea level act to shape regional-scale sedimentary sequences. The lab focuses on rock identification and interpretation and on a variety of stratigraphic problems.", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1030", "course_title": "THE ATMOSPHERE, OCEANS AND CLIMATE", "description": "This course will examine the atmospheric and oceanic interactions that determine the nature of the global climate system. Specifically, the course will explore the origin, evolution, and structure of the earth's oceans and atmosphere, the earth's energy balance, atmospheric circulation patterns, and surface and deep ocean currents. The course will also consider records of past climate, evidence for recent warming, climate change projections, and climate change policy.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1050", "course_title": "SURFACE WATER HYDROLOGY", "description": "This course shall provide an Earth systems science overview of the processes that govern the hydrologic cycle including precipitation, evapotranspiration, runoff and discharge, infiltration, and groundwater. The course shall emphasize the movement of water through the atmosphere, over the land surface, and within the unsaturated and saturated zones.", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1055", "course_title": "ENVIRONMENTAL ETHICS", "description": "This course asks students to evaluate environmental decision-making, land-management, and use of natural resources by investigating the underlying assumptions of discussions with in the fields of science, management, economics, law, religion and public policy on the environment. Throughout the semester, we will discuss our historical and current day evolution toward Land Ethic.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1062", "course_title": "GEOMORPHOLOGY: DYNAMIC EVOLUTION OF EARTH'S SURFACE", "description": "This course aims to introduce students to the geomorphologic processes that shape the surface of Earth, the physical mechanisms by which they operate, and the landforms they create. It will combine qualitative and quantitative descriptions of land-shaping processes such as river erosion, glaciers motion, and landslides. The course builds on in class discussions and assignments to train students in applying basic physical and mathematical tools to explore geomorphological processes.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1307", "course_title": "SUSTAINABLE FOOD SYSTEMS", "description": "Our food system is a multifaceted network of interconnected systems and relationships. In order to be able to feed ourselves well into the future, it must be sustainable. A sustainable food system is a system in which healthy food is provided to people while balancing the environmental, social and economic impacts. These dynamics force stakeholders to confront synergies and tradeoffs in agricultural practices, harvesting, transportation, manufacturing and distribution, healthy diets, and a reduction in wasted food.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1309", "course_title": "LIMNOLOGY", "description": "This course will explore the physicochemical and geological aspects of inland waters (lakes, rivers, springs, and wetlands). Specifically, the course will examine the origin and evolution of lakes, the physical and chemical properties of fresh and saline waters, watershed hydrology, and the biogeochemical cycling of major elements and nutrients.", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1313", "course_title": "COM ENVIRONMENTAL PROFESSIONALS", "description": "This course serves as a w-course for environmental studies. We will sample various tools and methods (typical \"professional\" tasks such as memos and letters, building into comprehensive assignments such as case studies), all while concentrating on how audience and purpose affect communication.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1331", "course_title": "HEALTH AND SAFETY (HAZWOPER)", "description": "Hazwoper (hazardous waste operations and emergency response) is a 40-hour course that promotes awareness of safety and response plans for those who may work with chemical and other hazards in the work-site. Students will learn how hazardous materials are handled and identified; human responses to exposure; learn what to do in case of site emergencies; use appropriate safety methods and work practice controls; and understand labels that are used to alert personnel of danger involving hazardous material. (Many employers in environmental consulting firms and other industries require 40-hour osha training.) The course will count as an elective in the environmental studies major.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1332", "course_title": "ENVIRONMENTAL ADVOCACY AND ACTION", "description": "Environmental Advocacy is much more than simply advocating. To be effective, you must also take Action, and although \"enthusiasm\" goes a long way, volunteers and professionals alike need a wide range of skills in order to make a lasting impact. This includes planning successful events, running effective meetings, communicating science, writing grants, accounting & mind-numbing IRS paperwork, avoiding burn-out, and dealing with the media, volunteers, government and people who don't agree with you. It can be overwhelming even to those who know what to expect! And don't forget about the actual goal: Making a difference. This course covers the \"inner workings\" of environmental advocacy. We go beyond the slogans, logos, direct mail, and big events to study what's behind the nonprofit world, what it takes to succeed at the grassroots. Speakers from the Pittsburgh environmental community will share their experiences, concerns, and perspectives most weeks, and a wide range of readings and assignments are designed not only to have students take a deep look, but to experience some of this world, too.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1333", "course_title": "SUSTAINABILITY", "description": "Sustainability is a term that has many meanings, depending on who's using it, and we will cover most of them in this class, from green campuses to green-washing. The class features guest speakers from the academic, governmental, nonprofit and business sectors to offer as many perspectives as possible on sustainability topics. The real focus of the class, though, is the development of sustainability projects on campus and in the Pittsburgh community. Students also participate in sustainability-related events and field trips with the opportunity to present their work to a larger audience at the end of the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1342", "course_title": "ENVIRONMENTAL ISSUES", "description": "This course will cover a range of issues in our environment including but not limited to air quality, water quality, mining and gas, and parks and forests. The focus of the class will be on researching, preparing, and revising written assignments on environmental issues. To accomplish this, the class will help students (1) identify environmental issues of interest, (2) organize around a single aspect of the chosen issue, and (3) prepare written assignments that will be reviewed and edited to meet standards of publication (e.g. traditional research paper, a proposal, or long-form journalism).", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1445", "course_title": "GIS, GPS, AND COMPUTER METHODS", "description": "The goals of this course are to gain expertise in spatial analysis and geographical information systems.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1460", "course_title": "INTRODUCTION TO REMOTE SENSING", "description": "This course provides a foundation in the theory, techniques and applications of remote sensing and geospatial data visualization spanning the electromagnetic spectrum. Topics include light/matter interaction, optics and sensor design, image analysis, as well as current applications of remote sensing to science and engineering problems facing local and global populations. The course and integrated image-processing laboratory are designed to provide the student with a strong foundation of remote sensing science.", "completed": false, "prereq_count": 0}, {"dept_code": "GEOL", "id": "1516", "course_title": "ENVIRONMENTAL GEOCHEMISTRY WITH LAB", "description": "This course explores the complex interactions of Earth's rock, water, air, and life systems that determine the chemical characteristics of our environment. We will examine the distribution, cycling, and transport of chemical compounds in the atmosphere, hydrosphere, and terrestrial environment on local and global scales. Topics will include water chemistry, organic and inorganic pollution and related toxicology, hazardous wastes, acid rain, acid mine drainage, photochemical smog, ozone depletion, and global climate change. We will learn related laboratory and field techniques for geochemical analysis of water and soil in the laboratory section. Lecture (3 hours) and Lab (3 hours).", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1641", "course_title": "ECOSYSTEM ECOLOGY", "description": "This course will provide students with an introduction to the principles of ecosystem ecology and associated applications to environmental change. Broad course themes include descriptions of the physical environment, community ecology, ecosystem ecology, ecological biogeography, and human ecology.", "completed": false, "prereq_count": 1}, {"dept_code": "GEOL", "id": "1907", "course_title": "EXPERIENCE IN UNDERGRADUATE TEACHING", "description": "", "completed": false, "prereq_count": 0}], "links": [{"source": "0055", "target": "1001"}, {"source": "0055", "target": "1020"}, {"source": "0055", "target": "1309"}, {"source": "0055", "target": "1516"}, {"source": "0800", "target": "1050"}, {"source": "1030", "target": "1641"}]}