{"nodes": [{"dept_code": "CHE", "id": "0100", "course_title": "FOUNDATIONS OF CHEMICAL ENGR", "description": "This course combines elements of mass and energy balances, thermodynamics, separations, and product design in order to set the foundation for the remainder of the chemical engineering curriculum. This course introduces chemical engineering problem solving techniques from both a (traditional) process-centric viewpoint as well as a product centric viewpoint. The course will span from theoretical (basic thermodynamics) to applied (separations) allowing a simple route to problem-based learning of difficult theoretical concepts.", "completed": false}, {"dept_code": "CHE", "id": "0101", "course_title": "FOUNDATIONS OF CHE LABORATORY", "description": "The lab course associated with CHE 0100. Experiments and lectures will reinforce the content of CHE 0100.", "completed": false}, {"dept_code": "CHE", "id": "0300", "course_title": "TRANSPORT PHENOMENA", "description": "Stresses analogies between the three modes of transport phenomena; momentum, mass, and heat transport. Covers from the molecular origins of transport up through continuum descriptions, as well as macroscopic balances. Reynolds and Colburn Analogies in Boundary-Layer Flow as well as direct comparison of linear transport relations, such as fluid drag and mass/heat convection will be a primary focus. Problems ranging from (traditional) packed bed reactors to micro-fluidics or micro-electromechanical systems will also be discussed.", "completed": false}, {"dept_code": "CHE", "id": "0301", "course_title": "TRANSPORT PHENOMENA LABORATORY", "description": "The lab course associated with CHE 0300. Experiments and lectures will reinforce the content of CHE 0300.", "completed": false}, {"dept_code": "CHE", "id": "0500", "course_title": "SYSTEMS ENGINEERING 1: DYNAMICS AND MODELING", "description": "The dynamics and modeling class is the first of a two-part systems engineering sequence. This course covers dynamical analysis of process systems, process control fundamentals, feedback, basic process modeling, and optimization. The course covers industrial-style examples from a multi-scale perspective by incorporating molecular insight into process variable calculations and large-scale information through process simulation (computer-aided design) software.", "completed": false}, {"dept_code": "CHE", "id": "0501", "course_title": "SYSTEMS ENGINEERING 1: DYNAMICS AND MODELING LABORATORY", "description": "Laboratory experience accompanying CHE 0500. Both physical and computational experiments will be performed.", "completed": false}, {"dept_code": "CHE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "The departmental seminars are designed to acquaint the student with aspects of engineering which are normally not encountered in classes.", "completed": false}, {"dept_code": "CHE", "id": "1754", "course_title": "PRINCIPLES OF POLYMER ENGINEERNG", "description": "This course deals with the elements of polymer science and engineering necessary for entry-level understanding of polymer technology. While the chemistry determines macromolecular microstructure, an understanding of polymer manufacture and processing requires the addition of physical chemistry and transport phenomena. The essential material covered in this class includes the elements of polymers thermodynamics, rheology, mechanical behavior, and equipment design.", "completed": false}], "links": [{"source": "0100", "target": "0101"}, {"source": "0300", "target": "0301"}, {"source": "0300", "target": "0500"}, {"source": "0500", "target": "0501"}]}