{"nodes": [{"dept_code": "CLASS", "id": "0010", "course_title": "GREEK CIVILIZATION", "description": "A general introduction to the culture and society of Ancient Greece, with emphasis on the Archaic Period and the fifth and fourth centuries B.C.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0020", "course_title": "ROMAN CIVILIZATION", "description": "A general introduction to the culture and society of the Roman world, with emphasis on the period of the republic and the early empire.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0030", "course_title": "MYTHOLOGY IN THE ANCIENT WORLD", "description": "This course examines in cultural context the traditional stories--myth, legend, and folktale--of the ancient Greeks and Romans. Theories drawn from various disciplines are critically evaluated. Attention to connections with ritual practice and to expression in daily life, art, architecture, etc.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0032", "course_title": "ATHLETICS OF THE ANCIENT WORLD", "description": "This course examines athletic competition, popular games, gladiatorial and other exhibitions of the ancient Greeks and Romans. Much emphasis on the social/cultural context and underlying values. Attention to relevant artistic archaeological, and historical settings.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0040", "course_title": "SEX AND LOVE IN ANCIENT LITERATURE", "description": "This course investigates representations of sex and romantic love in ancient Greece and Rome, considering how ancient literature treats issues like marriage and infidelity, sex work and slavery, homosociality and homosexuality, and consent and rape. We will engage with a variety of genres of ancient literature, from epic and lyric poetry, to drama and philosophy, to funerary epitaphs, handbooks, and novels. We will read the canonical literature of \"dead white men,\" alongside women writers like Sappho and Sulpicia, as well as documentary texts, especially curse tablets and funerary monuments, that paint a picture of lived experiences in the ancient world. We will also read selections from post-classical literature to explore how modern ideas about love, sex, beauty, and desire have been shaped by their representation in ancient texts.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0100", "course_title": "MASTERPIECES GREEK AND ROMAN LITERATURE", "description": "An introduction to the critical analysis of literary works through the medium of selected masterpieces of Greek and Roman literature in English translation.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0330", "course_title": "MYTH AND SCIENCE", "description": "The Greeks in the sixth to fourth century B.C. Initiated forms of thinking we have from then on called \"scientific\" and \"philosophical\". This course examines the question of how science is distinguished from \"non-science\" by studying the role of myth and science in ancient Greece. The aim is to understand what distinguishes the ideas of the first scientists and philosophers from those earlier beliefs called myth.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "0618", "course_title": "DEATH IN THE ANCIENT WORLD", "description": "The death of a loved one is an emotional and powerful occurrence that provokes a variety of human responses. In addition to writings describing their funerary practices, the civilizations of the ancient Mediterranean region have left artistic representations of death and dying, built tombs, and objects associated with funerary rituals. The study of these texts, images, structures, and objects allows us to better understand ancient attitudes and reactions to death. This undergraduate lecture focuses on the visual and material evidence of funerary practices and beliefs in ancient Egyptian, Greek, and Roman societies. The subject will be approached thematically. First, we will explore how archaeologists discover death-related artifacts and how scholars approach the study and reconstruction of ancient death rituals. Ancient practices and beliefs regarding the mummification, the funeral, commemorative strategies, visits to the grave, and the afterlife will be explored, and images found on specific media (vases, sculpture, built tombs, paintings) will be discussed in depth. The course will conclude with discussions of the roles that sensational topics, like fear of the undead (zombies, vampires, and ghosts) and spectacles of death (gladiatorial contests and public executions), played in ancient Mediterranean civilizations.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1022", "course_title": "THE AUGUSTAN AGE", "description": "A survey of the political, intellectual, literary, and artistic achievements of Rome in the time of Augustus.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1050", "course_title": "COMPUTER METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct the text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1140", "course_title": "GREEK TRAGEDY", "description": "Study of representative plays by the three great tragic dramatists of ancient Greece; Aeschylus, Sophocles, and Euripides. All readings are in English translation.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1210", "course_title": "GREEK HISTORY", "description": "A survey of the history of ancient Greece, with special emphasis on political and social developments during the fifth century B.C.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1220", "course_title": "ROMAN HISTORY", "description": "A survey of the history of Rome from the earliest times through the late empire, with particular emphasis on political and social developments during the late republic and early empire.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1312", "course_title": "PLATO", "description": "This is an advanced undergraduate course examining Plato's main views both in their historical context, and as they influence our own thinking today; the relations between Socrates and the sophists are also studied.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1402", "course_title": "GRECO-ROMAN RELIGIONS", "description": "This course introduces students to religious texts and traditions in a formative era of Western civilization and culture. Our focus will be on the variety of religious expression in Greco-Roman culture, which flourished in the geographical area of the Mediterranean basin during the first five centuries of the common era. By considering such topics as debates about the nature of the gods and access to them (through oracles, ritual and magic), the emergence of the idea of the holy person, and a variety of religious traditions as expressed in prayer, ritual and art, students will encounter a rich religious imagination that is truly different from contemporary understandings of religion and yet strangely familiar as well. We will also explore the complete integration between religion politics in the ancient world.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1430", "course_title": "ORIGINS OF CHRISTIANITY", "description": "This course presents a historical-critical investigation of Christian origins. Special attention is paid to varieties of 1st century Hellenistic and Palestinian Judaism within the Greco-Roman world. Primary readings include selected Biblical passages and apocrypha, 1st century historians and philosophers (Josephus, Tacitus, Suetonius, and Philo), the New Testament corpus (including Paul and the Pastorals), and selected readings from the Dead Sea Scrolls. In addition there will be assignments from various modern New Testament critics, historians, and theologians.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1710", "course_title": "SANSKRIT 1", "description": "An introduction to the basic structure and vocabulary of Sanskrit. Approximately half of the course is devoted to an intensive survey of Sanskrit grammar and half to the reading of a selection from the Mahabharata.", "completed": false, "prereq_count": 0}, {"dept_code": "CLASS", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing-practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false, "prereq_count": 0}], "links": []}