{"nodes": [{"dept_code": "FR", "id": "0012", "course_title": "FRENCH KISS: LOVE, SEX, FRANCE", "description": "Taught in English. From kissing to romantic escapades, from Paris to the Riviera, from Tahiti to Marrakesh, France and the Francophone world have a highly recognizable profile in matters of sex and love. Sexual behavior is always culturally inflected, and it evolves through time in its creation of emotions, attachments, families and institutions. In this class, we will adopt a historical lens to retrace the cultural transformations of sex and love in the French cultural and social landscape. We will study contemporary visual and textual materials (especially film), and a variety of historical documents from the Middle Ages to the present day. We will address controversial issues such as virginity, adultery, same-sex relationships, women's sexual agency, gender definitions through sexuality, the shifting boundaries of pornography and other related matters. This course is open both to incoming and more advanced students. It will count toward the French major and minor as a course in English.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0014", "course_title": "INTRODUCTION TO FRENCH-SPEAKING CANADA", "description": "This course is an introduction to French-speaking Canada as a linguistic and cultural geopolitical entity. While principal focus will be on Quebec , we will also examine French-speaking areas contiguous with Quebec and various isolates and extensions of this sociocultural area. We will begin chronologically with a historical presentation of the province's history as part of various geopolitical entities, and then focus on more contemporary Quebec, the bid for independence and the quiet restlessness of a \"distinct society\" concerned with its survival", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0016", "course_title": "HISTORY OF FRENCH CINEMA", "description": "History of French Cinema: From Technological Marvels to Ubiquitous Screens French cinema is recognized the world over for its artistic daring, its sophisticated style, and its inimitable sense of cool. Indeed, the French like to say that they invented cinema. Whether true or not, moving images have been a central way through which the French understand themselves, their place in the world, and the impact that new forms of media technology have on everyday life. This course will take a historical perspective to French cinema and to our sense of what French cinema is. We'll track how French society has changed along with its cultures of making and consuming images, and we'll see how French films of the past can help us better understand the media-saturated present in which we live. Along the way, we'll look at silent films, classical-era sound films, films from the New Wave period, and contemporary films in a variety forms, including documentary, the musical, horror, art cinema, the essay film, postcolonial cinema, digital media, and much more. No previous course experience with cinema is presumed. This course will be run like a traditional French ciné-club in which students are introduced to some of the most important French films that we still talk about today and to the varied ways we watch, discuss, and write about films in general. The course will be taught in English; all readings will be available in English; and all films with have English subtitles.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0017", "course_title": "PARIS: URBANISM PAST AND PRESENT", "description": "This course embarks on a study of Paris as an ever-evolving urban center in time and space. A two-pronged approach sees the City of Light as both a geopolitic entity with a history of great importance and an idea that has influenced politics, society and the arts all over the world. The syllabus features both the diachronic evolution of Paris from Gallo-Roman times to the present day as well as the synchronic weight of Paris as place and notion both in and out of France.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0080", "course_title": "MODERN FRENCH NOVEL", "description": "What makes a great read? Is it plot? Characters? Breaking literary conventions? Immersing yourself in different times and different voices? Playing with your emotions? This course explores some of the great reads of modern and contemporary French literature to find out what defines \"the modern French novel.\" We will focus on developing your skills as discerning, attentive, feeling readers as we practice different ways to study, and enjoy, novels. This course is about you as a reader; it's also about you as a writer. As part of this W course, you will learn ways to troubleshoot common writing difficulties (finding a topic, formulating a thesis, revising). Together, we practice a process approach to writing that includes informal and formal writing, a variety of revision activities, and developing competence in critical writing functions and formats. Come for the great reads, and stay to create great writing!", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0088", "course_title": "AILING BODIES: NARRATIVES OF HEALTH AND ILLNESS", "description": "How can disease or illness be put into fictional form? Taught in English for a general audience, this course focuses on literary and cultural representations of disease from the perspective of the humanities. Topics may include Alzheimer's, anorexia, organ transplant, HIV-AIDS, and others. The novels that we will study all translate pain into language, and they rethink the doctor-patient relation and what an ailing body can do, as consequences of accident, illness, or disability. We will focus on contemporary literary texts from the French-speaking world and examine historical and cultural differences between France and the United States on medical issues such as organ donation, surrogacy, or vaccination. The French literary context is especially rich in the areas of medicine and health. Our approach will be informed by European philosophies of medicine, and we will investigate the narrative and aesthetic dimensions as well as the ethical stakes presented by a variety of types of texts. We will also examine how medicine interacts with, and redefines, notions of class, race, gender, and disability, and how science influences fictional, social, and political discourses on bodies. The course's focus on health and medicine should be of interest to premed/health/science students and anyone who wishes to study health topics from an interdisciplinary perspective. All texts will be read in English translation.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0090", "course_title": "EURO CHIC: THE INVENTION OF FASHION", "description": "Since the Renaissance, Italy and France have occupied a fundamental role in the establishment and development of fashion as a creative and commercial enterprise deeply rooted in cultural mores. The course address the historical shifts in the cultural understanding of gender roles, class belonging, consumption habits and expectations, the international circulation of craftmanship and celebrities, and technological innovation. We will start addressing the anthropology of body ornamentation, gender markings and the difference between costume and fashion. Our historical point of departure is the grand arrival of Catherine De Medici from Florence to Paris in 1547, following her marriage to King Henry II of France. We then follow the progressive establishment of Paris as the capital of European (and eventually international) fashion, together with Italian cities like Florence, Venice and Milan. We also take a significant detour through London during the \"dandy\" era of the early 19th century and the \"mod\" and \"punk\" trends of the decades between 1960 and 1980. Punk leads us into a discussion of current international \"anti-fashion\" trends, such as the politics and economics of privilege, cheap labor and environmental concerns about \"fast fashion.\" This course is taught in English. *This course may be used for the Italian Studies major (whether listed as FR 0090 or ITAL 0090), but does not count for the Italian major or the Italian minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0101", "course_title": "ELEMENTARY FRENCH 1", "description": "A study of the grammar and vocabulary of elementary spoken and written French. Stresses grammatical structure and its correct application.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0102", "course_title": "ELEMENTARY FRENCH 2", "description": "A continuation of elementary French 1. A study of the grammar and vocabulary of elementary spoken and written French. Stresses grammatical structure and its correct application.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0103", "course_title": "INTERMEDIATE FRENCH 1", "description": "This course is a logical continuation of the first-year sequence. Emphasis continues to be placed on the oral aural skills, but the reading and writing skills become increasingly stressed.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0104", "course_title": "INTERMEDIATE FRENCH 2: FRENCH IN A GLOBAL CONTEXT", "description": "What does it mean to speak French in today's globalized world? Find out in French 0104! This second-year course in French language and Francophone cultures approaches French or rather \"Frenches\" as an umbrella term for the spoken and written conventions of multiple French-speaking spaces that go well beyond the borders of modern France. We explore the global use of the French language as a cognitive and communicative vehicle that spans six continents and is now official in 29 countries. Emphasis is on communicative, cultural and cognitive competencies in the various Frenches of the world. The course integrates the study of pronunciation, grammar, and vocabulary with the topics of the course. By the end of the semester, students will be able to identify the salient features of different Francophone accents (sounds, words, and structures), all while engaging in spontaneous conversation or written communication on familiar topics using dialect-appropriate vocabulary and grammar. Though class discussions and the study of primary visual, written and sung texts, we will consider questions such as: How precisely is French \"global\"? How is the French spoken in one part of the world different from that spoken in other parts of the world? How do different Frenches reflect different cultural values? How does migration function between Francophone cultures? Prerequisite: FR 0103, placement, or equivalent. Fulfills DSAS General Education Requirement in Global Issues. Language of instruction: French.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0106", "course_title": "CONVERSATION HOUR", "description": "This course is a one-hour weekly conversation workshop taught at the level of French 0103/0104. It is open to all students who have taken French 0102 at Pitt or equivalent elsewhere or who have the same proficiency level as would be expected after completion of such courses. We will approach oral skills in a relaxed and low-stakes environment. Based on the interests of the class, we will engage in various types of \"conversation,\" including, but not limited to, current events in various Francophone polities, cultural products, practices and perspectives as well as speaking practice through debate and role-play. This course is meant to provide an arena to practice French and extra practice for students in 3-credit French language courses (especially 0103 and 0104) desirous of increasing their accuracy and fluency in the spoken language. It also serves students who want to maintain their French skills in order to enroll in a French course in a future semester. Grades will be calculated based on attendance and active participation in class. This course does not satisfy the Dietrich School language requirement.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0220", "course_title": "FRANCE IN THE 21ST CENTURY", "description": "Who are the French today? What role have historical events played in defining the country and its people? What perceptions do the French have of themselves? How do geography, urbanism, and regionalism define the French? Are Parisians really snobs? What do the French have to say about current social and political movements and ideologies related to democracy, capitalism, socialism, globalization, post-colonialism, multiculturalism, far-right nationalism, racism, Islamophobia, feminism, and sexuality? This course investigates these questions and more, while delving into the habits and behaviors of the French in their daily lives. To this end, students will study recent articles, videos, and other media. Recommended prerequisite: FR 0004 or 0104 or 0021/0221 or 0027/0227 or 0055/0255 or 0056/0256.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0221", "course_title": "READING FRENCH: LITERATURE, MEDIA, CULTURE", "description": "How do French-speakers today experience media such as video games, graphic novels, literature, film, YouTube, medieval manuscripts, pre-modern books, and others in the digital age? This course examines how stories get told in French across different kinds of media; in illuminated manuscripts and graphic novels, in novels and films, in video games and fan fiction. You'll encounter some of the \"classics\" of French literature; and you'll explore how these classics have been rethought, remediated, and revitalized for new media and new audiences in exciting ways. This course practices a supportive, structured approach to language acquisition, with a focus on boosting and enhancing your reading skills in French. Taught entirely in French. Recommended prerequisite: FR 0004 or 0104 or 0027/0227 or 0055/0255 or 0056/0256.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0227", "course_title": "THE FRENCH ATLANTIC", "description": "This course is a study of the history of French colonization of the \"New World\" of the Americas from the sixteenth to mid-twentieth centuries, just after the second World War. By adopting an \"Atlantic\" approach, we will examine Europe, Africa and the Americas as interconnected regions. The course explores several themes: Voyages et Rencontres; les Français en Amérique du Nord; la Traite des Noirs; les Lumières et le Nouveau Monde; et Révolution à Saint-Domingue. Although each theme treats a different region and highlights a different time period, our approach will allow us to follow the writings of explorers, philosophers, administrators, generals, merchants, and former slaves around the Atlantic, from the coasts of France and West Africa, to the eastern United States, and south to the Caribbean and South American mainland. The course will be conducted in French.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0255", "course_title": "SPEAKING FRENCH: ATELIER D'EXPRESSION ORALE", "description": "As an oral skills course, French 0255 approaches speaking French in real life contexts. Focus is on speech acts. Students will learn how to present, narrate, describe, and speak French in various registers (from very informal to very formal) and with tact. We will continue to work on vocabulary building and grammatical mastery so that students are able to use French as needed to carry out various daily, professional and personal functions. Some examples of the speech acts we will learn to execute include: how to present oneself and one's peers, how to describe in detail people, places and things, how to narrate in the present, past and future, how to express and support points of views. These various speech acts will serve a larger framework of real life scenarios students may encounter later on in their studies or careers, for example when interviewing for a job, when interviewing others for a job, when speaking in front of a group, when speaking with colleagues, when running a meeting, when providing consulting services. The study and practice of spoken French is thus concentrated on the social turn and use in context. This course is taught entirely in French. Recommended prerequisite: FR 0004 or 0104 or 0021/0221 or 0027/0227 or 0056/0256.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0256", "course_title": "WRITING FRENCH: ATELIER D'EXPRESSION ECRITE", "description": "Question: What do Samuel Becket, Edith Philips, and Oscar Wilde have in common? Answer: they are all exophonic writers, writers who wrote in languages that were not their native tongues. And they were all English-speakers who wrote some or most of the their work in French. You can too! What are the secrets to writing well in a language that is not your first? How can you leverage all you know about writing in your native language to improve your written expression in French? \"Writing French: Atelier d'expression Ecrite\" will teach you how to cultivate exophonic writing skills through a writing-as-process approach that is keyed to the challenges of foreign language composition. Class work and written assignments will include writing effective professional and personal correspondence, composing a CV or job resume, writing journal articles and critiques as well as creative pieces (such as fables, poems, or song lyrics for a Francophone audience). Through textual modeling, cooccurrence analysis (words that go \"together\"), and comparative vocabulary and grammar review, you will learn techniques needed to write in a variety of genres and to \"sound French.\" Recommended prerequisite: FR 0004 or 0104 or 0021/0221 or 0027/0227 or 0055/0255.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "0258", "course_title": "ADVANCED FRENCH CONVERSATION", "description": "An advanced conversation course in French for majors and non-majors who wish to maintain or improve their command of the French language through a discussion of contemporary topics. This one-unit class at once builds on and complements French 0055/0255. It is designed to improve students' oral proficiency and sociolinguistic competence through contextualized simulated immersion. The course is divided into four sections, each demanding different, but complementary social and linguistic skills, to wit 1) getting to know people and places; 2) current events; 3) debate and disagreement; 4) cultural comparisons. Emphasis is on acquiring the authentic oral communication skills, in the widest sense of the term, necessary to navigate expertly French-speaking environments. This course can be repeated, but can only be counted toward the French major/minor once.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "1039", "course_title": "VARIETIES OF WORLD FRENCH(ES)", "description": "Dans ce cours, nous retracerons l'évolution de l'espace francophone (la « Francophonie ».) Bien que la sociolinguistique historique fasse partie de notre programme, nous privilégierons davantage les questions synchroniques. Nous analyserons donc les caractéristiques des français différents (en Amérique du Nord, en Amérique du Sud, en Afrique, en Asie et en Europe) en tenant compte des distinctions phonétiques, phonologiques, morphologiques, lexicales, sémantiques, syntaxiques et pragmatiques de ces variétés socio-géolectales. À la fin du semestre, vous serez capables de distinguer les variétés du français en vous rapportant à l'interface de ces caractéristiques linguistiques et les milieux sociaux dans lesquels elles se manifestent. Une telle appréciation vous aidera également à mieux maîtriser le français et donc à mieux vous exprimer, car vous aurez acquis des connaissances plus approfondies de la langue telle qu'elle s'emploie-à l'oral, à l'écrit et en tant que symbole culturel-partout dans le monde. COURS PRÉALABLES: FR 0104 + au moins deux cours de la série suivante: 0220, 0221, 0227, 0255, 0256 ou la permission du professeur.", "completed": false, "prereq_count": 0}, {"dept_code": "FR", "id": "1070", "course_title": "GENDER AND SEXUALITY IN 21ST CENTURY FRANCE", "description": "French culture has always had much to say about questions of gender and sexuality. In this course, we will consider key cultural products, perspectives, and practices around the concept of gender broadly conceived, including masculinity, feminism, hetero/homosexuality, transgenre, and others. Questions of nation, race, and ethnicity will factor into our discussions as well, and we will think often about the words or language that texts employ to talk about gender. We will also engage in cross-cultural comparison between France and our own cultural context(s) to give us comparative insight into the world we live in. We will treat questions such as: What is the current 'crisis' in French masculinity? What does it mean to be a man today in France? What is the current state of feminism in France, and how does it differ from previous incarnations? How does the discourse of homosexuality and queerness compare to the US context? What does transgenre signify? When and how did transgenre appear as a category in France? How are French constructs of gender inflected with Arab or North African identities? What other recurring forms of intersectionality are there? And how is all this represented in cultural texts? Our focus will be French culture since the turn of the century. Taking an interdisciplinary cultural studies approach, this is not a literature course per se (though we will read some literature). To aid us in our task, we will discuss and analyze a wide variety of recent texts in French from the 21st century: comic books (BD), films, documentaries, YouTube videos, music, webpages, journalistic prose, manifestos, political and government tracts, school textbooks, autofiction, novels, children's literature, pop psychology, etc. As the course is taught entirely in French and all written work is in French, you will increase your linguistic proficiency in reading, writing, speaking, and listening. You will also acquire the semantic tools you need to talk and write about gender and sexuality in French. Prerequisite: at least six credits above French 104, or permission of the instructor.", "completed": false, "prereq_count": 0}], "links": []}