{"nodes": [{"dept_code": "HRS", "id": "1001", "course_title": "CASE STUDIES IN THE HEALTH AND REHABILITATION SCIENCES", "description": "This interprofessional course will provide a dynamic introduction to the health and rehabilitation professions through case study representations and interactive engagement with faculty and students from the programs being represented each class. Students in the course will gain insight into each of the disciplines in the School of Health and Rehabilitation Sciences and the intersection with medical professions to create effective interdisciplinary healthcare teams.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1006", "course_title": "INTRO TO HUMAN NUTRITION", "description": "This course will cover an overview of the scientific principles of nutrition and application of these principles to humans throughout the life cycle. Major focuses of the course are the classification and function of the six major nutrients, review of current nutrition standards, safety of the food supply, and nutrition misinformation.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1011", "course_title": "CLINICAL SCIENCES IN HEALTH INFORMATION MANAGEMENT", "description": "This course has multiple topics, including an introduction to the structure of human cells, tissues, organs and organ systems, and functions associated with them; a general overview of the predisposing factors and direct causes of disease, as well as their effects on the human body; an introduction to pharmacology; and word construction, pronunciation, spelling, definition and use of terms related to all areas of medical science, hospital service and health related professions.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1017", "course_title": "INTRODUCTION TO EPIDEMIOLOGY", "description": "This course will introduce basic concepts of epidemiology for professionals in health and rehabilitation. Descriptive epidemiology, morbidity and mortality studies, and experimental epidemiology will be some of the topics explained and addressed.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1023", "course_title": "HUMAN PHYSIOLOGY", "description": "This course has been designed in an effort to provide pre-clinical students with a foundational scientific knowledge base and conceptual understanding of physiological processes. Each organ system, and its contribution to the maintenance of homeostasis, will be discussed. Further, the essential components of each system will be explored, to the extent that life is supported. Some disease states will be discussed, in order to exhibit certain processes.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1701", "course_title": "INTRODUCTION TO ORTHOTICS AND PROSTHETICS", "description": "This will be a lecture, seminar, and laboratory course introducing some of the applied science and clinical aspects of the orthotics and prosthetics professions. Topics include: an overview of the profession; introduction to some basic anatomy, kinesiology and biomechanics related to orthotics and prosthetics; some pathologies, disabilities, injuries treated with orthoses or prostheses; introduction to patient evaluation and measurement; and introduction to fabrication of custom orthotics and prosthetics, using laboratory equipment. The course will be taught using hypothetical or actual case studies.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1709", "course_title": "DSGN/FABRICATION WITH ENGR MATLS", "description": "Course designed to teach students basic skills of designing and fabricating mechanical mechanisms and components. Solely lab based and will use \"learn by doing\" approach. Students gain experience working with engineering materials such as wood, plastics, aluminum, brass and steel. Fabrication techniques of turning, milling, cutting, drilling, tap ping and welding will be used. Participate in the design and fabrication of various devices with increasing complexity. Shop safety, tool section, and equipment maintenance will be an important component of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1746", "course_title": "SERVICE LEARNING THROUGH SUPERVISED FIELD PLACEMENTS IN REHAB AGENCIES", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "HRS", "id": "1909", "course_title": "SUSTAINABLE FOOD SYSTEMS", "description": "Our food system is a multifaceted network of interconnected systems and relationships. In order to be able to feed ourselves well into the future, it must be sustainable. A sustainable food system is a system in which healthy food is provided to people while balancing the environmental, social and economic impacts. These dynamics force stakeholders to confront synergies and tradeoffs in agricultural practices, harvesting, transportation, manufacturing and distribution, healthy diets, and a reduction in wasted food.", "completed": false, "prereq_count": 0}], "links": []}