{"nodes": [{"dept_code": "STAT", "id": "0200", "course_title": "BASIC APPLIED STATISTICS", "description": "This course teaches methods of descriptive and inferential statistics. Topics include data collection and description, hypothesis testing, correlation and regression the analysis of variance, and contingency tables. Students will learn how to use a statistical computer package.", "completed": false}, {"dept_code": "STAT", "id": "0800", "course_title": "STATISTICS IN THE MODERN WORLD", "description": "The course introduces statistical reasoning to a diverse audience. The main goal is the understanding of some basic statistical principles so that the student can understand research reports involving statistics and applications of statistics reported in the media. Statistical reasoning will be taught through the use of examples. An important part of the course will be a nontechnical discussion of controlled and randomized experiments. The subject matter will emphasize examples from the health and social sciences.", "completed": false}, {"dept_code": "STAT", "id": "1000", "course_title": "APPLIED STATISTICAL METHODS", "description": "This course is an intensive introduction to statistical methods. It is designed for students who want to do data analysis and to study further ideas in applied statistics beyond this course. The topics covered include descriptive statistics, elementary probability, random sampling, controlled experiments, hypothesis testing, regression and the analysis of variance. Emphasis will be placed on the statistical reasoning underlying the methods. Students will also become proficient at the use of a statistical software package.", "completed": false}, {"dept_code": "STAT", "id": "1050", "course_title": "DATA JAM: USING BIG DATA FOR COMMUNITY GOOD", "description": "This is a course that introduces students to the various aspects of big data science --- data visualization and analytics, engaging communities in using big data, and the ethics and equitable access to big data. The course will be co-taught by faculty with expertise in these various areas. Big Data Science is becoming increasingly relevant as big data is everywhere and its use is impacting almost every aspect of modern life. This is a \"hands-on\" learning experience as university students taking the course will also serve as mentors for teams of high school students in a local big data competition, The Pittsburgh DataJam (see http://pghdataworks.org to learn about the Pittsburgh DataJam).", "completed": false}, {"dept_code": "STAT", "id": "1100", "course_title": "STATISTICS AND PROBABILITY FOR BUSINESS MANAGEMENT", "description": "This is a one-term introduction to statistics and probability. Both modeling and data analysis will be emphasized. Various probability models for discrete and continuous variables will be analyzed. Inferential, descriptive and data analysis techniques will be covered with examples from management. A statistical package will be introduced and used to conduct data analyses.", "completed": false}, {"dept_code": "STAT", "id": "1151", "course_title": "INTRODUCTION TO PROBABILITY", "description": "This course presents at both a theoretical and applied level the basic probability concepts required for statistical inference. Topics include set theory and basic probability, independence and Bayes' theorem, discrete random variables and their distributions--Bernoulli, Binomial, Poisson, and geometric, continuous random variables and their distributions--uniform, exponential, gamma, beta, and normal, transformation of random variables, moment and moment generating functions, multivariate discrete distribution, marginal and conditional distribution and independent variables.", "completed": false}, {"dept_code": "STAT", "id": "1201", "course_title": "APPLIED NONPARAMETRIC STATISTICS", "description": "The purpose of this course will be to prepare students to use standard nonparametric tests for problems that frequently occur in applications. The Wilcoxon, Fisher (sign), Ansari-Bradley, Miller (jackknife), Kruskal-Wallis, Kendall, and Kolmogorov-Smirnov tests will be discussed. Minitab subroutines will be used to facilitate computation.", "completed": false}, {"dept_code": "STAT", "id": "1211", "course_title": "APPLIED CATEGORICAL DATA ANLYSIS", "description": "The purpose of this course is to provide contingency table techniques for research workers in the social sciences, medical sciences and other areas where it is necessary to investigate relationships between areas where it is necessary to investigate relationships between qualitative variables. The course deals with the chi-square test and standard 2x2 and RXC contingency tables, as well as log linear and other special types of contingency tables analysis.", "completed": false}, {"dept_code": "STAT", "id": "1261", "course_title": "PRINCIPLES OF DATA SCIENCE", "description": "This course is a gentle introduction to data science. Data science is an emerging interdisciplinary field stemming from statistics, mathematics and computer science. At its core, data science involves using automated methods to analyze massive amounts of data and to extract knowledge from them. The objective of this course is to provide students with a principled introduction to data science that properly combines inferential thinking and computational thinking. Students will learn the fundamental pipeline of data science, ranging from data acquisition, data clean-up, data exploration and visualization, modeling and inference, to professional reporting.", "completed": false}, {"dept_code": "STAT", "id": "1301", "course_title": "STATISTICAL PACKAGES", "description": "This course will cover a variety of topics concerning computing and statistics. Basic statistical analysis packages such as BMPD, SPSS, Minitab, and IMSL will be discussed and compared. Other computational issues that will be discussed include simulation, graphics, elementary database management, and certain stand-alone statistical programs.", "completed": false}, {"dept_code": "STAT", "id": "1331", "course_title": "FINANCIAL ECONOMETRICS", "description": "This course will provide a comprehensive and systematic account of financial econometric models and their applications to modeling and prediction of financial time series data, focusing on asset returns. Most of the emphasis is on applied time series modeling and forecasting. Students at the end of the course will have a working knowledge of financial time series data and gain expertise in statistical software to conduct the analyses.", "completed": false}, {"dept_code": "STAT", "id": "1341", "course_title": "SPORTS ANALYTICS", "description": "This course will explore various techniques for analyzing and assessing players and teams across the four major sports. Students will learn about advanced metrics in baseball, football, hockey, and basketball. The course will also cover different methods of rating sports teams, in-game win probability, Monte Carlo simulations, and the statistics behind sports betting. The statistical software package R will be used throughout the course.", "completed": false}, {"dept_code": "STAT", "id": "1631", "course_title": "INTERMEDIATE PROBABILITY", "description": "This course is the first half of a two term sequence in mathematical statistics intended for undergraduate students and graduate applied statistics majors. Topics to be covered include probability concepts, random variable, discrete and continuous variables, joint distributions, functions of random variables, and some sampling distributions.", "completed": false}, {"dept_code": "STAT", "id": "1651", "course_title": "INTRODUCTION TO BAYESIAN STATISTICS", "description": "This course will give an introduction to Bayesian statistics. Topics to be covered include prior and posterior distributions, multi-level models, model checking and selection, stochastic simulation by Markov Chain Monte Carlo.", "completed": false}], "links": [{"source": "0200", "target": "1201"}, {"source": "0200", "target": "1211"}, {"source": "1151", "target": "1631"}, {"source": "1151", "target": "1651"}, {"source": "1301", "target": "1341"}]}