{"nodes": [{"dept_code": "PEDC", "id": "0001", "course_title": "BEGINNING SWIMMING", "description": "For students who are unable to swim or who can swim very little. Opportunities are presented to learn basic functional aquatic skills and basic strokes. Students are permitted to set their own achievement goals. Instruction is on an individual basis.", "completed": false}, {"dept_code": "PEDC", "id": "0002", "course_title": "INTERMEDIATE SWIMMING", "description": "For students who have learned the mechanics of basic aquatic strokes and are interested in the development of proper rhythm and timing necessary for good performance in swimming. Students are permitted to set their own achievement goals. Instruction is on an individual basis.", "completed": false}, {"dept_code": "PEDC", "id": "0026", "course_title": "AQUATIC CONDITIONING", "description": "Good swimmers who want to learn how to use swimming to maintain or improve their physical fitness should register for this course. Students may determine their capacity for exercise, and they may learn how to apply this effort in the water.", "completed": false}, {"dept_code": "PEDC", "id": "0031", "course_title": "MODERN DANCE 1", "description": "Introduces the college student to modern dance as a point of view, rather than a particular technique. There will be exercises to increase strength, and flexibility, as well as to teach techniques of movement, exploration and improvisation. Emphasis is on developing a sensitive awareness of one's own body movement in time and space.", "completed": false}, {"dept_code": "PEDC", "id": "0033", "course_title": "BALLET 1", "description": "For absolute beginners introducing them to basic fundamentals of the classic ballet technique.", "completed": false}, {"dept_code": "PEDC", "id": "0034", "course_title": "BALLET 2", "description": "An intermediate class, taught as a continuation of ballet 1. Also a class for students who may have some ballet training before coming to college. Audition for class eligibility at the first class session or permission of instructor.", "completed": false}, {"dept_code": "PEDC", "id": "0041", "course_title": "JAZZ 1", "description": "Fundamentals of jazz dance for beginning dance students. Class includes warm-up, center floor, and cross floor movement combinations, contemporary jazz and pop music is emphasized.", "completed": false}, {"dept_code": "PEDC", "id": "0042", "course_title": "JAZZ 2", "description": "A continuation of the basic fundamentals learned in jazz 1. More emphasis is placed on longer routines and more complicated movement sequences. It is an intermediate jazz class.", "completed": false}, {"dept_code": "PEDC", "id": "0044", "course_title": "DANCE PRODUCTION", "description": "This course is designed to familiarize students with both the technical and production aspects of dance and to increase appreciation of dance in all its forms.", "completed": false}, {"dept_code": "PEDC", "id": "0048", "course_title": "RACQUETBALL 1", "description": "This course is designed to introduce the beginner to the significant components of racquetball. Three types of racquetball games, singles, doubles, and cut throat, will be introduced in conjunction with individual skill development. The grip, ready position, racquet swing, service, return of service, and shot making will be covered. Game strategies and rules and regulations will be reviewed.", "completed": false}, {"dept_code": "PEDC", "id": "0090", "course_title": "VARSITY SPORTS 1", "description": "Students may earn four credits in physical education by participating in a varsity sport. One credit only per term. Student must be a varsity athlete.", "completed": false}, {"dept_code": "PEDC", "id": "0091", "course_title": "VARSITY SPORTS 2", "description": "Students may earn one credit in physical education by participation in a varsity sport for his/her second term.", "completed": false}, {"dept_code": "PEDC", "id": "0135", "course_title": "BASKETBALL 1 - CO-EDUCATIONAL", "description": "Supervised competition follows a conditioning period in which individual skills and team strategy are stressed. Opportunity to improve on previously acquired skills and become a team member is provided.", "completed": false}, {"dept_code": "PEDC", "id": "0147", "course_title": "WATER SAFETY INSTRUCTOR", "description": "The water safety instructor course is designed to earn certification to teach American red cross swimming and water safety courses. The course focuses on planning, organizing, sequencing, skill development, and red cross operational policies and procedures.", "completed": false}, {"dept_code": "PEDC", "id": "0153", "course_title": "VARSITY SPORTS 3", "description": "Students may earn one credit in physical education by participation in a varsity sport for his/her third term.", "completed": false}, {"dept_code": "PEDC", "id": "0154", "course_title": "VARSITY SPORTS 4", "description": "Students may earn one credit in physical education by participation in a varsity sport for his/her fourth term.", "completed": false}, {"dept_code": "PEDC", "id": "0158", "course_title": "WEIGHT TRAINING - BEGINNER", "description": "A coeducational class designed to provide the student with the opportunity to develop and practice basic weight training techniques. With the guidance of the instructor, the student will be encouraged to develop an individualized self-designed program. The emphasis of this course will be placed on progressive-resistive exercises.", "completed": false}, {"dept_code": "PEDC", "id": "0164", "course_title": "PARTY DANCE", "description": "This class will focus on generic dance movements that you can use in social dance situations. Hip-hop, line dances like electric slide and achey-breaky, and free form styles will be highlighted. Understanding rhythm and moving rhythmically will also be included. Learn how to learn dance so you can feel confident at weddings, house parties and clubs. This is strictly for non-dancers that want to become dance confident.", "completed": false}, {"dept_code": "PEDC", "id": "0171", "course_title": "FITNESS KICK BOXING", "description": "Our exercise program is based on the concepts of boxing, karate, muay thai kick boxing, and total fitness accompanied by rhythmatic music. Conditioning is focused on the areas of endurance, strength, and flexibility; all of which can bring about positive physical changes in participating students. Aerobic and anaerobic power training with speed bay and heavy bag is part of the training module.", "completed": false}, {"dept_code": "PEDC", "id": "0175", "course_title": "AEROBIC FITNESS BOXING", "description": "Our exercise program is based on the concepts of boxing, karate, muay thai kick boxing, and total fitness accompanied by rhythmatic music. Conditioning is focused on the areas of endurance, strength, and flexibility; all of which can bring about positive physical changes in participating students. Aerobic and power training are a part of the enduring comprehensive training module.", "completed": false}, {"dept_code": "PEDC", "id": "0177", "course_title": "WEIGHT TRAINING - INTERMEDIATE/ADVANCED", "description": "A class designed for the student who is engages in resistance exercise and is interested in advancing their weight training techniques. With the guidance of the instructor, the student will engage in an individualized self-designed intermediate-to-advance resistance training program. The emphasis of this course is placed on progressive-resistive exercises, and is designed for the intermediate/advanced-level weight training exerciser.", "completed": false}, {"dept_code": "PEDC", "id": "0180", "course_title": "VOLLEYBALL 1", "description": "This course is designed to introduce the beginner to the significant components of volleyball. Basic skills to be taught will include the overhead volley, forearm pass, service spike, individual block and defensive recovery skills. A 4-2 right-side-setter offensive system will be introduced with a 6-back and a 6-up defensive system. All rules and regulations will be reviewed during the course.", "completed": false}, {"dept_code": "PEDC", "id": "0187", "course_title": "HIIT & CONDITIONING: AN INTRO COURSE TO APPLY HIIT & OTHER CONDITIONING PRINCIPALS", "description": "An introductory course to apply HIIT (high-intensity interval training) and other conditioning principals to enhance physical fitness. HIIT is a form of interval training that alternates short periods of intense anaerobic exercise with less intense recovery periods. This course will also include other conditioning opportunities to enhance total physical fitness.", "completed": false}, {"dept_code": "PEDC", "id": "0188", "course_title": "PADDLE BOARD YOGA", "description": "An introductory course on the practice and theory of the basic principles of paddle board yoga. This includes learning basic paddle boarding skills to allow for performance of yoga-based exercise while on the paddle board that progresses to the water in a pool. This unique class will provide students with a plan to focus on their particular bodies' strengths and weaknesses plus increase flexibility.", "completed": false}, {"dept_code": "PEDC", "id": "0193", "course_title": "PERSONAL FITNESS", "description": "An organized approach to health related fitness with diagnostic and prescriptive assessment. The emphasis is on an individual, self-designed program based on scientific principles with the goal of personal improvement and fitness knowledge of primary importance. Various types of exercise will be incorporated into class times.", "completed": false}, {"dept_code": "PEDC", "id": "0196", "course_title": "FIRST AID AND CPR", "description": "A 2-credit lab/lecture discussion course in which American red cross techniques of cardiopulmonary resuscitation (CPR) for the professional rescuer and community first aid and safety are presented. In addition to these skills, current methods of management and treatment of emergency illnesses and injuries are also taught. American red cross certification available to all students who meet the standards.", "completed": false}, {"dept_code": "PEDC", "id": "0197", "course_title": "BOOTCAMP FITNESS", "description": "If you want to increase your fitness level, burn fat, look great and feel fantastic, then take your workout to the next level in boot camp fitness! A typical class will include cardio exercise such as jump rope, jumping jacks, jogging as well as muscular endurance exercises such as push-ups, squats, lunges, etc. Everyone will be encouraged to excel to their very best but will not be pushed to the point of injury or pain. All exercises can be modified to suit each participant's needs.", "completed": false}, {"dept_code": "PEDC", "id": "0206", "course_title": "BODY SCULPTING 1", "description": "Exercise to music in this non-impact class designed to develop muscular definition, firming, toning, and strength. Weights and other resistive devices will be incorporated into workout routines.", "completed": false}, {"dept_code": "PEDC", "id": "0207", "course_title": "PILATES", "description": "The pilates method of body conditioning strengthens and tones muscles, improves posture, provides flexibility and balance, unites body and mind, and creates a more stream lined shape. Pilates is great for people of all ages and fitness levels, as it uses your body's own natural resistance to define and elongate the muscles.", "completed": false}, {"dept_code": "PEDC", "id": "0222", "course_title": "CYCLE EXERCISE", "description": "This class if for anyone that wants a killer cardiovascular workout without being bored on a traditional cardio machine. Spinning bikes simulate an outside ride by allowing you to change positions on the bike as well as resistance to simulate hills. This class will incorporate sprints, seated climbs, standing climbs, jumps and more for an anything-but-boring workout! During the class, you can work at your own intensity level whether it is light to moderate or vigorous. Spinning is great for anyone and everyone including cyclists as well as those of you that aren't the best of cyclists. No bike riding experience is necessary for this class.", "completed": false}, {"dept_code": "PEDC", "id": "0231", "course_title": "SOCCER 1", "description": "For the beginner who wishes to develop competence in the skills, rules, and strategies required for participation in soccer.", "completed": false}, {"dept_code": "PEDC", "id": "0232", "course_title": "TOUCH FOOTBALL 1", "description": "A co-educational course designed to provide the student with an opportunity to develop the fundamental skills of football, along with experimenting with organized competition in touch football games.", "completed": false}, {"dept_code": "PEDC", "id": "0262", "course_title": "YOGA 1", "description": "An elementary course on the practice and theory of the basic principles of yoga. This class will provide students with a plan to focus on their particular bodies' strengths and weaknesses plus increase flexibility.", "completed": false}, {"dept_code": "PEDC", "id": "1300", "course_title": "NUTRITION IN EXERCISE AND SPORT", "description": "This course will provide the student with basic nutritional information as it pertains to sport and exercise performance. Topics of discussion include weight reduction and management, nutritional requirements for athletic performance and maintenance of a healthy lifestyle, proper eating habits, diet fads, disordered eating, and supplementation.", "completed": false}], "links": [{"source": "0090", "target": "0091"}, {"source": "0091", "target": "0153"}, {"source": "0153", "target": "0154"}]}