{"nodes": [{"dept_code": "REHSCI", "id": "1000", "course_title": "PRINCIPLES OF RESEARCH METHOLOGY", "description": "The study of the nature of research and the applications of the scientific approach in the research procedures. The course focuses on concepts, design techniques and interpretations, as well as limiting factors and ethical considerations.", "completed": false}, {"dept_code": "REHSCI", "id": "1200", "course_title": "HUMAN ANATOMY", "description": "This course uses lecture and laboratory experiences to teach the anatomical structures of the human body. Content focuses on gross human anatomy with particular reference to the musculoskeletal, nervous, cardiovascular and respiratory systems. Emphasis has been laid on application of knowledge of human anatomy in diagnostics of commonly encountered diseases/injuries. Students are encouraged to use their knowledge of anatomical structures learned in class to create such clinical scenarios as a part of learning.", "completed": false}, {"dept_code": "REHSCI", "id": "1201", "course_title": "HUMAN ANATOMY LAB", "description": "This course uses lecture and laboratory experiences to teach the anatomical structures of the human body. Content focuses on gross human anatomy with particular reference to the musculoskeletal, nervous, cardiovascular and respiratory systems. Emphasis has been laid on application of knowledge of human anatomy in diagnostics of commonly encountered diseases/injuries. Students are encouraged to use their knowledge of anatomical structures learned in class to create such clinical scenarios as a part of learning.", "completed": false}, {"dept_code": "REHSCI", "id": "1205", "course_title": "HUMAN PHYSIOLOGY", "description": "This basic human physiology course covers general physiological processes, muscles, blood and lymph, body fluids, renal function, respiration, metabolism, and the nervous, gastrointestinal, cardiovascular and endocrine systems. Problem-based formats will be introduced with particular reference to those problems seen in clinical settings.", "completed": false}, {"dept_code": "REHSCI", "id": "1206", "course_title": "HUMAN PHYSIOLOGY LAB", "description": "Detailed study of the functioning, integration and interrelationships of the organ systems of the human body using lecture and lab exercises. Topics will include microscopy, cell transport, bone and joint movement, EMG, EEG, Blood, Cardiovascular including: ECG, blood pressure and heart sounds, pulmonary function, urinalysis and digestion. Must be in or previously taken RESCHI 1205 to register for this lab.", "completed": false}, {"dept_code": "REHSCI", "id": "1210", "course_title": "NEUROSCIENCE", "description": "This course studies the basic structure and function of the central and peripheral nervous system. There is an emphasis on the effects of lesions of the nervous system on human function and disability.", "completed": false}, {"dept_code": "REHSCI", "id": "1215", "course_title": "EXERCISE PHYSIOLOGY", "description": "This course focuses on the effects of exercise in preventing and treating disability, in optimizing the rehabilitation process, and in maintaining the health of those with disabilities. The course emphasizes the effects of exercise on the various body systems, including the cardiovascular, neuromuscular, and musculosketetal, in individuals with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1216", "course_title": "EXERCISE PHYSIOLOGY LAB", "description": "Required lab component for REHSCI 1215 Exercise Physiology: This course focuses on the effects of exercise in preventing and treating disability, in optimizing the rehabilitation process, and in maintaining the health of those with disabilities. The course emphasizes the effects of exercise on the various body systems, including the cardiovascular, neuromuscular, and musculosketetal, in individuals with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1225", "course_title": "INTRO TO REHABILITATION SCIENCE", "description": "This course will introduce students to the criteria on which they will be judged in the graduate school application process and topics related to professionalism. Recommended readings will prepare the student to develop basic skills for reading and interpreting research articles. Various researchers and clinicians from within the University of Pittsburgh and the University of Pittsburgh Medical Center will be invited to share their research studies and/or clinical experiences and perspectives.", "completed": false}, {"dept_code": "REHSCI", "id": "1230", "course_title": "REHABILITATION ETHICS", "description": "This course explores ethical issues of: human value development, decision making, basic principles of health care, the nature of rights, confidentiality and management of health care information, professional gate keeping as a function of role fidelity, autonomy and paternalism, justice and the allocation of scarce resources, withholding and withdrawing life support, euthanasia, abortion, AIDS and health care practice, genetic science, and trans-cultural health. Students will work in teams to create presentations from these various topics for their colleagues. This is a highly interactive program of instruction and requires student be actively engaged in the learning process.", "completed": false}, {"dept_code": "REHSCI", "id": "1235", "course_title": "MEDICAL TERMINOLOGY", "description": "This course is designed to introduce students to the fundamentals of medical terminology. It includes word structure of basic medical and surgical terms and procedures, body parts and organs, body systems, selected medical specialties, and commonly used medical abbreviations and symbols. This course is a self-directed learning course, using a programmed text, with online quizzes (through Blackboard) and a final exam administered in a classroom.", "completed": false}, {"dept_code": "REHSCI", "id": "1240", "course_title": "ISSUES IN HEALTH CARE", "description": "This course is intended as a survey of current health care issues in the United States and will focus on major trends, issues and problems facing health care professionals and policy makers. In particular, an overview of the US health care system, the role of government, its payers (public and private), health policy, regulatory and accrediting bodies, and an analysis of timely challenges and issues are discussed. Specific topics covered are intended to be representative (not all inclusive) of public and/or service delivery issues widely discussed in current literature. Class participation and assignments will focus on application of principles discussed to current and emerging issues.", "completed": false}, {"dept_code": "REHSCI", "id": "1245", "course_title": "HUMAN DEVELOPMENT", "description": "This course follows the development of individuals and highlights the role of rehab science professions from conception until the end of life. It combines theory, research, and practical applications from developmental psychology. Lecture topics include genetic influences on development; prenatal and birth factors; physical, cognitive, social, personality, and cultural variables that influence development across the life-span.", "completed": false}, {"dept_code": "REHSCI", "id": "1280", "course_title": "PSYCH AND SOCLGY OF DISABILITY", "description": "Topics covered in this course include individual and societal views of persons with disabilities; both historical and current trends are discussed including disability rights legislation, independent living options, access to everyday living activities, education, employment, assistive technology, and the need for ongoing advocacy, as described by various guest speakers with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1285", "course_title": "INTRO TO EVIDENCED-BASED REHAB", "description": "This course provides basic skills in reading, reviewing, and critiquing the research literature in the rehabilitation sciences. These skills will be applied to the relevant literature in diagnosis, prognosis and intervention strategies within the spectrum of rehabilitation science. Students will learn to generate relevant research questions and utilize an evidence-based medicine approach to the review, appraisal and synthesis of current research articles within the fore-mentioned areas. The course will culminate in an individualreviewproject aimed at the development and resolution of one particular research question, using the best, current available literature. A basic understanding of research methods, design and or statistics is required.", "completed": false}, {"dept_code": "REHSCI", "id": "1290", "course_title": "PRACTICAL ISSUES IN DISABILITY", "description": "This course will review the natural progression of several age and non-age related physical disabilities such as Alzheimer's and Dementia, Parkinson's disease, CHF, COPD, DM, Spinal Cord injury, and Multiple Sclerosis (subject to change). When possible, individuals with disabilities are invited to participate in classroom discussions to share their first-hand experiences of living with a disability. This course will likely include an observational experience outside the classroom. This may include traveling to someone's home with a disability and/or their place of employment via public or a student's private mode of transportation. Additional details will be reviewed on the first day of class.", "completed": false}, {"dept_code": "REHSCI", "id": "1292", "course_title": "DIVERSITY AND CULTURAL ISSUES IN HEALTH, DISABILITY AND REHABILITATION", "description": "This course provides a forum for exploring issues of diversity and multiculturalism as they affect both daily interactions and professional practice in health care and rehabilitation. In this course students will build a greater understanding of: personal culture; how factors of culture and diversity influence an individual's health, living needs, and response to stress; international concepts of disability and health & rehabilitation services; and globalization and its relationship to rehabilitation. In addition, students will learn how to apply concepts of cross-cultural competence and intercultural communication to clinical services and program development.", "completed": false}], "links": [{"source": "1200", "target": "1201"}, {"source": "1200", "target": "1210"}, {"source": "1205", "target": "1215"}, {"source": "1205", "target": "1216"}]}