{"nodes": [{"dept_code": "BUSQOM", "id": "0050", "course_title": "QUANTITATIVE METHODS", "description": "Provides the foundations for two basic business disciplines; optimization and simulation. Various modeling concepts which have origins and have found wide applications in functional areas such as finance, marketing and operations will be studied in depth. The topics studied are linear programming; models of \"go/no go\" decisions and location decisions; \"what if\" analysis; decision analysis and multiple criteria decision making models; queuing models and statistical foundations to simulate business systems-input/output analysis.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSQOM", "id": "1070", "course_title": "OPERATIONS MANAGEMENT", "description": "Provides foundations for managing operations technology manufacturing & service & discussion of operations management of conversion process. Field is centered on the fundamental problems of managers taking raw materials & transforming them efficiently/effectively into products resulting in satisfied customers. Topics: bottleneck & capacity analysis, capacity expansion; decoupling workstations-buffers versus internal & external variability; economies of scale in materials distribution; reorder point computations; distribution & logistics; & scheduling res; GT, JIT, CIM & FMS.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSQOM", "id": "1080", "course_title": "DATA ANALYSIS FOR BUSINESS", "description": "The purpose of this course is to enhance the statistical and analytical skills of Pitt Business students, who have already taken the required STAT 1100 or STAT 1000 course, to the level necessary for them to deal with Data Mining and other essential material in the Business Analytics Certificate. The course should also be of interest to students exploring the analytical parts of other areas, such as marketing. The goals of the course are to: (1) cover material not currently treated in STAT 1100, but which is preparatory to Data Mining; (2) provide software skills in statistical packages used in business, such as SPSS, SAS, or R; and (3) provide experiential exposure to business applications of the material.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSQOM", "id": "1085", "course_title": "APPLIED BUSINESS ANALYTICS PROJECT", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "BUSQOM", "id": "1090", "course_title": "APPLIED OPTIMIZATION AND SIMULATION", "description": "The purpose of this course is to enhance the problem-solving skills of Pitt Business students to the level necessary for them to deal with complex decision problems using optimization and simulation. Building on the foundation provided in the required BUSQOM 0050 Quantitative Methods course, the topics herein will include linear, nonlinear, integer, multiple objective and stochastic optimization. Simulation topics will include both spreadsheet simulation and process simulation. The goals of the course are to: (1) provide advanced modeling skills in optimization and simulation; (2) provide skills in software packages used in business, such as the Analytic Solver Platform and Arena; (3) get practice on asking the right questions, on dealing with problem complexity, on critical thinking and on gleaning insights to complex problems.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSQOM", "id": "1745", "course_title": "SIX SIGMA THEORY AND PRACTICE", "description": "Six Sigma theory and practice has been designed to provide the student with: \"strong theoretical knowledge of the six sigma green belt body of knowledge. Practical, hands-on, experience with the Six Sigma methodology. A Katz Six Sigma green belt certificate, for students earning a grade of \"B\" or better. Six Sigma is a disciplined, data-driven approach to process improvement aimed at the near-elimination of defects from every product, process, and transaction. Lean topics will be included in this course. Six Sigma utilizes the following five-phase problem solving methodology known by the acronym DMAIC: 1. Define the projects, the goals, and the deliverables to customers (internal and external). Describe and quantify both the defect and the expected improvement. 2. Measure the current performance of the process. Validate data to make sure it is credible and set the baseline. 3. Analyze and determine the root cause(s) of the defects. Narrow the causal factors to the vital few. 4. Improve the process to eliminate defects. Optimize the vital few and their interrelationships. 5. Control the performance of the process. Lock down the gains. To integrate theory and practice, students will be grouped in teams and work under the mentorship of a Six Sigma black belt on an industry client field project.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSQOM", "id": "1790", "course_title": "SUPPLY CHAIN MANAGEMENT INTERNSHIP", "description": "The supply chain management internship provides business credits for project assignments that augment a professional supply chain management work experience.", "completed": false, "prereq_count": 0}], "links": [{"source": "0050", "target": "1070"}, {"source": "0050", "target": "1090"}]}