{"nodes": [{"dept_code": "BUSENV", "id": "0060", "course_title": "MANAGERIAL ETHICS AND STAKEHOLDER MANAGEMENT", "description": "Examines the social, political and legal interfaces between the business institution (especially the corporation) and the environment. Topics typically considered include ethical and value issues in business, the social responsibilities of business, business-government relations, and the management of stakeholder relationships and corporate social policy.", "completed": false}, {"dept_code": "BUSENV", "id": "0061", "course_title": "CERTIFICATE PROGRAM IN LEADERSHIP AND ETHICS: MANAGERIAL ETHICS AND STAKEHOLDER MANAGEMENT", "description": "Course examines the social, political and legal interfaces between the business institution (especially the corporation) and the environment. Topics typically considered include ethical and value issues in business, the social responsibilities of business, business-government relations, and the management of stakeholder relationships and corporate social policy. This section is reserved for students pursuing the Certificate Program in Leadership and Ethics.", "completed": false}, {"dept_code": "BUSENV", "id": "1701", "course_title": "ETHICAL LEADERSHIP FUNDAMENTALS", "description": "In this first integrated seminar of the CPLE sequence, students are introduced to ethics concepts and leadership skills - with a particular emphasis on demonstrating how ethics and leadership are complementary areas of emphasis for an effective leader. Ethics and leadership must be considered together in order to produce leaders who have the foresight to consider issues of responsibility, account ability and the full impact of their actions as well as a skill set that will empower them to implement their vision.", "completed": false}, {"dept_code": "BUSENV", "id": "1706", "course_title": "MARKET MANIPULATIONS: CRISES, BUBBLES, ROBBER BARONS AND CORPORATE SAINTS", "description": "Taking a historical perspective, the course focuses on the major kinds of market manipulations, as well as their impacts. Major topic areas include: the nature of a market and its 'failures,' and how firms as well as governments evolved to compensate for those failures; types of major market calamities, with historical comparisons, examining how they might have been successfully managed; the market manipulators, focusing on the 'robber barons' of the 'gilded age;' and the contexts and consequences of market manipulation, including an overview of factory towns and of worker impacts.", "completed": false}, {"dept_code": "BUSENV", "id": "1757", "course_title": "RACE AND BUSINESS ETHICS", "description": "In what ways are corporations responsible for alleviating racial injustice? The Race and Business Ethics course is designed to give students the confidence and ability to address pressing social issues that are affecting corporate decision-making. Corporate leaders are making heavy investments in training and leadership programming to build a deeper understanding of racial injustice with the hope of bringing about a more fair and equitable society. The pressure on leaders to envision social issues as a part of corporate strategy comes from internal and external stakeholders and is consistent with the rise of important business movements that include sustainability and corporate social responsibility. Topics addressed in the course include African-American entrepreneurship, white racial identity, theories of justice, and structural racism, among others. Course assignments include a formal debate concerning front-page issues, leading a conversation about race via social media networks, and reading-based examinations. Students who take the course will be presented with readings, speeches, films, and other media that take a scholarly approach to the issue of race and the variety of ways it continues to exert its force on culture and commerce.", "completed": false}, {"dept_code": "BUSENV", "id": "1760", "course_title": "BUSINESS LAW", "description": "Provides students with an exposure to the extensive laws and regulations that affect almost all major aspects of business operations. Topics covered are chosen on the basis of their importance to contemporary business.", "completed": false}, {"dept_code": "BUSENV", "id": "1765", "course_title": "LEADERSHIP IN THE SOCIAL ENVIRONMENT", "description": "This course will give CPLE students exposure to in-depth analysis of leadership concepts and techniques in personal, interpersonal, and group skill areas. Students will complete a number of assessment and skill development exercises in topics such as teamwork, motivation, agenda building, power and influence tactics, problem solving and decision-making. The exercises will be grounded in students' real world experiences in internships, leadership roles and campus and community organizations.", "completed": false}, {"dept_code": "BUSENV", "id": "1775", "course_title": "CPLE CAPSTONE SEMINAR", "description": "In this final course of the CPLE sequence, student will take a capstone seminar that is essentially a graduate-level research seminar on specific content areas in ethics and leadership. Based on previous exposure to the research process in the integrated seminars, students in the capstone seminar will be challenged to develop a substantial research project on their primary area of interest and expertise.", "completed": false}, {"dept_code": "BUSENV", "id": "1785", "course_title": "SOCIAL ENTREPRENEURSHIP", "description": "The purpose of this course is to introduce students to the complex dynamics of social entrepreneurship. This course covers theory, conceptual frameworks, and tools used to formulate strategies for creating innovative solutions to impact the public good. Topics addressed include defining social entrepreneurship and social initiatives, understanding the differences between traditional and social entrepreneurship, evaluating existing social ventures, and developing a plan for a new social venture. The course will consist of interactive lectures, readings, case discussions, and original research conducted by students.", "completed": false}, {"dept_code": "BUSENV", "id": "1790", "course_title": "BUSINESS ENVIRONMENT INTERNSHIP", "description": "The business environment internship provides business credits for project assignments that augment a professional business environment work experience.", "completed": false}, {"dept_code": "BUSENV", "id": "1791", "course_title": "PROJECTS IN ENTREPRENEURSHIP", "description": "This project course will involve an entrepreneurial incubator called the \"Blast Furnace\"' during which you can learn about bringing an idea to the market and what it means to be an entrepreneur. The first part of the class will educate you on what is a good idea and what it means and takes to start a business. The second part of the course provides access to a rich curriculum, mentor and coaches and co-working space to prepare you to create and grow a business.", "completed": false}, {"dept_code": "BUSENV", "id": "1795", "course_title": "BUSINESS AND POLITICS", "description": "The financial crisis, international negotiations toward a climate change agreement, and crises in such industries as pharmaceuticals and even toy manufacturing have highlighted the increasing interdependence of business and government. Such events often also expose the means by which business gains strategic benefits from government regulation. This course will examine methods and patterns of business influence on government, modern approaches to regulatory design, policy-making on issues affecting business, the performance of regulatory agencies, and the behaviors of groups and trade associations in politics.", "completed": false}], "links": []}