{"nodes": [{"dept_code": "SLAV", "id": "0660", "course_title": "SCI-FI: EAST AND WEST", "description": "This course compares Slavic and Anglophone science fiction to assess how a given culture's dominant values are articulated in a popular genre that enjoys different status in East and West. Those values emerge in works that imaginatively posit \"fantastic\" situations rooted in biological, spatial, and temporal explorations beyond those verified by science. On the basis of films, film clips, TV shows, stories, novellas, and novels we shall discuss such topics as utopia, progress, human perfectibility, the limits of science, and the nature of knowledge.", "completed": false}, {"dept_code": "SLAV", "id": "0860", "course_title": "CHERNOBYL MEMORY MUSEUM: CULTURAL REPRESENTATIONS OF THE NUCLEAR THREAT", "description": "This course will introduce students to the Chernobyl nuclear disaster, its ecological, environmental, health, social, psychological, economic, and political consequences, and its cultural representations through a range of texts, contexts, genres, and cultures. We will focus on the comparative analysis of literary, visual, and cultural texts that explore the effect of the 1986 nuclear event locally and globally. These texts include history and oral history, literature and poetry, documentary and feature films, TV series, video games, visual and virtual art, photography, music, and other media created by local cultural producers in Ukraine, Belarus, and Russia, as well as by the artists, writers, and filmmakers from Europe and North America. We will examine the historical, cinematic, literary, and popular culture interpretations of immediate and extended impact on personal, social, economic, ideological, political, and cultural structures of the human society. After students examine and analyze in detail each of the cultural texts and artistic works dedicated to the Chernobyl nuclear disaster, they will create their own artistic product to commemorate the tragedy, thus, contributing to the global Chernobyl \"memory museum.\"", "completed": false}, {"dept_code": "SLAV", "id": "0880", "course_title": "VAMPIRE: BLOOD AND EMPIRE", "description": "This course examines the phenomenon of vampirism in verbal and visual texts from different time periods in various cultures (Russia, Poland, France, England, America). We will analyze stories, novels, and films focusing on vampires from a variety of critical perspectives, contextualizing the works in the cultures that produced them.", "completed": false}, {"dept_code": "SLAV", "id": "1050", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing xml-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}, {"dept_code": "SLAV", "id": "1225", "course_title": "BEHIND BARS: CROSS CULTURAL REPRESENTATIONS OF PRISON IN THE 20TH CENTURY", "description": "This course examines cultural works produced in and about prison in the 20th century, addressing the function of art within the context of incarceration. In structure the course is composed of three parts: prison writings and criminal culture in America, memoirs from the forced-labor camps of the soviet gulag, and narratives of holocaust concentration camps. This structure allows for a comparison of cultures-- American, Russian, and European--as well as identities-- racial, gender, and religious.", "completed": false}], "links": []}