{"nodes": [{"dept_code": "PUBHLT", "id": "0100", "course_title": "FUNDAMENTALS OF PUBLIC HEALTH", "description": "This introductory course will provide students with a comprehensive overview of key concepts from all disciplines of public health. The course will address the determinants of public health and expose students to innovative methods and interventions for quantifying and improving population health across the lifespan. The US public health system will be described and used as basis of comparison to explore the field of global health and development.", "completed": false}, {"dept_code": "PUBHLT", "id": "0110", "course_title": "GENES, CELLS, AND COMMUNITIES: INTRODUCTION TO PUBLIC HEALTH BIOLOGY", "description": "This course will introduce students to the biological basis of the most pressing global public health challenges of the 21st century. It will begin with an overview of the basics of genetics and cell biology, and teach students the fundamentals of the immune response to infectious pathogens. It will then cover the biology of the most serious infectious and non-infectious disease challenges facing the globe.", "completed": false}, {"dept_code": "PUBHLT", "id": "0120", "course_title": "ESSENTIALS OF HEALTH EQUITY: EXPLORING SOCIAL AND STRUCTURAL DETERMINANTS OF HEALTH", "description": "Students will learn to identify and critically discuss health disparities - historical, political, economic, social, cultural, and environmental determinants of an identified health equity issue - and evaluate the impact or potential impact of interventions to reduce inequities. The course will be rooted in the exploration of the intersectionality of health disparities in race, ethnicity, age, gender, religion, sexual identity, disability, and other areas.", "completed": false}, {"dept_code": "PUBHLT", "id": "1001", "course_title": "INTRODUCTION TO GLOBAL HEALTH", "description": "This introductory course covers fundamental concepts in global public health, including determinants of health, key health indicators, global burden of disease, and the relationships among health status, education, and poverty, cross-cutting issues such as culture, ethical and human rights aspects of health, and key actors in global health will also be explored. A variety of teaching modalities will be employed throughout the course including lectures, guest speakers, case studies, class discussion, audio-visual presentations, and student presentations.", "completed": false}], "links": []}