{"nodes": [{"dept_code": "BUSSCM", "id": "1730", "course_title": "MANAGING GLOBAL SUPPLY CHAINS", "description": "Supply chain management explores the management of the flow of materials, information, and funds through the network of suppliers, manufacturers, distributors, retailers, and customers. Using the methodologies of optimization and simulation, where applicable, this course covers topics in distribution network design, inventory management, procurement and outsourcing, revenue management, and channel coordination. For marketing majors, this course counts as a marketing elective.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSSCM", "id": "1740", "course_title": "PURCHASING & SUPPLY MANAGEMENT", "description": "Purchasing and supply management play an essential role in the ability of the firm to operate efficiently and be competitive in the contemporary global business environment. Included in these processes are activities involved in identifying potential suppliers, creating relationships with selected suppliers, obtaining the needed materials in the most efficient quantities at the highest quality levels, and developing strategies designed to ensure an uninterrupted flow of goods and materials. Purchasing is increasingly a strategic activity which impacts all areas of the firm, including product design, information system design, e-commerce activities, manufacturing planning and control, inventory management, human resource development, financial planning, forecasting, sales, and quality management. The objective of this course is to make students aware of the demands placed upon purchasing professionals, and to understand the impact of purchasing on the competitive success and profitability of the firm. They must also have an understanding of legal and ethical considerations which affect purchasing decision-making.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSSCM", "id": "1750", "course_title": "REVENUE MANAGEMENT", "description": "Increasingly, due to shortening product life cycles and capital-intensive capacity decisions, companies are being forced to place greater emphasis on managing constrained, but perishable inventory and capacity. Examples include the transportation industry (encompassing airlines, shipping, car rentals, and trucking), the hotel industry, the entertainment and sporting industry, and the retail industry. The underlying managerial issue is complex, but improved decision making can increase a company's revenues and profits. In this course, we study quantity and pricing strategies to improve profitability and the course uses microeconomics, operations research, segmentation, and pricing and forecasting concepts that the students would have learned in their economics, quantitative methods, operations, and marketing classes. The methodologies covered in the course include deterministic and stochastic optimization, forecasting, and statistical estimation. Students are also exposed to commercial revenue management software.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSSCM", "id": "1780", "course_title": "SIX SIGMA", "description": "Six Sigma is a disciplined, data-driven approach to process improvement aimed at the near-elimination of defects from every product, process, and transaction. Six Sigma utilizes the following five-phase problem-solving methodology known by the acronym DMAIC: 1. Define the projects, the goals, and the deliverables to customers (internal and external). Describe and quantify both the defect and the expected improvement. 2. Measure the current performance of the process. Validate data to make sure it is credible and set the baseline. 3. Analyze and determine the root cause(s) of the defects. Narrow the causal factors to the vital few. 4. Improve the process to eliminate defects. Optimize the vital few and their interrelationships. 5. Control the performance of the process. Lock down the gains. BUSSCM 1780 six sigma is designed to provide the student not only with strong theoretical knowledge of the Six Sigma green belt body of knowledge, but also with practical, hands-on, experience-based learning through the application of Six Sigma tools and techniques via in-class labs.", "completed": false, "prereq_count": 0}], "links": []}