{"nodes": [{"dept_code": "BUSFIN", "id": "1030", "course_title": "INTRODUCTION TO FINANCE", "description": "Provides a survey and analysis of the problems and tools of financial decision-making by individuals and firms. The firm's role in the market system and the nature of its objective with reference to the welfare of investors and society is also treated. An analysis of the implications of this role to decisions regarding choice among alternative investment projects and capital budgeting decisions as well as an introduction to the structure of capital asset prices and the implications for financial policies of firms and individuals are also included.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSFIN", "id": "1311", "course_title": "CORPORATE FINANCE", "description": "Investigates the investment and financing decisions of firms from the perspective of the corporate manager. The pedagogical format combines conceptual and case analyses so as to provide both a theoretical and practical foundation. Specific topics to be considered include the following: capital budgeting, cost of capital determination, capital structure decisions and dividend policy.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1316", "course_title": "ADVANCED CORPORATE FINANCE", "description": "Examines a variety of applied topics in corporate finance, including mergers and acquisitions, corporate restructuring, leasing, pensions, short term financial management, and the use of derivatives in corporate finance.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1321", "course_title": "INVESTMENT MANAGEMENT", "description": "Emphasizes the development of tools required for investment decision-making. Reviews various financial instruments, examines their historical performance for evidence of risk return trade-off, presents basic portfolio theory and its implications for diversification, discusses the capital asset pricing model, and empirical estimation of beta riskiness. Other topics include mutual fund performance and the theory of efficient markets.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1326", "course_title": "EFFICIENCY OF CAPITAL MARKETS", "description": "This course covers a central issue in finance: the Efficient Market Hypothesis (EMH). The EMH states that security prices reflect all relevant information and implies that investors cannot earn excess profits. Evidence in support of the EMH and contrary to it is studied. The implications of efficiency impact all financial managers and individuals in their financial decisions. Topics include: what actions can a financial manager take to maximize shareholder wealth, why do prices fluctuate, and technical versus fundamental analysis. The course focuses on valuation methods like DCF and CAPM.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1328", "course_title": "CAPITAL MARKETS", "description": "This course provides an in-depth analysis of stock and bond valuation. The analysis of bonds covers bond pricing principals, the term structure of interest rates, and fixed income portfolio management. The analysis of stocks focuses on earnings and dividend-based valuation models, and a discussion of \"value investing\" and indexing.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1331", "course_title": "FINANCIAL INSTITUTIONS AND MARKETS", "description": "Analysis of the behavior of financial intermediaries in the capital market. The performance of capital markets and examination of the role of regulations of financial markets, and the effects of decision-making by individuals and firms are covered. Sources of short-term and long-term financing will also be analyzed.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1341", "course_title": "INTERNATIONAL FINANCE", "description": "This course applies the principles of finance to international issues in financial management. It deals in topics such as the valuation of foreign subsidiaries, estimating the cost of capital of foreign investments, investing in foreign multinational firms, the correlation of returns across international security markets, hedging foreign exchange risk, and the use of foreign securities markets.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1347", "course_title": "MERGERS, ACQUISITIONS AND CORPORATE STRUCTURES", "description": "This course examines the major structural transactions that corporations experience from an internal perspective, based on sound financial analysis conducted with an understanding of corporate governance, firm strategy, law, accounting, and organizational behavior. Particular emphasis will be on mergers and acquisitions (M&A), and include topics in venture capital, initial public offerings, buyouts, divestitures, and bankruptcy. Readings, case study analysis, and active class discussion are emphasized. Teams of students will put the M&A process into practice by searching out and analyzing potential target firms for a major corporation and presenting their analyses and recommendations.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1351", "course_title": "FINANCIAL MODELING", "description": "The course applies economic theories to solve various problems in financial management and investments. Using a hands-on approach in building financial spreadsheet models, the student will gain knowledge of numerical and graphical practices. These include but are not limited to asset return calculations, portfolio theory, index models, and the capital asset pricing model, option pricing models, bond pricing and investment performance analysis. MS excel is the primary tool to implement these financial models, however the course will also make use of statistics and probability.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSFIN", "id": "1390", "course_title": "FINANCE INTERNSHIP", "description": "The finance internship provides business credits for project assignments that augment a professional finance work experience.", "completed": false, "prereq_count": 1}], "links": [{"source": "1030", "target": "1311"}, {"source": "1030", "target": "1321"}, {"source": "1030", "target": "1326"}, {"source": "1030", "target": "1328"}, {"source": "1030", "target": "1331"}, {"source": "1030", "target": "1341"}, {"source": "1030", "target": "1351"}, {"source": "1030", "target": "1390"}, {"source": "1311", "target": "1316"}, {"source": "1311", "target": "1347"}]}