{"nodes": [{"dept_code": "ADMJ", "id": "0600", "course_title": "INTRODUCTION TO CRIMINOLOGY", "description": "This course provides an overview of the study of the causes and social responses to crime. It examines legal definitions and elements of crime; surveys major categories of crime, i.e., Predatory and non-predatory acts; reviews major measures of crime; identifies major correlates and theories of crime; differentiates types of offenders and evaluates the working of the criminal justice system.", "completed": false}, {"dept_code": "ADMJ", "id": "1100", "course_title": "CRIME SCENE INVESTIGATION", "description": "This course provides students with an overview of crime scene investigative issues and problems, as well as techniques used in the collection, preservation, analysis, and utilization of physical and testimonial evidence in criminal prosecutions. Topics include forensic photography, crime scene collection equipment, canvassing, and interrogation techniques in investigations of robbery, burglary, assault, and homicide crimes.", "completed": false}, {"dept_code": "ADMJ", "id": "1115", "course_title": "CRIMINALISTICS", "description": "This course introduces students to the scientific tools of analysis of crime scene evidence. Topics include toxicology, hair, fiber, blood, DNA, fingerprint, and firearms analysis, as well as cause of death issues such as sexual homicides, suicides, and assisted suicides, drug and carbon monoxide poisoning, accidental deaths, and blunt force trauma deaths. The class consists of integrated lecture and lab each week. The laboratory activities require only basic calculations.", "completed": false}, {"dept_code": "ADMJ", "id": "1118", "course_title": "CRIMINALISTICS LAB", "description": "This is an optional lab for students enrolled in administration of justice 1115. Designed for non-science majors, the lab will introduce students to the basic principles of chemistry, biology, and physics as they are used on a daily basis in criminal investigations. Topics include: identification of hair and fibers, DNA, and chromatography. These and other techniques are then applied to a simulated drug bust, a kidnapping case, and a suicide/homicide investigation.", "completed": false}, {"dept_code": "ADMJ", "id": "1200", "course_title": "INTRODUCTION TO LAW ENFORCEMENT", "description": "Introduces various historical and philosophical approaches to law enforcement. Course explores origins of policing; philosophical positions on nature of law enforcement and its justification; comparisons of various types of policing in different historical epoch; and emergence of bureaucratized urban force. Topics include development of law enforcement from ancient times with emphasis on philosophical approaches to policing in U.S.; Introduction to constitutional issues and problems.", "completed": false}], "links": [{"source": "1115", "target": "1118"}]}