{"nodes": [{"dept_code": "BUSBIS", "id": "1060", "course_title": "INTRODUCTION TO INFORMATION SYSTEMS", "description": "IT does not matter it's what you do with IT! Business in the 21st century runs on IT. However, competitive advantage seldom comes from having exclusive or proprietary access to a technology. Rather, IT comes from more effectively utilizing technologies to which everyone - including the competition - has access. The implications of this reality are many. First, it is necessary to understand what technologies are available in the marketplace and their capabilities. Next, and far more challenging, it is necessary to understand how these capabilities may positively (or negatively) interact with business strategy. Business transformation is the alignment of process, people, and technology such that IT can both support and innovate business strategies. Given that technologies evolve and develop at a rapid pace, IT is necessary for managers to understand what technologies can do (both established and new) and how IT can be leveraged to create real value.", "completed": false}, {"dept_code": "BUSBIS", "id": "1600", "course_title": "TECHNOLOGY-ENABLED BUSINESS TRANSFORMATION", "description": "It does not matter it's what you do with it! Business in the 21st century runs on it. However, competitive advantage seldom comes from having exclusive or proprietary access to a technology. Rather, it comes from more effectively utilizing technologies to which everyone - including the competition - has access. The implications of this reality are many. First, it is necessary to understand what technologies are available in the marketplace and their capabilities. Next, and far more challenging, it is necessary to understand how these capabilities may positively (or negatively) interact with business strategy. Business transformation is the alignment of process, people, and technology such that it can both support and innovate business strategies. Given that technologies evolve and develop at a rapid pace, it is necessary for managers to understand what technologies can do (both established and new) and how it can be leveraged to create real value.", "completed": false}, {"dept_code": "BUSBIS", "id": "1605", "course_title": "DATABASE MANAGEMENT", "description": "Topics covered include development of enterprise-wide data models using entity-relationship diagrams and semantic data models, logical design and implementation of relational databases, SQL, elements of data structures, and basic issues in the management of the corporate data resource.", "completed": false}, {"dept_code": "BUSBIS", "id": "1625", "course_title": "ELECTRONIC COMMERCE", "description": "This course will cover: (1) electronic business, defined as the use of internet and related communication technologies for organizational communication, coordination, and management of the firm; (2) electronic commerce, defined as the process of buying and selling goods and services electronically; and (3) societal implications of the new technologies. Students will be evaluated on the basis of class participation, assignments, quizzes, exams, and a business plan where students propose e-commerce solutions to tackle specific organizational or business problems and opportunities.", "completed": false}, {"dept_code": "BUSBIS", "id": "1630", "course_title": "PROJECT MANAGEMENT", "description": "Planning, organizing, staffing, and controlling projects requires traditional management skills as well as an appreciation of the tools, techniques, and practices unique to project management. This course starts with an overview of project management concepts, and then focuses on project planning, estimating, monitoring, and controlling. It also covers topics related to being an effective project leader and managing project teams. The project management institute (PMI), a professional organization for project managers, has produced a guide to the project management body of knowledge, which documents the knowledge and practices needed by today's project managers. This guide, along with current research and management trends related to project management, provide the framework for material covered in this class.", "completed": false}, {"dept_code": "BUSBIS", "id": "1635", "course_title": "INFORMATION TECHNOLOGY SYSTEMS IN SUPPLY CHAINS", "description": "This course examines the advantages and complexities of ERP software and demonstrates how the system can improve processes and streamline operations as applied toward a global supply chain. ERP systems provide a competitive advantage for a company by allowing the management of different functions and processes in one single corporate information system, providing access to real-time data within the company, enabling greater business agility and strategic decisions. Accordingly, information technology systems in supply chains has been designed to provide students with: strong knowledge of enterprise resource planning (ERP) systems and how companies leverage ERP software to manage global supply chains. Hands-on experience with the execution of supply chain business processes in sap, an industry leader in ERP business software. Practical skills, acquired through experience-based learning activities, which will make students more effective working in a collaborative, global, virtual business world.", "completed": false}, {"dept_code": "BUSBIS", "id": "1640", "course_title": "IT ARCHITECTURE AND PLATFORMS", "description": "There is no such thing as a technology decision. There are only business decisions. The options and issues affecting the deployment and utilization of business information systems have grown in number and greatly increased in complexity since the internet and concomitant technologies have become the most important de-facto standards for business computing and networking. Business people who are involved in technology selection and deployment decisions need a basic knowledge of these areas as well as an understanding the value, costs and benefits they might offer to a business. They also must be able to find out about and evaluate new or emerging technologies and issues that could have relevance in their business situations. They then need to be able to explain all of this to other business people - in business terms. This course will utilize: lectures and presentations by the instructor and outside speakers to present current and relevant architectures and issues that affect businesses deploying information systems; full-length case studies and class discussion to facilitate the examination of the business implications of and the context in which these system deployment factors are involved; team projects to give the students experience in researching, understanding, evaluating and explaining information technologies and issues within a business context.", "completed": false}, {"dept_code": "BUSBIS", "id": "1645", "course_title": "INFORMATION SYSTEMS ETHICS", "description": "This course provides an overview of ethics concepts and decision-making as they are related to Information Systems and Computing. Emphasis is placed on the study of ethical situations and responsibilities of IS professionals around current and emerging technologies in a global setting. Research papers, Case studies and discussion of current ethical events around technology will be used to facilitate discussions in areas including, but not limited to: Cloud Computing, Data protection, Cyber Security, The Digital Divide, Social Media, Intellectual Property, Whistleblowing, Professional Codes of Conduct, Professional liability, Internet freedom in computing and international laws and governance. Invited Subject Matter Experts will conduct informative sessions on key subject matter areas aligned with the course content.", "completed": false}], "links": [{"source": "1060", "target": "1605"}]}