{"nodes": [{"dept_code": "PITT", "id": "0130", "course_title": "WELLNESS AND RESILIENCE", "description": "The purpose of this course is to teach undergraduate students skills for having resilience in the face of commonly experienced stressors and difficulties. Stated simply, resilience is the ability to both survive and thrive. Resilience is not only about your ability to positively adapt in the face of adverse or challenging circumstances (that is, survive), but it is also about learning the positive skills, strategies and routines that enable you to live a happy, fulfilling, and successful life (in other words, thrive). This course will provide you with a personalized set of strategies and skills for self-care and optimize your academic and social experiences while at the University of Pittsburgh and beyond.", "completed": false}, {"dept_code": "PITT", "id": "0210", "course_title": "ANTI-BLACK RACISM: HISTORY, IDEOLOGY, AND RESISTANCE", "description": "In the wake of the police killings of George Floyd, Breonna Taylor, Tony McDade and many others in recent months, activists and scholars in the United States have taken to the streets, the workplace, and classrooms to decry anti-Black racism and call attention to the ongoing devaluation of Black lives in the US and globally. The wave of uprisings that have swept the nation and globe represent part of a long struggle of anti-racist organizing--one that can be traced back hundreds of years. This multidisciplinary course seeks to provide a broad overview of this rich and dynamic history. Built around the expertise of Pitt faculty and Pittsburgh area activists, this course will introduce students to the established tradition of scholarship focused on the Black experience and Black cultural expression. It also seeks to examine the development, spread, and articulations of anti-Black racism in the United States and around the world. The course will grapple with three key areas of inquiry: the roots, ideology, and resistance to anti-Black racism. Each unit will be focused through readings, lectures and discussions. First, we will explore the roots of anti-Black racism in the United States, drawing connections to African history, the history of slavery, and the Transatlantic Slave trade. Second, the course will grapple with the ideology of anti-Black racism--the ideas that undergird the creation of racial hierarchies, often shaped by pseudo-science and eugenics. Third, the course will highlight the theme of resistance, paying close attention to the range of political strategies and tactics Black activists and their allies have employed in their effort to obtain a more just and equal society here and internationally. Significantly, the course employs an intersectional analysis--taking into account how race is interwoven into other categories including ethnicity, gender, class, sexuality and nationality. We will use a variety of scholarly disciplines spanning the Humanities, Social Sciences, the Arts, Science and Public Health to explore these themes to help students understand how anti-Black racism functions in US society.", "completed": false}], "links": []}