{"nodes": [{"dept_code": "AFRCNA", "id": "0031", "course_title": "INTRODUCTION TO AFRICANA STUDIES", "description": "This is a survey course for Africana studies. An Afrocentric approach will be used to review the eight basic subject areas of the multidisciplinary focus; black history, black religion, black creative productions, black politics, black economics, black social organizations, black psychology and black education. Two alternative views will be pursued; a theoretical review of the literature and a summation of the practical experiences of black life.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0120", "course_title": "AFRICAN AMERICAN EXPERIENCE SPORTS", "description": "This course examines blacks in sports. It focuses on sport as a microcosm of the larger society and also addresses sport's relationship to politics, economics, race relations, and South African apartheid. It looks at the history of blacks in sports as well as three aspects of sports that appear to be racially biased; position allocation, performance differentials, and rewards and authority structure.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0127", "course_title": "INTRODUCTION TO AFRICA", "description": "Multidisciplinary introduction to Africa emphasizing the richness, diversity and dynamism of the African experience and presented through lecture discussions of culture, social structure, history, economy, politics and other aspects of Africa's development.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0311", "course_title": "INTRODUCTION TO THE AFRICAN AMERICAN FAMILY", "description": "This course has 2 objectives: (1) it seeks to describe and analyze the organization of black families in American society and changes in them over time, and (2) it brings together the scholarly sources available to students of black families to assess the contribution each makes to a more theoretically and conceptually sophisticated description of the structure and interaction in black families.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0318", "course_title": "HISTORY OF AFRICA BEFORE 1800", "description": "Surveys history of Africa from earliest times to eve of European colonization. Looks at Africa from the inside out and aims at promoting an appreciation of Africa's contribution to world civilization and an understanding of the historical processes that have shaped modern Africa. Major themes and topics include the ancient kingdoms, Islam, the slave trade and the European contact.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0352", "course_title": "AFRICAN AMERICAN DANCE", "description": "An introduction to African-American dance influence of West Africa and the Caribbean upon the black American experience in a comparative and historical perspective. These two perspectives are based upon those devised by African-American dance artists, such as Katherine Dunham, Alvin Ailey and Bob Johnson. The physical component of African-American dance emphasizes body placement and the relationship of movement to its music.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0385", "course_title": "CARIBBEAN HISTORY", "description": "Examines historical roots of modern Caribbean. Examines major historical developments from period of subjugation of indigenous population through era of slavery to rise of modern nationalism and impact of American intervention. Also analyzes related socioeconomic systems and institutions. Selected country case studies included.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0629", "course_title": "AFRICAN AMERICAN HISTORY 1877", "description": "This course examines African American history and culture from its inception with the Transatlantic Slave Trade to its transformation during the Civil War. Topics discussed include the African and Native American captivity practices that served as the precursors to African chattel slavery; the origins and rationale behind the creation of the social category of \"race;\" the differences between African chattel slavery in the French, Spanish, and British colonies; the regional variances in slavery in the southern and northern United States and in Indian nations; methods of resistance used by African American women and men; and the multifaceted ways in which African Americans played a part in the abolitionist movement and in their own emancipations.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0639", "course_title": "HISTORY OF JAZZ", "description": "The course focuses on the chronological development of jazz from its beginnings on the plantation to its present state as a world concert music. Various styles such as ragtime, blues, gospel, spirituals, rhythm and blues, rock, soul, etc., Are examined.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "0787", "course_title": "BLACK CONSCIOUSNESS", "description": "Introduction to the growing body of coherent cultural ideas and beliefs which provide a positive framework for study and interpretation of the black experience in North America. The course is pan-African in scope and context. One of the goals is to enable the student to view the African and the African-American struggles as part of the world struggle of human rights.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1012", "course_title": "EARLY 20TH CENTURY BLACK SOCIAL MOVEMENT", "description": "This course provides an understanding of the social, political cultural and economic context out of which black social movements developed. The main themes of the course concern migration, class differences, racism, and gender relations. The social movements the course examines includes, the Marcus Garvey movement, father divine, labor organization and the black women's club movement.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1021", "course_title": "HISTORY OF THE AFRICAN DIASPORA", "description": "History of the African diaspora focuses on the historical processes that have shaped, & continue to shape the peoples cultures of the African diaspora. It examines the triangle relationships between the African homeland & its American & European diaspora. Attention will be given to an understanding of the manifold circuits in the trans-Atlantic circulation of peoples, ideas & culture. The dynamism, complexity & global ramifications of the African diaspora will be revealed through discussions of important themes, including race, economic systems & construction of diaspora ID's.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1026", "course_title": "AFRICAN PRESENCE IN LATIN AMERICAN LIT/CULTURE", "description": "This course is a chronological and topical introduction to afro-Latin American culture, making use of literary texts, historical documents, feature films, etc. It aims at providing students with a concrete frame of reference for the African presence in Latin America.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1030", "course_title": "INTRODUCTION TO AFRICAN POLITICS", "description": "A general introduction to African politics at macro level for freshmen and sophomores with special focus on traditional African political system, European imperialism in Africa, African nationalism, independence and post-independence problems of nation-building and economic development.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1240", "course_title": "AFRICAN LITERATURE AND SOCIETY", "description": "Inquiry into significant aspects of contemporary African social, political, cultural and human problems approached through the detailed study of representative African novels, plays and poetry written by African authors.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1310", "course_title": "CULTURES OF AFRICA", "description": "This course explores the traditional cultures and societies of Africa from prehistoric to modern times. Emphasis is on the conditions prior to contemporary changes but some attention is given to modern developments. Concern is with the variety of cultures on the continent. How people make a living. What family life is like? How disputes are settled, and religion. Through lectures, films, and readings, the student gets a feeling for life in this fascinating part of the world.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1334", "course_title": "MUSIC IN AFRICA", "description": "The historical, social, and cultural background of music in Africa with particular reference to music in community life, performing groups, the training of musicians, instrumental, resources, structures in African music and the interrelations of music and dance. (Slides, films and recordings will be used to illustrate lectures.)", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1335", "course_title": "AFRICAN-AMERICAN MUSIC IN THE UNITED STATES", "description": "This course is designed to familiarize the student with various phases of African-American music existing in North America; blues, gospel-spirituals, work songs, children's games songs, and classical compositions of ragtime composers Scott Joplin, J.P. Johnson, etc. Students will conduct field projects centered around \"street recordings, locations, interviews of local and visiting artists, etc.\" A detailed study of great Pittsburgh performers present and past will constitute a major portion of this course.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1349", "course_title": "CONTEMPORARY CARIBBEAN LITERATURE", "description": "Study the fiction, poetry, and drama of the English Caribbean in chronological order. Exile, liberation, autonomy, the female voice, cultural, and political identity will be examined in writing from Jamaica, Trinidad, Grenada, Antigua, and Guyana with recordings and films.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1415", "course_title": "RELIGION AND RACE", "description": "This course examines the intersections of religion, race, and racism. Recently, scholars of religion have demonstrated that religious identities are often racialized as well. In this course, we will discover that religion and race are both modern categories rooted in post-enlightenment ideas about what it means to be human. We will see how the establishment of these religious and racial categories led to new hierarchies and inequalities. We will discuss how post-enlightenment thinkers linked religion and race, and how their ideas played a role in European imperialism. We will also investigate how the discipline of religious studies has developed its analytical tools with a racialized understanding of religion. The course will examine case studies in which religion has been racialized, and consider the political ramifications of these examples. In particular, we will think about the impact of white supremacy on black religion in the united states, the complicated relationship between antisemitism and Islamophobia, and contemporary Islamophobia in the US. Finally, we will explore the possibilities of anti-racism through faith-based scholarship and activism.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1418", "course_title": "FROM VODOU TO SANTERIA: RELIGIONS OF THE WEST AFRICAN DIASPORA", "description": "This course is an introduction to the study of West African Diaspora religions in the Americas. We define \"diaspora\" as the spread and dispersal of people of African descent â both forced and voluntary â through the slave trade, imperial and colonial displacements, and postcolonial migrations. In what form do African religious expressions exist in the African Diaspora communities? This course exposes students to the indigenous African foundations of the religious beliefs and religious practices of African communities living in the Diaspora. Students will receive historical, ethnographical, and anthropological approaches to grasp the essence of these non-doctrinaire and non-textual religions focused on a rich memory of African deities, rituals, morality and practices that have been passed from generation to generation.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1535", "course_title": "DIMENSIONS OF RACISM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1538", "course_title": "HISTORY OF BLACK PITTSBURGH", "description": "This course will explore the role and experiences of black Pittsburghers over the past 200 years of the city's history.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1555", "course_title": "AFRO CARIBBEAN DANCE", "description": "This course will focus on Katherine Dunham as an ethnologist and choreographer politically, socially, and aesthetically. The course discussion will clearly define the contents of Dunham's dance research and life experiences of Haiti.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1655", "course_title": "AFRICAN CINEMAS/SCREEN GRIOTS", "description": "Ousmane Sembene, known as the father of African cinema, popularized the notion of the African director as the modern day griot (oral historian) and traditional storyteller. Therefore, this course is an introduction to a cross-section of post-independence films (1963-2004) as an art form and as a visual space on socio-political, economic and cultural topics by screen griots from Burkina Faso, Cameroon, and chad, the democratic republic of the Congo, Ethiopia, Niger, Nigeria, Senegal, South Africa and Zimbabwe.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1710", "course_title": "AFRICAN AMERICAN HEALTH ISSUES", "description": "Course will focus on black health issues from analytical, theoretical and practical perspectives. These perspectives will be introduced through cross examination of health topics which are critical to the black population, the developing of health policies and conceptual models for health promotion and disease prevention.", "completed": false, "prereq_count": 0}, {"dept_code": "AFRCNA", "id": "1720", "course_title": "WEST AFRICA IN THE ERA OF THE SLAVE TRADE", "description": "", "completed": false, "prereq_count": 0}], "links": []}