{"nodes": [{"dept_code": "ENGWRT", "id": "0400", "course_title": "INTRODUCTION TO CREATIVE WRITING", "description": "This course offers the opportunity to experiment with forms of poetry and fiction and to read and discuss from a writer's point of view contemporary writing in these genres.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "0520", "course_title": "INTRODUCTION TO FICTION WRITING", "description": "This first course in the fiction sequence introduces students to aspects of prose fiction--plot, point of view, characterization, conflict, etc. Students may write exercises on these aspects of fiction, write one or more short stories and revise frequently. Students will also read representative stories and explore their use of particular fictional techniques.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "0530", "course_title": "INTRODUCTION TO POETRY WRITING", "description": "Through writing exercises, analysis of modern and contemporary poetry and frequent revision of their own poetry, students learn the basic elements of poetry writing.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "0610", "course_title": "INTRODUCTION TO JOURNALISM AND NONFICTION", "description": "This course is designed to develop your skills as a nonfiction writer. Through a combination of required readings, creative exercises, peer critiques and critical discussions, you will develop an understanding of the fundamentals of journalism as well as an introduction to the wide-ranging possibilities of nonfiction writing as a genre: narrative long form, the personal essay, immersion journalism and forms of creative nonfiction. This class will be divided into two components; gathering information and shaping stories.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "0710", "course_title": "INTRO TO AUDIO STORYTELLING", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1010", "course_title": "INTERMEDIATE FICTION", "description": "Students work on writing short stories and read a wide range of stories. Students can expect to revise their work regularly. Class sessions will address problems in fiction writing -- from plot to characterization, from point-of-view to style.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1094", "course_title": "READINGS IN CONTEMPORARY FICTION", "description": "This course acquaints students with a variety of contemporary writers. This study helps students raise questions about their own developing aesthetics as they are reflected in form and take into account their dual roles as creative writers and critics.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1132", "course_title": "ELEMENTS OF SCREENWRITING", "description": "This course will explore developing character-based stories in the screenplay form. Students will be exposed to a variety of readings, including original screenplays, related prose, and texts which reinforce basic tenets of good story telling. Students will write a completed 1st Act for a 3 to 5 part screenplay, building from idea to outline with particular attention to structure and character development.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1210", "course_title": "POETRY WORKSHOP", "description": "For this advanced poetry writing course, the central text will be the student's own writing. Students will read recently published poetry, regularly write their own poetry and frequently rewrite it.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1290", "course_title": "READINGS IN CONTEMPORARY POETRY", "description": "This course focuses on American poets who have come to prominence since 1963. We will read widely in the poetry of this period to understand its unique contribution to the development of poetic form and its relationship to the culture that produced it.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1330", "course_title": "INTERMEDIATE NONFICTION: SCENE AND POINT-OF-VIEW", "description": "Students in this course will study, practice, produce and revise short pieces of literary nonfiction while examining basic structures of the essay, the profile, and long form narratives. We will study the anatomy of a scene and explore techniques of scene-by-scene construction. Students will be expected to master the basics of point-of-view, and to begin experimenting with voice. We will develop research techniques including the art of the interview and immersion research. This course will place emphasis on digital forms of publishing. Students will develop personal blogs. Workshopping of student work will be limited.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1390", "course_title": "READINGS IN CONTEMPORARY NON-FICTION", "description": "This course familiarizes students with a number of different forms of and approaches to contemporary non-fiction writing.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1501", "course_title": "TOPICS IN CREATIVE WRITING", "description": "Topics in Creative Writing will explore writing that crosses boundaries in a variety of ways, between traditional genres (fiction, nonfiction, poetry, drama) or that is interdisciplinary (between writing and, for instance, studio arts, photography, music, or dance). Writers of all genres have been influenced, challenged, and enriched by other kinds of artists' productions and practices (and vice versa), and this class will examine those engagements and influences especially in but not limited to contemporary work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1514", "course_title": "WRITING AND MAKING COMICS", "description": "This course is designed as an introduction to making comics. The class will focus primarily on writing scripts: pitching, outlining, drafting, and editing. Students need not have skills as illustrators. However, students will gain a basic understanding of drawing comics, collaborating with artists, and comic layout and design.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1540", "course_title": "WRITING YOUTH LITERATURE 2", "description": "Expanding on the fundamentals of writing youth literature, students will aim to complete the first draft of a novel-length piece for either a young adult or middle grade audience. Incoming students must have an approved idea and roughly sixty consecutive pages of writing already completed.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1650", "course_title": "PLAYWRITING 1", "description": "A beginning course in writing for the stage. Starting with short scenes, students will work towards understanding the craft and art of constructing theatre stories to be performed by actors. The final project will be a one-act play. Throughout there will be emphasis on the stage effectiveness of the writing and opportunity for informal performance of student scripts.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGWRT", "id": "1710", "course_title": "SENIOR SEMINAR IN FICTION", "description": "In this seminar students are expected to criticize student work intelligently and constructively. It is designed for students familiar with the craft of writing who wish to refine their writing skill and make their stories more subtle, original and meaningful. Analysis of student writing will be supplemented by the reading of professionally written stories.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1750", "course_title": "SENIOR SEMINAR IN NONFICTION", "description": "This is a workshop-intensive class in which students will work on one research-intensive piece of long form narrative nonfiction of about 8,000 words. This course will place heavy emphasis on digital forms of publishing. Students will maintain personal blogs and personal websites where they will publish their own work and participate in the editing and publishing of a class-wide digital magazine.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGWRT", "id": "1900", "course_title": "INTERNSHIP: WRITING", "description": "This course offers students an opportunity to work as interns for local media, including newspapers, magazines and television stations. The internships are complemented by close supervision and seminars dealing with some of the ethical, legal, and practical issues facing the working professional.", "completed": false, "prereq_count": 0}], "links": [{"source": "0520", "target": "1010"}, {"source": "0520", "target": "1094"}, {"source": "0530", "target": "1210"}, {"source": "0530", "target": "1290"}, {"source": "1010", "target": "1710"}, {"source": "1330", "target": "1750"}]}