{"nodes": [{"dept_code": "ANTH", "id": "0538", "course_title": "THE ARCHEOLOGIST LOOKS AT DEATH", "description": "Pyramids, tombs, burial mounds, graves, skeletons, mummies; the stuff of gothic romance. But the way people disposed of their dead also tells us an amazing amount about life in the past. We will look at the wide range of burial practices in the world, including the \"American way of death\", and then concentrate on the physical remains themselves. What do burial practices indicate as to beliefs, rituals, religion and society?", "completed": false}, {"dept_code": "ANTH", "id": "0582", "course_title": "INTRODUCTION TO ARCHEOLOGY", "description": "Examines the nature of modern archaeological research. Lectures look at how archaeologists work in the field, their analytic techniques, and some of the principal methodological and theoretical problems facing the field. Specific examples are used to illustrate these topics.", "completed": false}, {"dept_code": "ANTH", "id": "0630", "course_title": "FORENSIC ANTHROPOLOGY: AN INTRODUCTION", "description": "", "completed": false}, {"dept_code": "ANTH", "id": "0680", "course_title": "INTRODUCTION TO PHYSICAL ANTHROPOLOGY", "description": "This course is designed to introduce the undergraduate to the issues, theories and methods of physical anthropology. Beginning with a consideration of evolutionary, genetic and geologic principles, the course goes on to consider, the diversity of fossil and extant primates, including humans. Issues in anatomy, paleontology and behavior will all be addressed.", "completed": false}, {"dept_code": "ANTH", "id": "0713", "course_title": "ASIA NOW", "description": "The course is innovatively interdisciplinary, reflecting current anthropological theory. The topical focus is on contemporary Asia. It is creatively structured around a series of high-profile, public guest lectures given by leading, internationally recognized Asian Studies and Global Studies Scholars representing a spectrum of disciplines. The class will meet twice a week, once for a lecture and once for a seminar discussion focused on reading assignments chosen to highlight anthropological problems, questions and analytical perspectives that relate to the weekly guest lecture.", "completed": false}, {"dept_code": "ANTH", "id": "0714", "course_title": "ASIA NOW LANGUAGE TRAILER", "description": "This is a one-credit language trailer course connected to ANTH 0713 Asia Now. Asia Now is a hybrid lecture series/seminar course, with a series of weekly public guest lectures every Monday followed by weekly seminar discussion on Wednesday. The additional language trailer course meets once a week for one hour to provide instruction in a target Asian language (Japanese, Korean or Chinese). Students with intermediate and advanced aptitude in the target language meet for one hour to improve their language competency by discussing topics covered in lectures and reading assignments in 0713.", "completed": false}, {"dept_code": "ANTH", "id": "0730", "course_title": "HIMALAYAN GEOGRAPHY", "description": "The Himalayan region is characterized by a tremendous range of social and cultural diversity that corresponds to climatic, ecological and geographical variation, as well as local and regional geopolitical factors. Historical change from the emergence of early forms of social complexity centered on chiefs and their forts ' from which the regional designation of 'Garhwali' takes its name ' through the development of kingdoms and larger polities shows the intimate link between geography, environment and socio-political transformation. Similarly, local language patterns, regional religious practices, musical styles, mythology, food culture, sartorial fashion, architectural design, agricultural and transportation technologies and engineering and trade networks have all been shaped by the structure of Muntain barriers, bounded valley communities and bracketed lines of communication that follow river systems. Whereas the political economy of the Himalayas has been structured around agricultural production, and the development of elaborate field terrace systems, there have also been subsidiary economies centered on trans-Himalayan trade and pilgrimage as well as pastoral nomadism and transhumance. Since the colonial period, the Himalayas have increasingly become a place for rest, relaxation, tourism and adventure, and this ' along with further political transformations since Indian independence `has led to the rapid development of urban areas. This course will provide a survey of Himalayan history, society and culture with a focus on the relationship among nature, the environment and geography.", "completed": false}, {"dept_code": "ANTH", "id": "0768", "course_title": "HUMAN SEXUALITY IN CROSS CULTURE", "description": "This course explores the expression of human sexuality across a diversity of cultural and social settings using a cross-cultural framework that is based on comparing information on sexuality in other cultures with data from us. It includes how human groups manage sexuality and reproduction; theories of the development of marriage, family, and household systems; differences in values and expectations related to sexuality; the development as sexual expression across the life span; understanding heterosexual and homosexual relationships; and understanding sexual violence.", "completed": false}, {"dept_code": "ANTH", "id": "0780", "course_title": "INTRODUCTION TO CULTURAL ANTHROPOLOGY", "description": "By examining the behavior and customs of peoples throughout the world, the course considers what it means to be human. We will describe the patterns of marriage, family organization, warfare and political behavior, economic systems, rituals, etc., Of other peoples, especially those of tribal societies, and compare these with American social patterns. Anthropological films and slide presentations will supplement lectures.", "completed": false}, {"dept_code": "ANTH", "id": "1524", "course_title": "CHINESE ARCHAEOLOGY", "description": "An introduction to Chinese Archeology from the earliest known beginnings through the Han Civilization of the second century A.D. Attention will be given to innovations of people in this part of the world -- the agricultural beginnings, the first cities and states, the formation of an empire. Emphasis will be placed on such topics as the role of archeology in the study of history and art as well as in understanding china today.", "completed": false}, {"dept_code": "ANTH", "id": "1530", "course_title": "ORIGINS OF CITIES", "description": "A broad introduction to the process of urbanism and the rise of early pre-industrial cities in both the new and old worlds. Specific cases from MesoAmerica, the Andes, North America, Egypt, and the near East are examined in order to elucidate the varying roles cities played in ancient civilizations.", "completed": false}, {"dept_code": "ANTH", "id": "1537", "course_title": "BASIC LABORATORY ANALYSIS", "description": "Students will be instructed in basic methods of lab analysis for a range of artifacts, materials and data commonly recovered in archaeological projects.", "completed": false}, {"dept_code": "ANTH", "id": "1540", "course_title": "SPECIAL TOPICS IN ARCHEOLOGY", "description": "Topics covered vary greatly with instructor and term.", "completed": false}, {"dept_code": "ANTH", "id": "1541", "course_title": "CULTURAL RESOURCE MANAGEMENT", "description": "This course will cover in an introductory way all aspects of cultural resource management and historic preservation. Major topics include federal historic preservation legislation, cultural resources (historic and prehistoric archaeology, historic structures), the national register of historic places, section 106 and 110 of the NHPA, historic preservation planning, and state historic preservation plans. Course will utilize historic architectural examples as well as prehistoric and historic archaeological sites. Greater emphasis placed on how to evaluate historic properties for national register.", "completed": false}, {"dept_code": "ANTH", "id": "1556", "course_title": "ZOOARCHAEOLOGY", "description": "", "completed": false}, {"dept_code": "ANTH", "id": "1600", "course_title": "HUMAN EVOLUTION AND VARIATION", "description": "", "completed": false}, {"dept_code": "ANTH", "id": "1603", "course_title": "HUMAN ORIGINS", "description": "This will be an in-depth look at the history of study of human evolution and the current theories and controversies surrounding the interpretation of our relatedness to the various apes as well as of the fossils representing our evolutionary past.", "completed": false}, {"dept_code": "ANTH", "id": "1706", "course_title": "TAIWAN DIASPORA", "description": "To better understand the fundamental thrust and impact of the Taiwanese diaspora, and its connection to globalization, this course is designed to explore the major forces that have shaped Taiwanese diasporic identities and overseas communities primarily during the 20thcentury. Students will read articles and books as well as journalists' reports to familiarize themselves with the range of concepts and debates that analyze Taiwanese-diasporic issues.", "completed": false}, {"dept_code": "ANTH", "id": "1717", "course_title": "MODERN TAIWAN: 1500-1980", "description": "This course teaches students about the social, cultural and economic factors that have shaped modern Taiwan, a critically important nation in the development of globalization in Asia.", "completed": false}, {"dept_code": "ANTH", "id": "1718", "course_title": "GENDER AND WORK IN CROSS CULTURAL PERSPECTIVE", "description": "", "completed": false}, {"dept_code": "ANTH", "id": "1722", "course_title": "CULTURE AND POLITICS OF MENTAL HEALTH", "description": "", "completed": false}, {"dept_code": "ANTH", "id": "1726", "course_title": "GLOBAL PHARMACEUTICALS", "description": "This course examines pharmaceuticals as cultural and social phenomena, following their development, production, marketing, and use around the globe. We will investigate a number of issues, including the growing number of drugs prescribed to Americans each year, the lack of access some populations have to essential medicines, the increasingly global nature of clinical trials, and the role of pharmaceutical companies in the opioid crisis. We will use the study of drugs and medicines to analyze the production of medical knowledge, changing perceptions of health and illness, and the role of the state and the market in the development and distribution of therapeutics. Pharmaceuticals bring together science, clinical practice, marketing, and consumerism, and this course will draw on anthropological research to trace the role they play in global flows of knowledge, capital, commodities, and people.", "completed": false}, {"dept_code": "ANTH", "id": "1729", "course_title": "BRAZIL", "description": "The course begins with an overview of Brazilian culture and of the country's enormous resource base. Cultural change is traced through the pre-Columbian, colonial, imperial, and republican periods. A major theme throughout is the evolution of a Portuguese heritage into today's distinctive Brazilian national culture. The country is then divided into five regions as a means of understanding its internal diversity. Popular American ideas about subjects like carnival, the amazon rainforest, coffee, Copacabana Beach, and the huge foreign debt are also dealt with.", "completed": false}, {"dept_code": "ANTH", "id": "1737", "course_title": "SPECIAL TOPICS IN CULTURAL ANTHROPOLOGY", "description": "This course will be on a topic in the area of specialization of a visiting scholar yet to be determined.", "completed": false}, {"dept_code": "ANTH", "id": "1747", "course_title": "WRITING CULTURE", "description": "This class will introduce students to different anthropological and ethnographic writing styles and theoretical approaches while encouraging them to think about what anthropology can contribute to our understanding and appreciation of human diversity in the world today. Students will \"try on\" different writing styles and theoretical approaches. Throughout the class they will examine the poetics (writing style) and politics (forms of power) associated with different approaches and types of ethnographic writing. Class readings include different types of anthropological writing. This includes empirical writings (e.g., structural-functional ethnographic realist writing) that characterized much anthropological work through the 1960s; interpretive works, influenced by Clifford Geertz; a range of experimental, reflexive, and critical writings of and since the \"experimental moment\" of the late 1980s; and feminist ethnography and fictional ethnography (or ethnographic fiction). Additional readings provide wider context and writing/study tips.", "completed": false}, {"dept_code": "ANTH", "id": "1750", "course_title": "UNDERGRADUATE SEMINAR", "description": "This seminar brings together all undergraduate majors in anthropology for a seminar on the methods by which cultures around the world change over time. Defining such methods occupies much of any anthropologist's time, be he or she an ethnographer, archaeologist, physical anthropologist or linguist. The seminar therefore examines this central problem from many perspectives and affords the student ample opportunity for personal expression as well as rewarding discussion and research in a peer group environment.", "completed": false}, {"dept_code": "ANTH", "id": "1752", "course_title": "ANTHROPOLOGY OF FOOD", "description": "This course surveys the general subject of culinary anthropology. Topics include food exchanges and the construction of social groups, food and social boundaries, food taboos, symbolism of food, folk conceptions of food, sacrifice and food in religious contexts, world standardization of food preferences. Thus, the focus is on social aspects of food, eating, and exchange.", "completed": false}, {"dept_code": "ANTH", "id": "1761", "course_title": "PATIENTS AND HEALERS: MEDICAL ANTHROPOLOGY 1", "description": "This course surveys the field of medical anthropology and its history within the discipline of anthropology as a whole, from the perspective of social-cultural theory. Topics dealt with include ethnomedicine, ethnographic cases, cross-cultural studies of healing practices and connections between medicine and religion. Reference is also made to applied research in contemporary situations.", "completed": false}, {"dept_code": "ANTH", "id": "1763", "course_title": "FIELD METHODS", "description": "This course is designed to acquaint students with basic ethnographic fieldwork techniques. Topics addressed include taking and managing fieldnotes on participant-observation, systematic or structured interviews, behavioral observation, and use of archival materials. There will also be some discussion of the relationship between research design, data collection, and data analysis.", "completed": false}, {"dept_code": "ANTH", "id": "1784", "course_title": "JAPANESE SOCIETY", "description": "This course will introduce students to contemporary Japanese culture and social institutions. Using scholarly books, essays, fiction and film, it will give students a range of different exposures to various aspects of Japanese society and everyday life: economic miracle, recession, middle class society, gender relations, sexuality, education, consumerism, and mass culture. The special focus of the course will be popular culture in japan. We will review the postwar history of popular culture and consider the reasons for its recent appeal abroad.", "completed": false}, {"dept_code": "ANTH", "id": "1797", "course_title": "MOUNTAINS AND MEDICAL SYSTEMS", "description": "India is a social, political and economic environment in which a broad range of South Asian medical systems have grown and developed over the course of several years. In the past 150 years these systems have been institutionalized and professionalized within the framework of colonial and national medical and public health policy. Many of these systems are intimately connected to the environment, and to the conceptualization, categorization, production and consumption of natural resources. This course focuses on non-biomedical systems of medicine: Ayurveda, Unani, siddha, Tibetan medicine, yoga and nature cure and homeopathy, as each one of these is supported and regulated by the government of India. The purpose of the course is not to evaluate the effectiveness or medical value of these systems; it is to understand how these medical systems fit into a range of social, political, ecological, botanical and economic contexts. Given that a number of these medical systems are intimately linked to Himalayan botanical and environmental knowledge, the course will focus on the relationship between South Asian medical systems and mountain ecology.", "completed": false}, {"dept_code": "ANTH", "id": "1801", "course_title": "HIMALAYAN BIODIVERSITY", "description": "Ranging in altitude from several hundred meters above sea level to over seven thousand, from subtropical forests to high altitude meadows and deserts, and from areas with little or no rainfall to regions that are among the wettest in the world, the Himalayas define a geographical region of enormous geological variation and biodiversity. The goal of this course is to gain an understanding of this diversity, with a focus on ecology. More specifically we will examine ecology and ecosystems in terms of biosemiotics ' how and why organisms within an ecological niche communicate with one another, and how these patterns and structures of communication define different kinds of interdependence. Within the framework of standard classificatory schemes ' mammals, birds, reptiles, insects ' we will focus on particular species and specific niche systems for more detailed biosemiotic/behavioral analysis.", "completed": false}], "links": []}