{"nodes": [{"dept_code": "HAA", "id": "0010", "course_title": "INTRODUCTION TO WORLD ART", "description": "This course explores the question `what is art through a close analysis of select art works from around the globe, introducing students to the types of questions art historians bring to the images, objects and sites human beings have taken particular care to craft and conceptualize. What role has art played in a diverse range of human cultures across time?", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0018", "course_title": "DEATH IN THE ANCIENT WORLD", "description": "The death of a loved one is an emotional and powerful occurrence that provokes a variety of human responses. In addition to writings describing their funerary practices, the civilizations of the ancient Mediterranean region have left artistic representations of death and dying, built tombs, and objects associated with funerary rituals. The study of these texts, images, structures, and objects allows us to better understand ancient attitudes and reactions to death. This undergraduate lecture focuses on the visual and material evidence of funerary practices and beliefs in ancient Egyptian, Greek, and Roman societies. The subject will be approached thematically. First, we will explore how archaeologists discover death-related artifacts and how scholars approach the study and reconstruction of ancient death rituals. Ancient practices and beliefs regarding the mummification, the funeral, commemorative strategies, visits to the grave, and the afterlife will be explored, and images found on specific media (vases, sculpture, built tombs, paintings) will be discussed in depth. The course will conclude with discussions of the roles that sensational topics, like fear of the undead (zombies, vampires, and ghosts) and spectacles of death (gladiatorial contests and public executions), played in ancient Mediterranean civilizations.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0020", "course_title": "INTRODUCTION TO ASIAN ART", "description": "This base level survey is meant, on the one hand, to introduce the student to the arts of Japan, China, and India and on the other, to teach some fundamental techniques of visual analysis. The course considers the development of Chinese bronzes, Chinese Buddhist sculpture, Indian Hindu and Buddhist sculptures, and Japanese temples, sculptures, and paintings.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0030", "course_title": "INTRODUCTION TO MODERN ART", "description": "The course will present a chronological survey of Western European, Russian, and American art from the mid-nineteenth century to the present (impressionism to post-modernism). In addition to charting the dramatic stylistic and conceptual changes in art during this time period, the course will consider the historical circumstances which caused a disintegration in accepted notions of what constituted a significant work of art.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0050", "course_title": "INTRODUCTION TO MEDIEVAL ART", "description": "A survey of the architecture, painting, sculpture and minor arts of the medieval world from ca. 300 To ca. 1450 With the emphasis on visual analysis of period styles.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0101", "course_title": "FOUNDATIONS OF ART HISTORY", "description": "Foundations of Art History is a core course for the HAA major and offers an introduction to the history of the art historical discipline and its research and interpretive methods.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0102", "course_title": "PROSEMINAR FOR UNDERGRADUATE MAJORS", "description": "This is professional development workshop that assists students with resume development, networking, and establishing and meeting career goals.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0106", "course_title": "MUSEUM STUDIES INTERNSHIP PREP WORKSHOP", "description": "This workshop is required for Museum Studies majors seeking to pursue the internship option. This course must be taken before enrolling in the internship credits HAA 1905.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0125", "course_title": "MUSEUMS: SOCIETY AND INCLUSION?", "description": "What are museums? Who are museums for? This course prompts students to contemplate the role of the museum in society as a public institution. What publics do they serve? How do they generate civic identity and cosmopolitanism? How do they advance learning and spark curiosity? Simultaneously, this course also focuses intensively and purposefully on the historical dependency between the modern institution and forces of colonialism and imperialism, on contested claims of ownership and representation (cultural property and agency), and ethical questions that contemporary museums face (access and inclusion). The course will address the function of the museum in relationship to its collecting practices and its publics in the past and present, and examine innovative initiatives, projects, methods and structures that are being designed to advocate for greater inclusion and equity. Students will not only learn that museums were shaped by and in turn shaped uneven power relationships and inequity, but will also consider how museums might serve and speak with diverse communities more productively in the future.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "0860", "course_title": "INTRODUCTION TO PUBLIC HISTORY", "description": "The course will introduce students to the theory, methodology, and practice of Public History. Public History is the employment of professional historical methods by public and private agencies to engage communities in shaping the presentation of the past into usable histories. Through the course, students will be able to analyze how Public historians and the Public collaborate to explain individual and collective human behavior through a variety of methods, mediums, and contexts. Moreover, students will learn how Public Historians and the Public create and express historical meaning for their local, state, national, and global communities.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "1022", "course_title": "EXHIBITION PRESENTATION", "description": "This course teaches museum practice through practical experience with the permanent collection and with special exhibitions. Students will help in all aspects of exhibitions, from writing labels and/or catalogue copy, deciding how to best display the works, participating in the actual installation of exhibitions and planning related events such as tours.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "1026", "course_title": "EXHIBITIONS: FROM WORLD'S FAIRS TO GLOBAL BIENNIALS", "description": "This course surveys the Western origins of museums, world's fairs, and biennials in the 19th century and traces the increasingly global development of exhibitions of visual and material culture up through the present day. Our focus in this long and varied history will be on those shows that have sought, not without controversy, to shape viewers' knowledge of the past, while also structuring their sense of self and relationship to others in national, international, universal, and/or global terms. We'll critically assess the motivations behind these exhibitions and the changing \"world picture\" each presented in relation to modernizing and globalizing tendencies of the past two centuries. We'll also take a close look not only at what these shows presented, but also how and for what purpose(s) our chosen exhibitions were organized. Whose worldview, ideology, and/or political interests did they serve? How in each case did the very arrangement of objects and the physical context of their presentation seek to articulate those interests? What sort of public did they envision and attempt to create? We'll also address how and to what extent the achievements and shortcomings of earlier exhibitions have informed the character of subsequent shows down to today. Throughout the course, we'll measure our understanding of this history against local examples of Pittsburgh's rich and extensive museum culture. Written assignments will involve students in exploring these and other local installations as we assess what role museums can and should continue to play in fostering understanding of ourselves and others now and into the future.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "1103", "course_title": "RELIGIONS OF ANCIENT EGYPT", "description": "This course introduces students to ancient Egyptian religious thought and practices with its massive temples, multitude of gods and goddesses, and fascinating funeral rites. The course includes a group project to design a hypothetical Egyptian exhibit for a museum and sessions at the Carnegie museum of natural history.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "1905", "course_title": "MUSEUMS STUDIES INTERNSHIP", "description": "Museum studies minors are required to complete a 3-credit academic internship under the course number HAA 1905. This is both an academic course and an internship placement. Students receive substantive mentoring from a site supervisor at a local museum, collection or historic site, and engage in projects with learning outcomes, whether in curatorial, educational, communications or development departments. Students also participate in monthly cohort meetings with the other interns enrolled in the course, under the guidance of an HAA faculty member, and are required to produce a final product. Note: academic internships through HAA 1905 are also available to HAA majors as an optional elective. The student must apply for the internship through the HAA department.", "completed": false, "prereq_count": 0}, {"dept_code": "HAA", "id": "1950", "course_title": "SENIOR THESIS", "description": "In this course a senior major in the history of art will research and write a research paper and present it as if for publication. The area and topic will be decided upon in consultation with a specific faculty member.", "completed": false, "prereq_count": 0}], "links": []}