{"nodes": [{"dept_code": "ASL", "id": "0101", "course_title": "AMERICAN SIGN LANGUAGE 1", "description": "In this course, students are taught American sign language (ASL) vocabulary and grammatical structures. Students will also learn and ASL fingerspelling system, the use of gestural devices and how to appropriately use the signing space in ASL. Further, students will learn about deaf culture in the United States. Out-of-class participation in deaf community events in required.", "completed": false, "prereq_count": 0}, {"dept_code": "ASL", "id": "0103", "course_title": "AMERICAN SIGN LANGUAGE 3", "description": "This course continues the study of ASL. The students will work on developing intermediate communication skills and will concentrate on production skills. Linguistic and cultural features will be presented in the context of the language learning experiences. This level will also examine and discuss its use and effect on and in the deaf culture.", "completed": false, "prereq_count": 0}, {"dept_code": "ASL", "id": "1615", "course_title": "DEAF CULTURE", "description": "Many deaf people in the U.S. Are united by a language (ASL) that differs from English and a culture with characteristics that differ from those of the larger hearing society. This culture is known as deaf culture, and students in this course will be introduced to various facets of American deaf culture through readings, videos, and discussions. Students will also explore other deaf cultures throughout the world. Among the course foci are: issues of accessibility, perspectives of deaf versus hearing individuals, and various examples of deaf literature.", "completed": false, "prereq_count": 0}, {"dept_code": "ASL", "id": "1715", "course_title": "STRUCTURE OF ASL AND ENGLISH", "description": "", "completed": false, "prereq_count": 1}, {"dept_code": "ASL", "id": "1725", "course_title": "SOCIOLINGUISTICS OF SIGN LANGUAGE", "description": "There are various sociolinguistic topics that one must consider with respect to signed languages of the deaf. Regarding language contact, ambient languages-either signed or spoken-influence a signed language. Less than 10% of deaf people are exposed to signed language from birth, which results in unique phenomena. Additionally, signed languages exhibit variation based on a myriad of social and geographical factors. These topics, in addition to language planning and language policy, will be addressed in this course.", "completed": false, "prereq_count": 0}], "links": [{"source": "0103", "target": "1715"}]}