{"nodes": [{"dept_code": "CS", "id": "0007", "course_title": "INTRODUCTION TO COMPUTER PROGRAMMING", "description": "This is a first course in computer science programming. It is recommended for those students intending to major in computer science who do not have the required background for cs 0401. It may also be of interest to students majoring in one of the social sciences or humanities. The focus of the course is on problem analysis and the development of algorithms and computer programs in a modern high-level language.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0010", "course_title": "INTRODUCTION TO COMPUTING FOR SYSTEMS ENGINEERS", "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution). CS 0010 in particular will focus on problems related to IoT and engineering. Students will be required to purchase a Raspberry Pi and sensors in order to complete the projects and labs assigned throughout the course.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0011", "course_title": "INTRODUCTION TO COMPUTING FOR SCIENTISTS", "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution). CS 0011 in particular will focus on problems related to the natural sciences with an emphasis on computational biology. Domain-specific projects and labs will be assigned throughout the course to encourage students in the natural sciences to apply computing to their field of study.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0012", "course_title": "INTRODUCTION TO COMPUTING FOR THE HUMANITIES", "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution). CS 0012 in particular will focus on problems related to the humanities and allied social sciences. Domain-specific projects and labs will be assigned throughout the course to encourage students in these fields to apply computing to their studies.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0134", "course_title": "WEB SITE DESIGN AND DEVELOPMENT", "description": "This course will provide a basic understanding of the methods and techniques of developing a simple to moderately complex web site. Using the current standard web page language, students will be instructed on creating and maintaining a simple web site. After the foundation language has been established, the aid of an internet editor will be introduced. A second web-based language will be included to further enhance the web sites.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0441", "course_title": "DISCRETE STRUCTURES FOR CS", "description": "The purpose of this course is to understand and use (abstract) discrete structures that are backbones of computer science. In particular, this class is meant to introduce logic, proofs, sets, relations, functions, counting, and probability, with an emphasis on applications in computer science.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0445", "course_title": "ALGORITHMS AND DATA STRUCTURES 1", "description": "This course emphasizes the study of the basic data structures of computer science (stacks, queues, trees, lists) and their implementations using the java language. Included in this study are programming techniques that use recursion, reference variables, and dynamic memory allocation. Students in this course are also introduced to various searching and sorting methods and also expected to develop an intuitive understanding of the complexity of these algorithms.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "0447", "course_title": "COMPUTER ORGANIZATION AND ASSEMBLY LANGUAGE", "description": "The purpose of this course is to study the components of computing systems common to most computer architectures. In particular, this class is meant to introduce data representation, types of processors, memory types and hierarchy, and device drivers. The students will learn MIPS assembly language, the design of arithmetic and logic units, and basic designs for RISC processors.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "0449", "course_title": "INTRODUCTION TO SYSTEMS SOFTWARE", "description": "This course covers topics related to the interface of hardware and software. It covers device interfaces and hardware synchronization at the lowest level of the operating system, the linkage of operating system services to application software, and the fundamental mechanisms for computer communications.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "0590", "course_title": "SOCIAL IMPLICATIONS OF COMPUTING TECHNOLOGY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "1501", "course_title": "ALGORITHMS AND DATA STRUCTURES 2", "description": "As the second in a two-course sequence on algorithms and data structures, this course covers a broad range of the most commonly used algorithms. Some examples include algorithms for searching, encryption, compression, graphs, and dynamic programming. The students will implement and test several algorithms. The course is programming intensive.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1502", "course_title": "FORMAL METHODS IN COMPUTER SCIENCE", "description": "The course is an introduction to the theory of information and computation as a physical phenomenon. The course covers standard formalizations of computational concepts and proofs of noteworthy implications of these formalizations. Typical topics include: finite automata, computability, reducibility, and complexity.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1510", "course_title": "ALGORITHM DESIGN", "description": "This course will cover methods and strategies that are useful for the design of nonnumeric algorithms. Students are expected to design their own algorithms.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1520", "course_title": "PROGRAMMING LANGUAGE FOR WEB APPLICATIONS", "description": "Various programming paradigms will be studied using java and scripting languages. The use of java in programming web based applications, network applications, and the use of the extensive java libraries will be studied. The programming paradigm of building software by gluing components will be explored through the use of scripting languages such as perl and JavaScript. Applications include developing guis and internet programming.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1530", "course_title": "SOFTWARE ENGINEERING", "description": "The purpose of this course is to provide a general survey of software engineering. Some of the topics covered include: project planning and management, design techniques, verification and validation, and software maintenance. Particular emphasis is on a group project in which a group of students implement a system from its specification.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1550", "course_title": "INTRODUCTION TO OPERATING SYSTEMS", "description": "An introduction to basic concepts of operating systems, common to most computer systems, which interfaces the machine with upper-level programs. This course will introduce processes as processing unit, process management, concurrency, communication, memory management and protection, and file systems.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1555", "course_title": "DATABASE MANAGEMENT SYSTEMS", "description": "The objective of this course is to provide an in-depth knowledge of database systems design. Thus, the emphasis is on how to model ones own data and how to use available database management systems effectively. Towards this end, the relational and the object-relational models are discussed in great detail and object-oriented and other data models are also presented. Commercial database management systems are examined and students get practical experience through the use of such systems.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1566", "course_title": "INTRODUCTION COMPUTER GRAPHICS", "description": "This course offers an in-depth exploration of fundamental concepts in 2d and 3d computer graphics. The bulk of the course is devoted to 3d modeling, geometric transformations, and 3d viewing and rendering.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1621", "course_title": "STRUCTURE PROGRAMMING LANGUAGES", "description": "An analytical examination of modern high-level programming language structures; including design specification and implementation. Advanced forms of data types, expressions, and control primitives. Relationship of storage management techniques and language design.", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "1632", "course_title": "SOFTWARE QUALITY ASSURANCE", "description": "This course provides students with a broad understanding of modern software testing and quality assurance. Although it will cover testing theory, the emphasis is on providing practical skills in software testing currently used in industry. To that end, it will cover: manual and automated tests, test-driven and behavior-driven development, performance testing, and understanding and developing a testing process.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1637", "course_title": "INTRODUCTION TO HUMAN-COMPUTER INTERACTION", "description": "The focus of the course is on the design of human-centered systems that people find usable, desirable, and useful. The course will introduce students to user-centered practices in Human Computer Interaction. The course will cover the theory and practical application of Human-Computer Interaction concepts and ideas. Students will gain knowledge on diverse methods and tools to understand, improve, and create technology that harmonizes with and improves human capabilities, goals, and social environments.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1640", "course_title": "BIOINFORMATICS SOFTWARE DESIGN", "description": "This course will develop software for bioinformatic applications.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1645", "course_title": "INTRODUCTION TO HIGH PERFORMANCE COMPUTING SYSTEMS", "description": "This course is an introduction to the architecture of and software techniques for parallel and high performance computing systems. The content includes fundamental aspects of vector processing, shared-memory, and distributed-memory systems. Specific applications in parallel processing paradigms will be covered.", "completed": false, "prereq_count": 3}, {"dept_code": "CS", "id": "1653", "course_title": "APPLIED CRYPTOGRAPHY AND NETWORK SECURITY", "description": "This course will provide the necessary conceptual background and hands-on experience to understand the most common cryptographic algorithms and protocols and how to use them to secure computers networks and distributed applications. Topics include: cryptographic algorithms for data confidentiality, authentication, and integrity, user authentication methods (secure tokens and biometrics), internet security protocols, security in local area networks, firewalls, and intrusion detection systems.", "completed": false, "prereq_count": 2}, {"dept_code": "CS", "id": "1656", "course_title": "INTRODUCTION TO DATA SCIENCE", "description": "This course aims to expose students to different data management, data manipulation, and data analysis techniques. The class will cover all the major data management paradigms (relational/SQL, XML/Xquery, RDF/SPARQL) including NOSQL and data stream processing approaches. Going beyond traditional data management techniques, the class will expose students to information retrieval, data mining, data warehousing, network analysis, and other data analysis topics. Time permitting, the class will include big data processing techniques, such as the map/reduce framework.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1660", "course_title": "INTRODUCTION TO CLOUD COMPUTING", "description": "Cloud computing has emerged as a new paradigm for efficient and highly elastic delivery of computing services over the Internet to achieve economies of scale. The course will explore the concept of Cloud Computing, considering both its benefits and challenges. The course will also cover the basic design principles and architectures of Cloud Computing, including its usability and utility to deliver efficiently and flexibly infrastructure, platform and software as a service. Topics include types of public, private and hybrid cloud computing services, data centers architecture and deployment, cloud computing programming models, virtualization and virtual networking and storage, and large-scale distributed processing framework to manage, process and store big data applications running in clustered systems. The course will also include hands-on projects focused on developing applications on a MapReduce and Hadoop cluster. Upon successfully completing the course of the course, students will gain understating of the goals, benefits and models of cloud computing, and how storage, processing and services are designed and managed in a virtualized environment. Through hands-on projects, students will demonstrate proficiency in deploying and evaluating cloud computing applications and services. They will be able to design and deploy data-centered applications and services, and efficiently use frameworks and tools for data analytics.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1666", "course_title": "PRINCIPLES OF COMPUTER GAME DESIGN AND IMPLEMENTATION", "description": "The purpose of this course is to give an introduction and insight into designing and implementing video games. This course questions the nature, intent, and motivation of games and how to construct a compelling experience for users. It is a project-based course, with a final project being to make a game with a small team.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1671", "course_title": "HUMAN LANGUAGE TECHNOLOGIES", "description": "This course provides an introduction to the field of natural language processing (NLP) - the creation of computer programs that can understand, generate, and learn languages used by humans. It will expose students to real-world applications such as speech recognition, information retrieval, dialogue agents, question answering systems, and machine translations by means of computational techniques including search algorithms, dynamic programming, hidden Markov models, probabilistic context free grammars, and related machine learning algorithms.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1674", "course_title": "INTRODUCTION TO COMPUTER VISION", "description": "In this class, students will learn the basics of modern computer vision. The course will cover topics such as image filtering, edge detection, feature extraction, description and matching, grouping and clustering, object detection, activity recognition, and recognition with a human in the loop.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1675", "course_title": "INTRODUCTION TO MACHINE LEARNING", "description": "This introductory machine learning course will give an overview of many models and algorithms used in modern machine learning, including linear models, multi-layer neural networks, support vector machines, density estimation methods, bayesian belief networks, clustering, ensemble methods, and reinforcement learning. The course will give the student the basic ideas and intuition behind these methods, as well as, a more formal understanding of how and why they work. Through homework assignments students will have an opportunity to experiment with many machine learning techniques and apply them to various real-world datasets.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1678", "course_title": "INTRODUCTION TO DEEP LEARNING", "description": "This undergraduate course will cover the basics of modern deep neural networks. The first part of the course will introduce neural network architectures, activation functions, and operations. It will present different loss functions and describe how training is performed via backpropagation. In the second part, the course will describe specific types of neural networks, e.g. convolutional, recurrent, and graph networks, as well as their applications in computer vision and natural language processing. The course will also briefly discuss reinforcement learning and unsupervised learning, in the context of neural networks. In addition to attending lectures and completing bi-weekly homework assignments, students will also carry out and present a project.", "completed": false, "prereq_count": 1}, {"dept_code": "CS", "id": "1906", "course_title": "COMPUTER SCIENCE COOPERATIVE PROGRAM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "CS", "id": "1980", "course_title": "TEAM PROJECT DESIGN AND IMPLEMENTATION", "description": "Students will choose a project from proposals provided by our faculty and industry partners. Teams will consist of 3 or 4 students and they will be supervised by a project mentor. This course satisfies the capstone requirement.", "completed": false, "prereq_count": 1}], "links": [{"source": "0441", "target": "1501"}, {"source": "0441", "target": "1502"}, {"source": "0445", "target": "0447"}, {"source": "0445", "target": "0449"}, {"source": "0445", "target": "1501"}, {"source": "0445", "target": "1502"}, {"source": "0445", "target": "1520"}, {"source": "0445", "target": "1530"}, {"source": "0445", "target": "1632"}, {"source": "0447", "target": "1550"}, {"source": "0447", "target": "1566"}, {"source": "0447", "target": "1645"}, {"source": "0449", "target": "1550"}, {"source": "0449", "target": "1632"}, {"source": "0449", "target": "1645"}, {"source": "0449", "target": "1653"}, {"source": "1501", "target": "1510"}, {"source": "1501", "target": "1555"}, {"source": "1501", "target": "1637"}, {"source": "1501", "target": "1640"}, {"source": "1501", "target": "1645"}, {"source": "1501", "target": "1653"}, {"source": "1501", "target": "1656"}, {"source": "1501", "target": "1666"}, {"source": "1501", "target": "1671"}, {"source": "1501", "target": "1674"}, {"source": "1501", "target": "1675"}, {"source": "1501", "target": "1678"}, {"source": "1502", "target": "1510"}, {"source": "1550", "target": "1660"}, {"source": "1550", "target": "1980"}]}