{"nodes": [{"dept_code": "GER", "id": "0101", "course_title": "BEGINNING GERMAN 1", "description": "This is the first part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will be working towards the A1-level of the Common European Framework of Reference. Students should plan to take German 0102 during the following semester.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0102", "course_title": "BEGINNING GERMAN 2", "description": "This is the second part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will be working towards the A2-level of the Common European Framework of Reference. Students should plan to take either German 0103 or German 0203 during the following semester.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0103", "course_title": "BEGINNING GERMAN 3", "description": "This is the third part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will continue to work towards the A2-level of the Common European Framework of Reference. Students should plan to take German 201 during the following semester", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0201", "course_title": "INTERMEDIATE GERMAN 1", "description": "This is the first part of our intermediate language course sequence. These courses will provide students with opportunities to further develop their listening, speaking, reading and writing skills, to strengthen their grammatical knowledge and expand their vocabulary. Students will begin to work towards the B1-level of the Common European Framework of Reference. Students should plan to take German 202 during the following semester", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0202", "course_title": "INTERMEDIATE GERMAN 2", "description": "This is the second part of our intermediate language course sequence. These courses will provide students with opportunities to further develop their listening, speaking, reading and writing skills, to strengthen their grammatical knowledge and expand their vocabulary. Students will continue to work towards the B1-level of the Common European Framework of Reference.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1000", "course_title": "READING LITERARY TEXTS", "description": "This course aims to strengthen your reading skills in German by introducing you to a variety of genres and writing styles, from the eighteenth to the twenty-first century. You will have the opportunity to work on your extensive and intensive reading skills, as you acquire new strategies for identifying generic conventions, differentiating between literal and figurative language, and parsing grammatically complex sentences", "completed": false, "prereq_count": 1}, {"dept_code": "GER", "id": "1003", "course_title": "PROFESSIONAL GERMAN", "description": "This is an advanced language acquisition course and aims to familiarize students with specialized vocabulary and practices of German-speaking countries in professional environments of such areas as communications, advertisement, international trade, engineering, and law. The course will focus on oral and aural proficiency, appropriate written discourse and reading. The course integrates economic geography the legal and political system of German-speaking countries.", "completed": false, "prereq_count": 1}, {"dept_code": "GER", "id": "1105", "course_title": "LITERARY ANALYSIS", "description": "General content, purposes, and methods of this course: students will learn the characteristic features of poetry, prose, and drama and will develop a technical vocabulary to interpret literary works in German. We will also learn about some of the different methodologies and theoretical approaches that literary critics employ to analyze texts. We will build upon and expand the reading techniques and strategies learned in 1000-level courses to prepare students for the more advanced literature and culture seminars at the 1200-level. Readings, class discussions, tests, oral reports and written assignments, including a journal, will be in German.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1399", "course_title": "SENIOR CAPSTONE SEMINAR", "description": "This course is for senior German majors. It will require students to write a senior thesis on a German topic, drawn from their own interests but also related to the focus of the seminar. The specific focus of the seminar will change each year, depending on the instructor, but will be constructed to highlight the intersections between multiple epochs, genres, themes, and/or disciplines. Every version of the seminar will require a senior thesis or project that allows the student to pursue his/her own interests within the topic of the seminar. Seminar readings will be in German.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1502", "course_title": "INDO-EUROPEAN FOLKTALES", "description": "German 1502 is a study of the esthetic, psychological, and social values reflected in a variety of European folklore genres, including magic tales, legends, proverbs, superstitions, and jests. The Grimms' pioneering collections constitute the course's nucleus, but it draws numerous supporting examples from other European countries as well.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1522", "course_title": "GERMANY TODAY", "description": "In this course the current cultural, political, and social situation in the German speaking countries is assessed. What are the concerns of Germans, Austrians, the Swiss? By concentrating on current conditions and changes of public consciousness, issues important to German speakers are debated. Materials include articles from journals and newspapers, documentaries, slides, and contemporary works of literature. All materials are in English.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1530", "course_title": "WEIMAR CULTURE", "description": "An introduction to the weird and wonderful literature, film, and visual art of Germany's Weimar Republic (1918-1933), a period of crisis and transition. Join us as we use an intersectional feminist approach to examine representations of sex and sexualities, gender, race, ability, and social class during this era of revolution and upheaval in German history. We will explore texts by Franz Kafka, Irmgard Keun, and Magnus Hirschfeld, classic films like Fritz Lang's Metropolis and Robert Wiene's The Cabinet of Dr. Caligari, and artwork by Georg Grosz, Otto Dix, and Hannah Höch, among others. Taught in English. This course satisfies the Diversity and Geographic Region general education requirements.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1542", "course_title": "MARX AND MARXISM", "description": "Having recently passed the 150th anniversary of the publication of capital volume 1, we recognize that our world has changed a great deal since its publication. Yet, in reviewing many of these changes, it is not overstated to say that the works of Karl Marx have provided the transformational impulse. Who was this person, Karl Marx? Why is it that in this post-cold war world his writings continue both to inspire and threaten contemporary readers? How have those inspired by Marx further developed his ideas to constitute the discourse of Marxism? These are some of the questions that this course will raise and try to answer. We will begin with discussions of key works by Marx. Concentrating on the question of culture and cultural analysis, we will then move on to examine some significant contributions to Marxism. The course will end by looking at contemporary attempts at rethinking Marxism.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1550", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1903", "course_title": "GERMAN LANGUAGE TRAILER", "description": "", "completed": false, "prereq_count": 0}], "links": [{"source": "0202", "target": "1000"}, {"source": "0202", "target": "1003"}]}