{"nodes": [{"dept_code": "CSD", "id": "1020", "course_title": "NATURE OF LANGUAGE", "description": "This course provides an overview of linguistics and psycholinguistics including phonologic, morphologic, syntactic, semantic, and pragmatic aspects of linguistic theory and behavior. Topics may also include neurolinguistics, developmental psycholinguistics, and the relationship between cognition and language.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1022", "course_title": "TRANSCRIPTION PHONETICS", "description": "The study of the phonemics of American English and of broad and narrow phonetic transcription, utilizing the international phonetic alphabet. Attention will also be paid to the transcription of abnormal speech patterns.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1023", "course_title": "ANATOMY AND PHYSIOLOGY OF SPEECH", "description": "An overview of the anatomy and physiology of the system involved in speech production including respiration, phonation, articulation, resonation, and nervous system.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1024", "course_title": "ANATOMY AND PHYSIOLOGY OF HEARING", "description": "Study of the anatomy of the outer and middle ears, the middle ear transformer action, and acoustic reflex. Review of cochlear anatomy and theories of the transducer function of the inner ear. Study of central auditory pathways and binatural hearing.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1027", "course_title": "LAB IN ANAT/PHYSIOLOGY OF SPEECH", "description": "This is a one credit required experience for all students enrolled in the CSD 1023: Anatomy and physiology of speech. Includes opportunites to review and enhance understanding of lecture material, utilizing additional drawings, anatomical models and actual specimens.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1029", "course_title": "LAB IN ANAT/PHYSIOLGY OF HEARING", "description": "This is a one credit required experience for all students enrolled in the \"Anatomy and Physiology of Hearing\" course (1024).", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1031", "course_title": "GUIDED CLINICAL OBSERVATION", "description": "In this course guided clinical observations will be used as the context for students acquiring skills in describing and summarizing behaviors relevant to the study of communication disorders. Observation time earned in this course can be applied towards hours of clinical observation required by many graduate programs in audiology and speech-language pathology.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1111", "course_title": "AURAL REHABILITATION", "description": "Principles and practices of aural habilitation and rehabilitation of children and adults. The effects of hearing loss on communication, social and emotional well-being, cognition, and participation in life activities will be addressed. Basic knowledge of treatment approaches and methods, as well as, resources (including technology) to help clients/patients and their family members, will be discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1232", "course_title": "INTRODUCTION TO AUDIOLOGY", "description": "A pre-professional course that introduces elements of the basic audiometric/impedance test battery, advanced tests of diagnostic utility, evaluation of special populations, and the role of the clinical audiologist in aural rehabilitation.", "completed": false, "prereq_count": 0}, {"dept_code": "CSD", "id": "1233", "course_title": "INTRODUCTION TO RESEARCH", "description": "This course provides an introduction to research methods in speech, language, and hearing sciences and communicative disorders. Students will learn how to read and critique research articles more effectively. They will also learn to generate research questions and to develop strategies for collecting data and evaluating experimental effects.", "completed": false, "prereq_count": 0}], "links": []}