{"nodes": [{"dept_code": "BIOENG", "id": "0050", "course_title": "WORKSHOP IN BIOENGINEERING DESIGN", "description": "Students are introduced to Bioengineering design use of the SolidWorks software suite. SolidWorks is one of several computer aided engineering software packages (AutoCAD and ProEngineer are other examples) that is widely used in industry and academia. Skills learned (1) will help with Bioengineering design projects, and (2) are easily translated to other computer engineering packages such as AutoCAD or ProEngineer. The workshop consists of weekly SolidWorks-based practice assignments (tutorials) that must be completed to receive a grade in the course", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1000", "course_title": "STATISTICS FOR BIOENGINEERING", "description": "Bioengineering statistics will present the basic statistical methods that are relevant to engineering and clinical applications. Specifically, students will learn to consider the assumptions inherent to statistical analyses; calculate statistical parameters; automate statistical methods using software; interpret the meaning of statistical parameters; and design experiments conducive to proper statistics. Biological and medical examples will be used to reinforce concepts of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1002", "course_title": "INTRAMURAL INTERNSHIP", "description": "Students employ practical experience, gained from mentored research in an academic environment, which includes project planning, design of experiments, and analysis of results to develop professional quality oral presentation skills. Emphasis is placed on critical analysis of research projects, development of technical abstract writing skills, and development of professional quality visual aids that accompany oral presentations. The course culminates with an oral presentation at a technical symposium. Upon completing the course, the student should be able to prepare a professional quality abstract documenting background, methodology, and results from a research project and make a professional quality oral presentation describing the research.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1005", "course_title": "RADIOFREQUENCY MEDICAL DEVICES", "description": "The course will cover topics related to the applications of electromagnetics and RF in medicine and in other devices that can cause thermal safety hazards. Topics such as Maxwell Equations, Wave Equations, Transmission Lines, Electromagnetic Theorems, Introduction to Antennas, and Introduction to Computational Electromagnetics will be presented. The class will include analyses of several RF devices used in medical applications and/or have electromagnetic safety implications such as magnetic resonance imaging (MRI), biological sensors (brain machine interface), RF ablation, and cell phones. Upon completing the course, the student should be able to describe how to apply fundamental electromagnetic principles to set up and solve problems in RF devices used in medical applications.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1024", "course_title": "MEDICAL PRODUCT DESIGN", "description": "This hands-on course presents a spectrum of techniques used in medical product design and prototyping. Techniques that are covered include sketching, foam core-based prototyping, metrology, laser cutting, CNC routing, sewing, molding, vacuum forming, and basic manual machining. The student will learn these techniques in a design studio stetting and subsequently apply them to analyze, document, and ultimately fabricate a model of medical product such as a blood pressure monitor.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1051", "course_title": "ARTIFICIAL ORGANS 2", "description": "Artificial organs 2 is the second of a three course sequence that explores design, development, and clinical use of artificial organ technology. Each course in the series is stand-alone and, as such, is not a prerequisite for any other course in the series. Students may take one, two, or all three courses. Artificial organs 2 is focused on artificial blood and artificial lung. The basic physiology of each system (blood and the lungs) is reviewed with emphasis on identifying the bioengineering design requirements for appropriate organ replacement systems. Commercially available systems are analyzed from the point of view (where applicable) of mass transfer efficiency; biomechanics and hemodynamic similarity to the host; and size and efficiency of the device. Students will be required to design an artificial organ consistent with the above-mentioned considerations. Upon completing the course, the student should be able to describe the fundamental engineering principles related to blood and lung physiology and apply the fundamental principles to design improvements and/or new designs for artificial blood substitutes and artificial lung devices.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1070", "course_title": "INTRODUCTORY CELL BIOLOGY 1", "description": "Principles of cell biology in higher organisms: structure, function, biosynthesis, and macromolecular organization with a focus on macromolecular organization and function from a quantitative systems perspective. Upon completing the two course sequence, BIOENG 1070 and BIOENG 1071, students should be able to (1) demonstrate understanding of the principles of cell structure and function, (2) describe the experimental tools used to understand cellular function such as molecular genetic techniques, biochemical analysis, and microscopy, and (3) use systems approaches to understand how cellular processes are integrated.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1085", "course_title": "INTRO TO BIOENGINEERING: SEMINAR", "description": "Seminar is designed to acquaint students with aspects of bioengineering that are not normally encountered in the classroom or extracurricular activity settings. As such, seminar is a vehicle to provide important information and communicate materials that students need to know to maximize their educational experience and develop post-graduation plans. Emphasis is placed on career planning and development and options available in the undergraduate program that will help realize post-graduation goals. Student awareness of opportunities that are available and knowledge about how to utilize the opportunities for their benefit.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1086", "course_title": "BIOENGINEERING SEM FOR MINORS", "description": "One hour lecture format by members of the bioengineering community of both the university of Pittsburgh and other institutions.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1160", "course_title": "BIOENGINEERING DESIGN 1", "description": "The two course sequence, bioengineering design 1 & 2, is a mentored opportunity for the student to synthesize and extend skills and knowledge acquired during the undergraduate education experience in design (or redesign) of a biomedical product or equivalent. Students are exposed to key facets of the medical product design process and the unique regulatory requirements for biomedical products. Student teams select a design project, conduct a market/reimbursement analysis, apply design process methodology, maintain a design history file, and create a prototype product. Students will be able to apply appropriate product design-related procedures and tools, maintain design history files, conduct preliminary market/reimbursement studies, and address regulatory affairs in developing a prototype biomedical product or equivalent.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1210", "course_title": "BIOENGINEERING THERMODYNAMICS", "description": "Bio thermodynamics uses an interactive framework in the joint (student and instructor) exploration of thermodynamics as it applies on the biological cellular and systems level. At this most fundamental level, thermodynamics studies the flow of energy, interconversion of energy, maintenance of cellular function and information, and the processes necessary to sustain life itself. Upon completing the course, the student should be able to describe how the three laws of thermodynamics and entropy impact biological systems, and be able to apply fundamental thermodynamics principles to set up and solve problems in physiological systems.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1220", "course_title": "BIOTRANSPORT PHENOMENA", "description": "Transport of nutrients and fluid flow is critical for the function of organisms. This course covers transport of momentum (fluid flow) and mass in biological, physiological, pathophysiological and medical device applications. The fundamental principles of momentum and mass transfer are developed in the microscopic (differential) and macroscopic (integral) form. These principles are applied to solve transport problems in the biological, biomedical and medical device context.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1241", "course_title": "SOCIETAL, POLITICAL AND ETHICAL ISSUES IN BIOENGINEERING", "description": "Engineering, as a profession, has ethical obligations to society that go beyond the simple application of technology as learned in science and technology courses. Bioethics seeks to supplement technological aspects of bioengineering by engaging students in an analysis of the effects of bioengineering developments on society, focusing on safety of the public as a primary ethical concern. Students are educated on a variety of ethical tools that enable them to analyze fictional, yet realistic, cases. Students are evaluated individually, as well as in groups, with a particular focus on the ethical issues related to their senior design projects (BIOENG 1160 & 1161). Upon completion of the course, students will be able to recognize, articulate, and resolve ethical issues within the arena of bioengineering.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1255", "course_title": "DYNAMIC SYSTEMS: PHYSIOLOGICAL PERSPECTIVE", "description": "A foundation of basic systems concepts is built through combining modeling of dynamic systems with physiological examples. Mathematical models of physiological systems are developed using a combination of systems understanding (analogous thinking, engineering synthesis and analysis, and integrative system approaches in solving problems) and bioengineering design (recognizing the potential applications of both engineering principles to biology and biological principles to engineering). These models are then used to address biological/clinical questions. Upon completing the course, the student should be able to: demonstrate skill and competence in methods of dynamic systems modeling through (a) building dynamic models of bioelectrical, biomechanical, biochemical, and physiological systems, (b) solving systems of equations representing dynamic models including analytical, numerical, and graphical software methods, (c) validating models including descriptive, predictive, and explanative validation, and (d) applying models to scientific and engineering applications including analysis and synthesis relative to identification and simulation. Describe physiological processes in dynamic system terms.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1310", "course_title": "LINEAR SYSTEMS AND ELECTRONICS 1", "description": "Bioinstrumentation covers electronic circuit theory and the practical aspects of building electronic prototypes. The mathematics of complex exponentials and complex impedance are also covered. A series of projects are built by each student individually, using a system of student-owned electronics components and tools called the pittkit. The kit includes a special apparatus, the breadboard laboratory interface processor (blip) which each student constructs, and which acts as a logging voltmeter, a frequency meter, a logic analyzer, a waveform generator, and a pulse duration meter. The blip interfaces to any computer via a USB port, without requiring any special software to be installed on the computer. After completing the course, the student should be able to design and construct prototypes of useful, simple circuits, such as preamplifiers and signal conditioners for sensors, as well as use off-the-shelf modules to construct laboratory instrumentation. They should be able to describe applications to other linear systems such as those found in physiological systems with greater clarity from having worked with circuits.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1320", "course_title": "BIOLOGICAL SIGNALS AND SYSTEMS", "description": "The theory and application of linear time-invariant (LTI) systems is explored, with emphasis on an appreciation of the description and analysis of biomedical signals and systems via LTI methods. After completing the course, the student should be able to state the properties of LTI systems; be able to test whether a system is LTI; know how to obtain, and interpret, the frequency response, impulse response, step response, and transfer function of a system. The student should also be able to demonstrate mastery of the mathematical skills of convolution and integral transform techniques", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1330", "course_title": "BIOMEDICAL IMAGING", "description": "Biomedical imaging introduces the major imaging modalities (x-ray, cat-scan, MRI, ultrasound) used in clinical medicine and biomedical research, as well as the fundamentals of images, from a signals and systems standpoint. After completing the course, the student should be able to use imaging modalities to determine anatomical or physiological function and apply physics and signal processing in medical imaging for particular research applications.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1340", "course_title": "INTRODUCTION TO MEDICAL IMAGING AND IMAGE ANALYSIS", "description": "Introduction to Medical Imaging and Image Analysis presents the physics of image formation as well as methods for tomographic image reconstruction for major medical imaging modalities, including X-ray Computed Tomography (CT) and Magnetic Resonance Imaging (MRI). Also introduced are fundamentals of digital image processing, with particular emphasis on medical applications, including basic techniques to enhance image quality, image de-noising, methods for extracting, classifying, and tracking features of and objects in images, etc. Students will learn how to implement these techniques in MATLAB (The MathWorks Inc., Natick, MA) to solve practical image processing problems. MATLAB exercises will demonstrate to students how filtering operations applied in the image domain or the Fourier domain affect medical images. In addition to these fundamentals, more advanced algorithmic approaches for image segmentation and image as well as point-cloud registration techniques will also be reviewed.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1351", "course_title": "COMPUTER APPLICATIONS IN BIOENGINEERING", "description": "The objective of this course is to develop data acquisition interfaces that include software and hardware to interact with and sample real world phenomena with bioengineering applications. Students will be expected to have basic MATLAB programming experience before joining this course; basic circuits knowledge is also advantageous. Students will build circuits, and will learn to work with several toolboxes and advanced features in Matlab to build graphical user interfaces (GUIs), communicate with data acquisition systems (DAQs) for measuring signals with sensors and/or controlling actuators to interact with the physical world, and perform signal processing and analysis functions to extract meaningful information from electrical and/or biological measurements. Practical applications may include measuring and analyzing bioelectric phenomena related to heart rate or tissue impedance, processing and analyzing neural signals collected from implanted electrodes in the brain, etc. Students will be able to create solutions for real world engineering problems after completing this course successfully.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1370", "course_title": "COMPUTATIONAL SIMULATION IN MEDICAL DEVICE DESIGN", "description": "Computational simulation is increasingly utilized as a method to assess the performance of medical devices. The course provides students with a hands on learning experience on how to use computational simulation in the modeling and design of medical devices. The course details the important steps in computational simulations from preprocessing to solution to post-processing and data presentation. Commercially available software programs are introduced and used to simulate a variety of physical phenomena (solid, fluid, transport) pertinent to medical device design. Upon completing the course, the student should be able to simulate the solid, fluid, and transport phenomena that are useful in medical device design. Particular attention will be placed on avoiding common mistakes in the preprocessing and interpretation of computational results. Topics covered: geometry creation; discretization; appropriate assignment of material properties; solver management; error mitigation and debugging; postprocessing and data presentation; data interpretation; introduction to design optimization.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1615", "course_title": "INTRODUCTION TO NEURAL ENGINEERING", "description": "This is an introductory neural engineering course for upper level undergraduate and graduate students interested in implantable cortical neural interface technology and research. The course covers two main topics; 1) basic neuroscience principles that govern neural interface engineering (ion channel biophysics, overview of different neuronal and non-neuronal cell types and how they interact with implantable microelectrodes, the basics of cortical organization, simple signal propagation through these neuronal networks, and how these signals can be extracted with implantable microelectrodes). 2) Overview of biological and engineering technologies and methodologies used in neural engineering research as well as their capabilities and limitations. Students will be provided raw neural recording and histology datasets, and will learn to assemble MATLAB based tools for basic signal processing and analysis.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1631", "course_title": "BIOMECHANICS 2: INTRODUCTION TO BIODYNAMICS AND BIOSOLID MECHANICS", "description": "Modern biomechanics is an increasingly diverse field that encompasses the mechanics of the whole body, all the way down to the cellular and molecular levels. Students are introduced to fundamental concepts and techniques of biodynamics and bio solid mechanics which provide the basis for biomechanics 3 and 4. General approaches used in mechanics are introduced throughout the semester and applied in several laboratories. Upon completing the course, the student should be able to demonstrate recall of functional anatomy of musculoskeletal system perform inverse dynamic analyses describe the principles of basic muscle biomechanics perform analyses of deformable bodies (including viscoelastic materials) describe general experimental techniques for rigid and deformable body analyses.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOENG", "id": "1633", "course_title": "BIOMECHANICS 4 - BIOMECHANICS OF ORGANS, TISSUES, AND CELLS", "description": "Modern biomechanics is an increasingly diverse field that encompasses the mechanics of the whole human body, including all the way down to the cellular and molecular levels. Biomechanics 4 builds upon biomechanics fundamentals learned in BIOENG 1630 and BIOENG 1631 in building a comprehensive application of bio solid mechanics to describe the mechanical behavior of soft and hard biological tissues. The course provides fundamental concepts in the development and application of constitutive models, as well as a foundation for more advanced topics that are covered in graduate school. Mathematica (Wolfram Research, Inc.) Is used both in class and for assignments. Upon completing the course, the student should be able to formulate biomechanics constitutive models that describe soft and hard tissues and use Mathematica as a framework for exploring the impact of model parameters in the model description.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOENG", "id": "1810", "course_title": "BIOMATERIALS AND BIOCOMPATIBILITY", "description": "Undergraduate students are introduced to an advanced understanding of biomaterials and the use of biomaterial in areas such as tissue engineering, artificial organs, and implantable devices. Throughout the course, ties are made between the topic of study and clinically relevant biomaterial performance. The course introduces various biomaterials, such as polymers, metals, and ceramics, with the focus on biomaterial synthesis, characterization, structure-property relationship and surface modification. Biocompatibility issues of biomaterials will be discussed from different aspects such as protein adsorption, foreign body reaction, immune and inflammatory response, and sterilization. Finally, examples of clinical applications are discussed. Upon completing the course, the student should be able to: state the basic principles behind human tissue response to artificial surface implantation, describe the general types of materials used in soft and hard tissue replacements, drug delivery devices, and extracorporeal devices, describe techniques utilized to control the physiologic response to artificial surfaces, and identify various design strategies and clinical applications of biomaterials", "completed": false, "prereq_count": 0}], "links": [{"source": "1000", "target": "1002"}, {"source": "1160", "target": "1241"}, {"source": "1210", "target": "1220"}, {"source": "1310", "target": "1320"}, {"source": "1320", "target": "1330"}, {"source": "1320", "target": "1340"}, {"source": "1631", "target": "1633"}]}