{"nodes": [{"dept_code": "IRISH", "id": "0102", "course_title": "IRISH (GAEILGE) 2", "description": "At the end of the second term of the first year of study the student should be able to produce all the significant sound patterns of the language, to recognize and use the major grammatical structures within a limited core vocabulary. The student should be able a) to engage in simple conversations with native speakers about a limited number of everyday situations and b) to read and write simple material related to the situations presented.", "completed": false, "prereq_count": 0}, {"dept_code": "IRISH", "id": "0104", "course_title": "IRISH (GAEILGE) 4", "description": "At the end of the second term of the second year the student should be able to converse comfortably with a native speaker on a variety of non-specialized subjects. The student will be offered an opportunity to experience and more fully understand the culture of the people who use the language through readings of various types. More complex writing tasks will be expected at this level.", "completed": false, "prereq_count": 0}, {"dept_code": "IRISH", "id": "0106", "course_title": "IRISH (GAEILGE) 6", "description": "This course follows on level 5. Students will continue to break down the mechanics of the language and work towards independent success and higher level thinking. They now move to making evaluations on texts, freely expressing opinions of guided lessons, and independent discovery of grammatical structures. They are equipped for more independent learning, reading articles on culturally relevant topics, both at home and in the community, and engaging in higher level thinking. They work on their own and in groups to dissect the mechanics of the language, rationalize the texts, and make connections between grammar, natural speech, and idiomatic phrases. Students are expected to come to class enthusiastic and prepared and use this time to learn.", "completed": false, "prereq_count": 0}, {"dept_code": "IRISH", "id": "1615", "course_title": "IRISH CULTURE AND TRADITIONS", "description": "", "completed": false, "prereq_count": 0}], "links": []}