{"nodes": [{"dept_code": "PUBSRV", "id": "0020", "course_title": "INTRODUCTION TO PUBLIC SERVICE", "description": "This course introduces students to the fields of public service. In addition to addressing the concept of public service, it provides students the opportunity to explore the various public service options. These include elected and appointed positions, volunteerism, and work in non-profit organizations. An effort will be made to give students an appreciation of the skills and talents required to effectively serve in these capacities. Classes will involve presentations by a variety of public service professionals, field visits and service learning opportunities.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "0040", "course_title": "PUBLIC SERVICE TECHNOLOGIES", "description": "This course presents an overview of existing and emerging technologies that may be used by public service professionals to accomplish organizational goals or improve efficiency and effectiveness. Through discussions, readings, internet research and hands-on computer exercises, it will emphasize current information technology concepts, issues, and practices in the United States. In addition, it will provide students with a technology skill set utilized in subsequent courses and in the practice of a public service career.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "0050", "course_title": "ETHICS AND ACCOUNTABILITY", "description": "This course is an undergraduate course offered through the Public Service major by the Graduate School of Public and International Affairs. It will be an introduction to Ethics and Accountability and will focus on enhancing the capacity of students to make difficult and necessary ethical choices on the basis of limited information and frequently conflicting values. The purpose of this course is that in their personal lives and future roles as professionals in a chosen field, students will face moral and unethical dilemmas that resist easy answers or a simpler formula and action.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1110", "course_title": "FINANCIAL MANAGEMENT IN THE PUBLIC SECTOR", "description": "Participants are provided with an overview of the financial management concepts and practices. Stress is put on the strengths, weaknesses, and critical roles financial management plays in aiding public service managers to better realize their programmatic goals and objectives.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1130", "course_title": "PLANNING IN THE PUBLIC SECTOR", "description": "This course will introduce the profession of urban planning through a review of the historical development of cities. With this framework we will look at the actual work of the planner: data gathering, analysis, policy, public process and politics. We will address the relation between the physical nature of cities and the quality of community that develops. Course underscores the importance of physical and geographic determinants to city growth, and makes the connection between democratic values and city development policy.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1200", "course_title": "PRACTICES OF NON-PROFIT MANAGEMENT", "description": "Introduction to forms of non-profit organizations and their roles in American society. Course evaluates how non-profit organizations define their policy and service roles and examines the context of how they are organized, governed, financed, staffed, and managed. Other topics to be examined are law and philanthropy, voluntarism, strategic planning and marketing, training and developing boards, staff and volunteers, and ethical behavior.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1220", "course_title": "HUMAN RESOURCE MANAGEMENT OF NON-PROFIT ORGANIZATIONS", "description": "This course is an introductory survey of the understandings and skills needed by both managers and employees to cope with the myriad human resources management systems in non-profit organizations. Specific topics include the history and evolution of human resources management, the legal environment, human resources planning, position classification and compensation, recruitment, promotion, termination, performance evaluation and training. Integrated with these topics will be the technical and legal concerns of labor relations, equal employment opportunity and volunteer management.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1305", "course_title": "HEALTH, LAW AND ETHICS", "description": "This course addresses legal and ethical issues encountered by health care practitioners as well as those working in health care management and public health. Strong emphasis is placed on legal and ethical issues that occur within the realm of direct patient care. Topics include, but are not limited to: advance directives, decision making capacity, informed consent, organ donation, end of life decision making, surrogate decision making, and confidentiality. Students will be able to articulate common health care ethics principles, theories, methodology, laws, and concepts and use the same to analyze health care ethics cases. Students will also develop concrete logical arguments in support of a chosen ethical stance.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1310", "course_title": "DIVERSITY ISSUES IN PUBLIC SERVICE", "description": "This course analyzes public service from the perspective of minorities and women. The minorities examined are black American men and women, with lesser attention given to ethnic minorities, those over 45 and the handicapped. The experience and aspirations of these several minorities will be examined in terms of how minority culture illuminates the nature of public service.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1320", "course_title": "GEOGRAPHIC INFORMATION SYSTEMS IN THE PUBLIC SERVICE", "description": "This course introduces the student to geographic information systems software. In addition to familiarizing the student with the software, each student will apply that knowledge to a particular public problem selected by the student in consultation with the instructor. As this is a hands-on course, the format is a combination of lecture and lab/computer time.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1425", "course_title": "PRINCIPLES OF HOMELAND SECURITY", "description": "This course examines the new problems facing our domestic public service and justice personnel -- the borderless world of globalization and technology. Attention is paid to problems of terrorism, incident management systems, violence incident response procedures, planning for violence, changing federal, state, and local roles and response planning, weapons of mass effects, mass casualty programs, crime scene operations, technology and emergency responses, the evolving role of the intelligence community, and government, private, and non-government security issues.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1455", "course_title": "LAW, ETHICS AND PUBLIC POLICY IN THE MASS MEDIA", "description": "This course examines a variety of public policy issues as those issues are impacted by the role and significance of the news and entertainment media. It explores mass media law and policy, with particular attention to regulatory practices.", "completed": false, "prereq_count": 0}, {"dept_code": "PUBSRV", "id": "1910", "course_title": "INSTITUTE OF POLITICS INTERNSHIP/SEMINAR", "description": "While students are obtaining first-hand internship experience working with an official directly involved in policy making for the Pittsburgh region, they will learn in this seminar to analyze the policy-making process as an example of social problem-solving. They will learn the issues confronting the region; they will study the policy-making process; finally they will analyze the method of participant observation.", "completed": false, "prereq_count": 0}], "links": []}