{"nodes": [{"dept_code": "PSY", "id": "0010", "course_title": "INTRODUCTION TO PSYCHOLOGY", "description": "Summary of our present knowledge in fundamental areas of learning, sensation and perception, biological basis of behavior, developmental patterns, motivation, emotion, personality and adjustment, and measurement of behavior. Information and concepts are applied to problems in understanding human behavior. Additional out-of-class experiments or an equivalent research paper are a part of the course.", "completed": false}, {"dept_code": "PSY", "id": "0011", "course_title": "INTRODUCTION TO THE FIELD", "description": "This one-credit course is designed for newly declared psychology majors. Course content will provide an introduction to the psychology department, a review of experiential learning opportunities, a discussion of graduate school and career options including subfields within psychology and related fields, and out of the classroom exercises. Through lectures, guest speakers, in-class exercises, small group discussions and written assignments, students will engage in self-assessment, undertake academic and career planning, develop professional skills and learn to utilize available resources to advance in their careers.", "completed": false}, {"dept_code": "PSY", "id": "0036", "course_title": "RESEARCH METHODS LECTURE", "description": "This course introduces students to the fundamentals of psychological research. Specifically, the goals are to learn how to: a) read, interpret, and understand research; b) critique research; and c) design valid research that is robust to critiques.", "completed": false}, {"dept_code": "PSY", "id": "0037", "course_title": "RESEARCH METHODS LABORATORY", "description": "The course amplifies the introduction to the fundamentals of psychological research provided by PSY 0036, Research Methods Lecture. It introduces students to the fundamentals of writing scientific reports in psychology. Students will learn how to use APA style, how to display and report quantitative results, and basic guidelines for writing format, style, and expression. This course is writing intensive, and students are expected to write research reports and comment extensively on the writing of their peers during in-class and take-home exercises.", "completed": false}, {"dept_code": "PSY", "id": "0105", "course_title": "INTRODUCTION TO SOCIAL PSYCHOLOGY", "description": "An overview of social psychology. The scientific study of how one person's behavior and/or characteristics can influence the thoughts, feelings and behaviors of others. Topics covered include social perception, attitude formation and change; prejudice and discrimination; altruism and aggression; cooperation, competition, and bargaining; group decision making, leadership; and environmental effects on behavior.", "completed": false}, {"dept_code": "PSY", "id": "0160", "course_title": "PSYCHOLOGY OF PERSONALITY", "description": "Survey of major approaches to the study of personality, focusing on their relative abilities to provide coherent explanations for individual behavior. Issues involved in the assessment of personality will also be discussed and several assessment procedures evaluated. Recent research in personality psychology is reviewed and analyzed.", "completed": false}, {"dept_code": "PSY", "id": "0184", "course_title": "PSYCHOLOGY OF GENDER", "description": "This course is an introduction to psychological theories and research on the impact of gender on the human experience. Experiences of cisgender men and women as well as trans individuals and those who identify outside of the gender binary will be discussed. Although the focus will be on societal constructs within the United States, we will also discuss cross-cultural research. Intersections with race and sexual orientation and the influence of power will be considered in the discussion of the effects of cultural factors that determine the gendered nature of cognitive abilities, emotional expression, interpersonal relationships, victimization, labor, and health.", "completed": false}, {"dept_code": "PSY", "id": "0205", "course_title": "PSYCHOPATHOLOGY", "description": "This course provides an overview of the major issues in the area of mental illness. This course emphasizes the scientific approach to understanding the major psychological and behavioral disorders. The research and clinical literatures regarding the etiology, course and treatment of these disorders will be presented.", "completed": false}, {"dept_code": "PSY", "id": "0310", "course_title": "DEVELOPMENTAL PSYCHOLOGY", "description": "The course focuses on development of the child from birth to adolescence, the current theory and research concerning social, emotional, intellectual, perceptual and language development. The organization of the course is topical. Coverage is confined to normal development; what develops, how and why in the average child. Little attention to abnormal development.", "completed": false}, {"dept_code": "PSY", "id": "0422", "course_title": "COGNITIVE PSYCHOLOGY", "description": "This course introduces students to core issues, theories, and experimental finding in cognitive psychology. Topics to be covered include sensory perception, attention, memory, imagery, language, reasoning, problem solving and decision making.", "completed": false}, {"dept_code": "PSY", "id": "0423", "course_title": "COGNITIVE PSYCHOLOGY LAB", "description": "This course exposes students to the details of experimental methods in cognitive psychology, with a particular focus on experimental laboratory studies. Students will also improve their understanding of research report writing, computer skills, and quantitative data analysis skills. The course is organized according to the research process, which is implemented twice across two projects. For each project, students read background literature, develop research hypotheses, design experiments to test them, conduct the experiments, analyze the results, and write-up the experiments.", "completed": false}, {"dept_code": "PSY", "id": "0505", "course_title": "INTRODUCTION TO BIOPSYCHOLOGY", "description": "This is a survey course in which the biological bases of certain classes of behavior are explored. The behaviors studied are limb movement, sleep and wakefulness, feeding, sexual behavior and learning and memory. Each of these behaviors is considered from the point of view of which brain structures and which neurotransmitters are involved in the production of that behavior. Emphasis is also placed on experimental techniques used to obtain relevant data and on the type of inferences which can be made from these experiments.", "completed": false}, {"dept_code": "PSY", "id": "0510", "course_title": "SENSATION AND PERCEPTION", "description": "This course examines the nature of the mechanisms that transform sensory input into our perceptual experience of the world. Topics include structure and function of sensory system, perception of color, object, motion, etc. Both information-processing and ecological approaches to the study of perception are considered.", "completed": false}, {"dept_code": "PSY", "id": "1050", "course_title": "TOPICS IN PSYCHOLOGY", "description": "A topics course. Content will vary from term to term depending on instructor.", "completed": false}, {"dept_code": "PSY", "id": "1054", "course_title": "TOPICS IN COGNITIVE PSYCHOLOGY", "description": "Topics in cognitive psychology will vary from term to term, depending on instructor.", "completed": false}, {"dept_code": "PSY", "id": "1080", "course_title": "PSYCHOLOGY AND THE MEDIA", "description": "", "completed": false}, {"dept_code": "PSY", "id": "1110", "course_title": "PSYCHOLOGICAL ASPECTS OF HUMAN SEXUALITY", "description": "The course presents a social-psychological and psycho-biological orientation towards the study of human sexuality. Current research is emphasized. Topics such as sexual attitudes, hormones and behavior, changing sexual behavior, sex education, gender-role development, alternative forms of sexual expression, and violence and sex are covered.", "completed": false}, {"dept_code": "PSY", "id": "1112", "course_title": "PSYCHOLOGICAL ASPECTS OF HUMAN SEXUALITY: RESEARCH WRITING PRACTICUM", "description": "This course presents a social-psychological and psychobiological orientation towards the study of human sexuality. Current research is emphasized. Topics such as sexual attitudes, hormones and behavior, changing sexual behavior, sex education, gender-role development, alternative forms of sexual expression, and violence and sex are covered", "completed": false}, {"dept_code": "PSY", "id": "1113", "course_title": "PSYCHOLOGY OF WOMEN+", "description": "This course will critically examine the history of androcentric bias within the field of psychology. We will discuss research on the experiences of women and gender minorities (individuals who do not identify as their assigned sex at birth), using a feminist psychological and intersectional framework, in domains such as emotional expression, interpersonal relationships, labor, health, and victimization. I will give particular attention to how structural power in a patriarchal society influences these experiences. We will also discuss masculinity and cisgender men's experiences, but the focus of the course will be on cisgender women and gender minorities. This is a discussion-based course designed to help students develop oral communication skills particularly around the discussion of sensitive topics. Students will be required to complete a group oral presentation project.", "completed": false}, {"dept_code": "PSY", "id": "1137", "course_title": "CLOSE RELATIONSHIPS", "description": "A seminar-style course examining adult close relationships (with an emphasis on romantic relationships) from a social psychological perspective. Topics covered include interpersonal attraction, commitment and interdependence, relationship cognition, attachment and insecurity, communication, sexuality, conflict, relationship dissolution, and relationship maintenance. Class meetings will consist mainly of facilitated discussions and student-led presentations.", "completed": false}, {"dept_code": "PSY", "id": "1142", "course_title": "CONFLICT RESOLUTION", "description": "This course explores the psychology of conflict and its resolution, with a focus on conflict in our interpersonal relationships. Topics include the nature of conflict. barriers to conflict resolution, the benefits and costs of various responses to conflict (e.g., forgiveness, revenge, apologies), and factors that predict constructive vs. destructive responses to conflict. Classes include a lecture component but generally follow a seminar format consisting of facilitated discussions.", "completed": false}, {"dept_code": "PSY", "id": "1210", "course_title": "INTRODUCTION TO CLINICAL PSYCHOLOGY", "description": "This course is directed toward the student seriously interested in the major issues pertaining to clinical psychology. The course provides an overview of the major therapeutic approaches and incorporates other germane issues such as history of the field, assessment issues, interviewing approaches, community psychology, behavioral medicine, and clinical research and methodology. Present therapeutic approaches are placed in the context of an evolving discipline, anchored in an empirical-scientific approach to the subject matter.", "completed": false}, {"dept_code": "PSY", "id": "1213", "course_title": "PSYCHOPATHOLOGY ADVANCED LAB", "description": "This course will involve developing your own hypothesis regarding data previously collected from individuals with a mood disorder, followed by analysis of the data to test the hypothesis with support from the professor. The final paper will summarize the relevant scientific literature, theoretical rationale, the methods and analyses, results, and a discussion of the work similar to published articles.", "completed": false}, {"dept_code": "PSY", "id": "1215", "course_title": "HEALTH PSYCHOLOGY", "description": "This course provides an introduction to the major questions and methods which have guided the research in health psychology. This field examines the role of psychological and social factors in the development and progression of medical disease. Three main topics are covered: (1) conceptual underpinnings of health psychology, (2) psychosocial factors and specific diseases, and (3) evaluating behavioral medicine interventions.", "completed": false}, {"dept_code": "PSY", "id": "1230", "course_title": "PSYCHOLOGY OF DEATH AND DYING", "description": "The purpose of this course is to widen the student's understanding of human death in its biological, socio-cultural, and primarily psychological dimensions. We will examine the concept of death, psychological reactions to death and dying, historical and demographic aspects, selected issues such as end-of-life care, medical ethics, suicide, legal concerns, children's concepts of death, and the process of bereavement.", "completed": false}, {"dept_code": "PSY", "id": "1235", "course_title": "ALCOHOL USE AND ABUSE", "description": "This course covers a range of topics related to alcohol, including history, anthropology, sociology, epidemiology and literature. Topics include psychopharmacology, social-cognitive effects of drinking, etiology of alcoholism, as well as the prevention and treatment of alcoholism. This course also addresses abuse of other selected drugs such as nicotine, cocaine and heroin.", "completed": false}, {"dept_code": "PSY", "id": "1305", "course_title": "EXPERIMENTAL CHILD PSYCHOLOGY", "description": "This course introduces students to the scientific basis of theories and issues in developmental psychology. In lectures, discussion and structured experiments students learn about and apply basic methods of research in child development, including conceptualization, design, data collection, analysis and write-up. This course exposes students to development over infancy and childhood. The actual topics under study may vary by semester and include gender role development, cognitive development, and language development.", "completed": false}, {"dept_code": "PSY", "id": "1312", "course_title": "CHILD DEVELOPMENT & SOCIAL POLCY", "description": "In this course we will examine how a range of public policies shape the well-being of children and families. Poverty and inequality will be a central focus of the course. Policies addressed in the course include means-tested government programs, tax policy, early care and education policy, home visitation programs, housing policy, child abuse and neglect policies, k-12 education policy, and immigration policy. The goal of this course is to teach students to think critically about the implications of local, state, and federal policies for children and families.", "completed": false}, {"dept_code": "PSY", "id": "1315", "course_title": "DEVELOPMENTAL PSYCH: INFANCY", "description": "This course will explore how infants develop from conception to approximately age three. Topics that will be covered include motor development, social development, emotional development, perceptual development, and cognitive development. The course will also explore how knowledge about infant development is applicable across disciplines and careers.", "completed": false}, {"dept_code": "PSY", "id": "1321", "course_title": "AUTISM SPECTRUM DISORDER", "description": "This course will be devoted to a discussion of psychological theory and research in ASD. Topics to be covered include the early history of the study, diagnosis, and treatment of autism; current classification and diagnostic issues and techniques; epidemiological and etiological issues; major neurological and psychological theories of ASD; research on sensory atypicalities and stereotyped and repetitive motor behaviors, early identification, early social and communicative skills, affective, attentional, symbolic, and social factors; and intervention issues in ASD.", "completed": false}, {"dept_code": "PSY", "id": "1322", "course_title": "OBSERVATIONAL METHODS FOR DEVELOPMENTAL SCIENCE", "description": "Observing and quantifying the complexities of human behavior presents a number of significant challenges. Yet observational methods are one of the best ways (and sometimes the only way) to study the behavior of children who cannot perform complex tasks or provide verbal responses. This course focuses on the principles of quantitative, systematic observation of behavior and the rationale for selecting among the many options at all stages of observational measurement. Topics to be covered include: (a) principles for selecting elements in observational measurement systems (including selecting procedures or contexts, behavior sampling methods, designing coding systems), (b) training observers, (c) estimating agreement and reliability, and (d) validation of observational variables.", "completed": false}, {"dept_code": "PSY", "id": "1323", "course_title": "RISK, RESILIENCE, AND EARLY STRESS", "description": "Sadly, millions of children in the United States and throughout the world are exposed to chronic and uncontrollable adversities (e.g., extreme poverty; maltreatment). These adverse childhood experiences are related to compromised physical and mental functioning throughout development. However, individuals and communities exposed to these types of intense challenges often exhibit an amazing level of resiliency. Across the course, we will anchor ourselves in bio-psycho-social models of development, review these different sets of findings, and think about developmental interactions between the individual, family, community, and culture.", "completed": false}, {"dept_code": "PSY", "id": "1326", "course_title": "CULTURE, PARENTING AND LITERACY", "description": "The course focuses on positive development of minority children and their families and takes a strengths-based approach to studying them. Students examine different sources of evidence of whether and how sociocultural factors and parenting practices shape children's language and literacy development. Students discuss evidence-based interventions at home and school that aim to improve children's language and literacy skills, particularly in low-income and ethnically diverse communities. Class sessions involve a combination of lectures and group discussion based on empirical articles, book chapters, press articles, and videos. Students complete individual assignments.", "completed": false}, {"dept_code": "PSY", "id": "1472", "course_title": "NEUROPSYCHOLOGY OF BRAIN INJURY", "description": "This advanced research laboratory course will give students authentic and hands-on experience with the collection and analysis of behavioral and brain imaging data from individuals with brain damage due to stroke. Students will be assigned to a 3-person project team throughout the course. During class sessions, students will receive instruction and opportunities for hands-on practice of the component skills covered in a given week. Students will be expected to draw upon this instruction to complete a series of out-of-class requirements. The first quarter of the course will prepare students to administer a set of tasks assessing math and language abilities to individuals with localized brain damage due to stroke, and prepare project teams to assist with the collection of brain imaging data. In the second quarter of the course, each project teams will collect behavioral and brain imaging data from three research participants. In the third quarter of the course, students will learn how to code the behavioral and brain imaging data, and will use this knowledge to enter their results into a project database. In the final quarter of the course, students will learn methods for examining the relationship between the location of brain damage and its effects on cognitive abilities, and each team will use this knowledge in combination with available data to construct a final course presentation. The course is synergistic with a research project funded by the National Science Foundation on the brain basis of math and language abilities. The data collected by students in the course will eventually be incorporated into scientific publications and made publicly available to the scientific community. Students must have sufficient weekend availability to complete the required participant testing, provide evidence of a highly responsible work or research track-record, and have the motivation to commit 6-9 hours of time outside of the classroom each week.", "completed": false}, {"dept_code": "PSY", "id": "1514", "course_title": "EVOLUTIONARY PSYCHOLOGY", "description": "The relevance of Darwinian Theory to the study of anatomy and physiology has been obvious for many decades. Only recently however, have evolutionists begun to focus their explanatory tools on cognition, motivation, emotion, perception, and \"mind\". This course will examine the rationale, contributions, failures and future of evolutionary approaches to psychological phenomena. Initial lectures on the status of Evolutionary Theory will prepare the students for the discussion and evaluation of evolutionary psychology that will follow.", "completed": false}, {"dept_code": "PSY", "id": "1580", "course_title": "LANGUAGE AND THE MIND", "description": "This course introduces students to the study of language as a cognitive science, focusing on the mental processes and representations that we use to comprehend and produce language. Throughout the course we will emphasize fundamental debates in cognitive science and the ways these debates inï¬\u0082uence current psycholinguistic research into questions about sentence comprehension, production, and conversation. Because this course is multidisciplinary in nature, drawing primarily from the ï¬\u0081elds of linguistics and psychology, students will be introduced to ideas, theories, and methods used by researchers in both ï¬\u0081elds.", "completed": false}, {"dept_code": "PSY", "id": "1635", "course_title": "ORGANIZATIONAL PSYCHOLOGY", "description": "This course will provide broad exposure to the field of organizational psychology. We will cover concepts of leadership, motivation, group dynamics, personality, organizational development strategies, and other behavioral aspects involved in the effective management of an organization through readings, lecture, video, discussion, and case analyses. The emphasis is on building a sound grasp of leadership practice, and on developing the ability to apply such knowledge to actual business problems. The class format will include multiple hands-on assignments to assist the student in understanding how psychological theories can be applied in a work context.", "completed": false}, {"dept_code": "PSY", "id": "1900", "course_title": "SUPERVISED FIELD PLACEMENT", "description": "Psychology majors may receive up to 3 credits for field experience in supervised agencies in the community. The experiences vary from term to term.", "completed": false}, {"dept_code": "PSY", "id": "1903", "course_title": "DIRECTED INDIVIDUAL RESEARCH S/NC", "description": "This course involves student participation in individual experimental research supervised by a member of the faculty. This course is particularly valuable for students interested in graduate study in psychology.", "completed": false}, {"dept_code": "PSY", "id": "1950", "course_title": "PSYCHOLOGY SENIOR SEMINAR", "description": "This one-credit course is designed for psychology majors in their final year of study (either final or next-to-final term). Course content will include exploration of the field of psychology, self-assessment of learning experiences, identification of marketable skills for career and graduate school paths, and planning for transition to post-college life.", "completed": false}, {"dept_code": "PSY", "id": "1970", "course_title": "UNDERGRADUATE TEACHING ASSISTANT EXPERIENCE", "description": "This course involves student participation as an undergraduate teaching assistant (UTA) for a psychology course under the supervision of a faculty member.", "completed": false}, {"dept_code": "PSY", "id": "1973", "course_title": "HONORS DIRECTED RESEARCH", "description": "This is the first term of research in preparation for the honors major in psychology. Development of the research problem and approval of the theses prospectus.", "completed": false}, {"dept_code": "PSY", "id": "1975", "course_title": "HONORS THESIS/MAJORS", "description": "Undergraduate honors majors in psychology will register for this course when their thesis proposal has been approved and they are ready to conduct and write up the research.", "completed": false}], "links": [{"source": "0010", "target": "0036"}, {"source": "0010", "target": "0037"}, {"source": "0010", "target": "0105"}, {"source": "0010", "target": "0160"}, {"source": "0010", "target": "0184"}, {"source": "0010", "target": "0205"}, {"source": "0010", "target": "0310"}, {"source": "0010", "target": "0422"}, {"source": "0010", "target": "0423"}, {"source": "0010", "target": "0505"}, {"source": "0010", "target": "0510"}, {"source": "0010", "target": "1050"}, {"source": "0010", "target": "1054"}, {"source": "0010", "target": "1110"}, {"source": "0010", "target": "1113"}, {"source": "0010", "target": "1137"}, {"source": "0010", "target": "1142"}, {"source": "0010", "target": "1210"}, {"source": "0010", "target": "1215"}, {"source": "0010", "target": "1230"}, {"source": "0010", "target": "1235"}, {"source": "0010", "target": "1305"}, {"source": "0010", "target": "1315"}, {"source": "0010", "target": "1321"}, {"source": "0010", "target": "1322"}, {"source": "0010", "target": "1326"}, {"source": "0010", "target": "1514"}, {"source": "0010", "target": "1580"}, {"source": "0010", "target": "1635"}, {"source": "0036", "target": "0037"}, {"source": "0036", "target": "0423"}, {"source": "0105", "target": "1110"}, {"source": "0105", "target": "1113"}, {"source": "0105", "target": "1142"}, {"source": "0105", "target": "1215"}, {"source": "0105", "target": "1235"}, {"source": "0160", "target": "1110"}, {"source": "0205", "target": "1210"}, {"source": "0205", "target": "1213"}, {"source": "0205", "target": "1230"}, {"source": "0205", "target": "1235"}, {"source": "0310", "target": "1305"}, {"source": "0310", "target": "1315"}]}