{"nodes": [{"dept_code": "HUN", "id": "0102", "course_title": "HUNGARIAN 2", "description": "At the end of the second term of the first year of study the student should be able to produce all the significant sound patterns of the language, to recognize and use the major grammatical structures within a limited core vocabulary. The student should be able a) to engage in simple conversations with native speakers about a limited number of everyday situations and b) to read and write simple material related to the situations presented.", "completed": false}, {"dept_code": "HUN", "id": "0104", "course_title": "HUNGARIAN 4", "description": "At the end of the second term of the second year the student should be able to converse comfortably with a native speaker on a variety of non-specialized subjects. The student will be offered an opportunity to experience and more fully understand the culture of the people who use the language through readings of various types. More complex writing tasks will be expected at this level.", "completed": false}, {"dept_code": "HUN", "id": "1615", "course_title": "OUTSIDERS ON THE MARGINS: THE AFTERMATH OF SOCIALISM ON FILM", "description": "This course introduces students to the aftermath of Socialism, focusing on East Germany and Hungary through movies. We will look at issues that have been specific to societies in the Eastern Bloc taking these two areas as examples, and thus offer insight into the development of these societies after the fall of Socialism all the way up to the present. A deeper understanding of this development will encourage students to think about current historical-political events from a broader comparative perspective, promote their knowledge about the region of East Central Europe, and help discuss these events in an informed manner. Film as an art reflects the struggles and preoccupations of the time and society it emerges from. The selection of films in this course provides students with a representative sample of issues that take center stage in movies about the shift from Socialism to Capitalism and the aftermath of this transition. Course readings and class discussions illuminate the historical and cultural background to the cinematographic pieces watched and discussed in the course. The movies, readings and class discussions provide insight into how Socialism shaped society and what ramifications it has for the further course of history after its collapse in 1989. More than thirty years after the official end of Socialism, the repercussions of the \"cursed forty years\" are still palpable in people's lives, their collective memory, societal issues and the way they influence domestic and foreign politics. Under Socialism, inhabitants of the Eastern Bloc largely remained isolated from the Capitalist world and thus remained outsiders to it, quasi-exotic beings who were often regarded with curiosity, pity or suspicion by those in the West. These sentiments are still echoed despite the collapse of Socialism in 1989 and the EU's Eastern Enlargement in 2004, as inhabitants of both the former Eastern Bloc countries and the Western world are still coming to terms with East Central Europe's transformation into democratic societies with a free market economy and the free movement of labor. Historical and cultural differences that had existed before the creation of the Iron Curtain did not cease to be in the Post-Socialist era; on the contrary, they precipitate in discussions and policy-making in the EU and at a global level, where members of the Visegrád countries and their former Eastern Bloc neighbors are yet again often regarded as the nonconformist outsiders on the margins of Europe. In an era of globalization, would we not expect mutual understanding of each other to be less problematic than before the change in 1989? What is the connection between forty years of Socialism and our current day in a Post-Socialist era? We will investigate issues of economic disparity, gender, sexuality, race, ethnicity, ability difference and criminality through a selection of cinematographic works made after 1989 presenting the effect of the change on people's lives from various perspectives. Some of these include the perspective of women, homosexuals, Jews, migrants, people with disabilities, and criminals (if they indeed are criminals), all in addition to the \"average\" person under Communist rule living on what was perceived by many \"the margins\" of Europe. The course thus looks not only at the Socialist and post-Socialist citizen as an outsider, but also groups that find themselves in an even more marginalized position - we might as well call them double outsiders because of their position in a society already disadvantaged to more developed Capitalist ones.", "completed": false}], "links": []}