{"nodes": [{"dept_code": "EDUC", "id": "1015", "course_title": "FROM CLASSROOM TO COMMUNITY: INTER-AND INTRA-PERSONAL SKILLS DEVELOPMENT", "description": "This course provides an introduction to intervention and prevention efforts designed to improve educational, mental health, and socio-behavioral outcomes for first-year students with various backgrounds and lived experiences. The transition to college presents students with a unique set of challenges. With rapid assimilation into an institution of higher learning, an athletic department, and a varsity athletic team, Pitt student-athlete's particular transitional needs differ from nearly all other student populations. This course is therefore designed to assist them with skills acquisition and practice necessary for everyday wellness and resilience in the classroom and the community. The focus of the class will be on skills for thriving and improving their lives, and the lives of others, rather than just surviving in life. By the end of the course, you should be able to: (1) Directly practice a variety of wellness and resilience skills, habits, and routines in different areas of your life to minimize stress and optimize well-being, (2) Describe why intentionally 'practicing' wellness and resilience skills is critical to developing the fluency to use and reap the benefits from them, (3) Develop a wellness and resilience toolbox of skills, strategies, and resources that serves as the vehicle on your road map for your future as a student and in the workplace, (4) Plan for how to use these skills to be your own and others' advocates in your future careers and communities.", "completed": false, "prereq_count": 0}, {"dept_code": "EDUC", "id": "1067", "course_title": "FREEDOM SEMINAR", "description": "The Freedom Microseminar courses attend to a range of freedom projects, theories, pedagogies, and praxes. Each course is a focused engagement with a specific set of questions, ideas, and topics relevant for understanding education within social, cultural, and political movements, systems, and structures. Students study both the what and how of freedom through insurgent knowledge traditions.", "completed": false, "prereq_count": 0}], "links": []}