{"nodes": [{"dept_code": "HAA", "id": "0010", "course_title": "INTRODUCTION TO WORLD ART", "description": "This course explores the question `what is art through a close analysis of select art works from around the globe, introducing students to the types of questions art historians bring to the images, objects and sites human beings have taken particular care to craft and conceptualize. What role has art played in a diverse range of human cultures across time?", "completed": false}, {"dept_code": "HAA", "id": "0020", "course_title": "INTRODUCTION TO ASIAN ART", "description": "This base level survey is meant, on the one hand, to introduce the student to the arts of Japan, China, and India and on the other, to teach some fundamental techniques of visual analysis. The course considers the development of Chinese bronzes, Chinese Buddhist sculpture, Indian Hindu and Buddhist sculptures, and Japanese temples, sculptures, and paintings.", "completed": false}, {"dept_code": "HAA", "id": "0030", "course_title": "INTRODUCTION TO MODERN ART", "description": "The course will present a chronological survey of Western European, Russian, and American art from the mid-nineteenth century to the present (impressionism to post-modernism). In addition to charting the dramatic stylistic and conceptual changes in art during this time period, the course will consider the historical circumstances which caused a disintegration in accepted notions of what constituted a significant work of art.", "completed": false}, {"dept_code": "HAA", "id": "0042", "course_title": "WORLD CITIES", "description": "Cities have existed all over the world for millennia, and their inhabitants have used these urban conglomerations to connect themselves, their ideas, and their goods to a much wider audience - often well beyond their geographic and political boundaries. Cities have also been sites of dramatic demographic changes throughout human history, leading to productive contact as well as structural inequalities between diverse peoples. In this course, students will explore how cities all over the world and through time have grappled with the potentials and problems of a growing, diversifying, and increasingly interconnected world. We will pay particular attention to the cities' heterogeneous inhabitants, their built and natural environments, their interconnectivity, and their different and changing identities as \"world cities.\" Designed around guest lectures by faculty from the Department of History of Art and Architecture, this course will introduce students to a wide array of world cities. Weekly lectures will explore examples of cities across time and space, including Timbuktu, Mexico City, Beijing, Chicago, Istanbul, Cairo, Paris, and other sites; and through a variety of visual media, including architecture, public sculpture, photography, and film. Class sessions will be specifically devoted to comparing the ideas that formed these cities and how their identities and built environments have changed over time.", "completed": false}, {"dept_code": "HAA", "id": "0090", "course_title": "INTRODUCTION TO CONTEMPORARY ART", "description": "This course explores the latest developments in contemporary art in the context of changes in world visual cultures since the 1960s. The first weeks will concentrate on the transformations of artistic practice that occurred initially in pop art, and on the minimal-conceptual shift in Western art. This will be followed by a survey of the diversification of artistic practice in the 1980s and 1990s, including the emergence of new internationalisms reflecting postcoloniality, global contemporary art and digital media.", "completed": false}, {"dept_code": "HAA", "id": "0101", "course_title": "FOUNDATIONS OF ART HISTORY", "description": "Foundations of Art History is a core course for the HAA major and offers an introduction to the history of the art historical discipline and its research and interpretive methods.", "completed": false}, {"dept_code": "HAA", "id": "0102", "course_title": "PROSEMINAR FOR UNDERGRADUATE MAJORS", "description": "This is professional development workshop that assists students with resume development, networking, and establishing and meeting career goals.", "completed": false}, {"dept_code": "HAA", "id": "0105", "course_title": "ART AND EMPIRE", "description": "", "completed": false}, {"dept_code": "HAA", "id": "0106", "course_title": "MUSEUM STUDIES INTERNSHIP PREP WORKSHOP", "description": "This workshop is required for Museum Studies majors seeking to pursue the internship option. This course must be taken before enrolling in the internship credits HAA 1905.", "completed": false}, {"dept_code": "HAA", "id": "0425", "course_title": "DIGITAL HUMANITY", "description": "", "completed": false}, {"dept_code": "HAA", "id": "0470", "course_title": "PHOTOGRAPHY AND ART", "description": "This introductory course is intended to provide a thorough familiarity with the history of photography from its development in the 19th century to the present day, and to link that history to major trends in the history of modern art, such as realism, impressionism, cubism, surrealism, abstract art, etc.", "completed": false}, {"dept_code": "HAA", "id": "0730", "course_title": "ART AND ARCHITECTURE OF THE MUSLIM WORLD", "description": "This course examines the art and architecture of the Muslim world as it developed through centuries of adoption, adaptation, and innovation which emerged as Islam spread throughout Eurasia, and Muslim communities came into contact with other Muslim and non-Muslim societies. Focusing on a number of prominent sites, buildings, and art objects, this course introduces students to the plurality of traditions and artistic practices labeled as Islamic Art and Architecture. Furthermore, students will learn about various sources of influence that came from the center and peripheries of the Muslim world. Exploring these concepts will take the class on a journey through time and space: starting in the 7th-century from the birthplace of Islam in the Arabian Desert, we will move through a vast territory that expands from southern Spain to China, with a final stop in 21st-century Dubai. All along the way, buildings and art objects will serve as snapshots that open a window into the social, cultural, economic, and political life of these Muslim societies.", "completed": false}, {"dept_code": "HAA", "id": "1010", "course_title": "APPROACHES TO ART HISTORY", "description": "HAA 1010 is the capstone research seminar required of all HAA majors and is an official w-course. Students in this class will conduct extensive readings on a special topic devised by the course instructor. Each student in the class will be required to produce a substantive research paper under the guidance of the instructor. Students will work to master the skills that are fundamental to the discipline and broader arts related professions: critical thinking, research, and written and oral communication.", "completed": false}, {"dept_code": "HAA", "id": "1019", "course_title": "CURATORIAL DEVELOPMENT", "description": "This museum studies course draws on the University Art Gallery collection to develop an exhibition that will be realized in the Fall by students in the Exhibition Presentation Seminar. Within a defined thematic or collection-area focus, students will survey the holdings of the gallery to develop an exhibition concept and conduct in-depth research into a single work of art to contribute to a catalogue for the exhibition. Students will explore the key texts related to the subject of the exhibition and identify potential loans to complement its storyline.", "completed": false}, {"dept_code": "HAA", "id": "1025", "course_title": "HISTORY AND ETHICS OF COLLECTING", "description": "This course will critically examine the history of public and private collecting practices, the cultural and scholarly rationales behind collecting, and the legal and ethical challenges that collections face. Case studies will include the british museum and the louvre, Pittsburgh's private collectors frick and mellon, the fate of art in Europe during World War II, the antiquities trade, and ethnographic collections. Using these and other examples, we will evaluate the arguments for and against universal art museums, the repatriation of works to source nations or original owners, and the protection of cultural heritage during times of conflict.", "completed": false}, {"dept_code": "HAA", "id": "1050", "course_title": "WORLD ART:CONTACT AND CONFLICT", "description": "This course, an advanced undergraduate seminar, is a counterpart to the introductory core course Introduction to World Art and invites students to think more critically about 'World Art' as a disciplinary enterprise as it emerged in the last several decades with the global turn, post-colonialism, and a call for art history to be more inclusive. Students will be introduced to key terms that are employed by this discourse (contact zones, planetarity, world-picturing, cosmopolitanism). The course works through these ideas by focusing its attention on specific sites and art objects, case studies that explicitly circulate within or take as their subject the meeting point of different cultures and groups.", "completed": false}, {"dept_code": "HAA", "id": "1450", "course_title": "ART AND POLITICS IN THE WEIMAR REPUBLIC", "description": "The course will examine art and architecture in Germany from the end of World War I to the rise of the national socialist dictatorship in 1933. Emphasis will be on a chronological study of the ways in which art developed in Germany under democratic social concepts and a new internationalist outlook in the early years of the republic, and the ways art became embedded in the political structures.", "completed": false}, {"dept_code": "HAA", "id": "1520", "course_title": "BLACK BUILT AMERICA: ARCHITECTURES OF BLACK RESISTANCE IN THE UNITED STATES", "description": "This course offers a critical history of the Black labor, creativity, craftsmanship, engineering, and activism that built the United States of America. It is undeniable that Black Americans and African Americans have been brutally marginalized by the instruments of systemic racism including segregation, redlining, eviction, and more recently gentrification. In this class, however, that very real and continuing history of oppression is studied as the fuel for the creative agency of Black individuals and communities. Appropriating, intervening, and shaping the built environment became one of the many forms of Black resistance to racism and systemic injustices. In doing so, Black hands and Black minds shaped the very fabric of America's landscape. Our class begins and ends in Washington DC, posing important questions about the hidden and overt symbols of Black heritage in the nation's capital.", "completed": false}, {"dept_code": "HAA", "id": "1905", "course_title": "MUSEUMS STUDIES INTERNSHIP", "description": "Museum studies minors are required to complete a 3-credit academic internship under the course number HAA 1905. This is both an academic course and an internship placement. Students receive substantive mentoring from a site supervisor at a local museum, collection or historic site, and engage in projects with learning outcomes, whether in curatorial, educational, communications or development departments. Students also participate in monthly cohort meetings with the other interns enrolled in the course, under the guidance of an HAA faculty member, and are required to produce a final product. Note: academic internships through HAA 1905 are also available to HAA majors as an optional elective. The student must apply for the internship through the HAA department.", "completed": false}, {"dept_code": "HAA", "id": "1950", "course_title": "SENIOR THESIS", "description": "In this course a senior major in the history of art will research and write a research paper and present it as if for publication. The area and topic will be decided upon in consultation with a specific faculty member.", "completed": false}, {"dept_code": "HAA", "id": "1951", "course_title": "HONORS RESEARCH SEMINAR", "description": "This seminar is intended for undergraduate students pursuing an honors thesis project in the department of the History of Art and Architecture. Students will devise and carry out research for their thesis paper under the direct supervision of a qualified faculty member in the department, depending on the student's specialized interest. That faculty member will guide the student through the production of the paper in accordance with stipulated deadlines for outlines and drafts leading up to the final work.", "completed": false}], "links": [{"source": "0106", "target": "1905"}]}