{"nodes": [{"dept_code": "JS", "id": "0011", "course_title": "ELEMENTARY HEBREW 1", "description": "This course introduces students to the fundamentals of the Hebrew language. We study basic vocabulary, grammar and sentence structure, and learn to read and write Hebrew. Emphasis is learning to speak the language.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0012", "course_title": "ELEMENTARY HEBREW 2", "description": "Continuation of the introductory work begun in Hebrew 1. Students further develop their reading, writing and speaking skills with the greatest emphasis being placed on oral communication.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "0026", "course_title": "INTERMEDIATE HEBREW 4", "description": "Students continue to develop their Hebrew reading and speaking skills. Sophisticated Hebrew texts are introduced.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1065", "course_title": "BIBLICAL HEBREW", "description": "This course introduces students to the grammar, syntax and vocabulary of Biblical Hebrew.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1100", "course_title": "ISRAEL IN THE BIBLICAL AGE", "description": "This course explores the history and development of the people of Israel in ancient times. What do we know about the Israelites and how do we know it? Using biblical texts and archaeological remains, students will learn about everyday life in ancient Israel, the role of class and gender, life-cycle events, religious festivals, political institutions, systems of belief, and famous personages in history and lore. The trajectory of the course will begin with the Near Eastern origins of the people, continue through the rise of the Israelite and Judahite monarchies, and end with the Second Temple commonwealth of Judea in the Persian and Hellenistic periods.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1102", "course_title": "THE HISTORY OF GOD", "description": "God has a history. In the earliest days of that history, God was worshiped as one of a plethora of deities controlling various spheres of cosmic activity or the human world. Students in this course will learn about this ancient pantheon - how gods functioned in society and how their presence was experienced by those devoted to them. They will then trace the evolution of the God of Israel from a mountaintop deity of the southern Levant in the late second millennium BCE to a supreme deity worshiped by a small group of absolute monotheists based in Jerusalem in the mid-first millennium BCE. Students will become more sophisticated readers of biblical texts in the process. The sources of the Hebrew Bible reflect not a homogeneous monotheism, but rather a diverse set of belief systems tending toward henotheism or even polytheism. By appropriating and reinterpreting the religious myths of their neighbors, the Israelites arrived at a character of the divine that has proven problematic to many contemporary theologians, particularly on issues of LGBT rights, women's rights, and the environment.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1108", "course_title": "COMPARATIVE EUROPEAN HISTORY", "description": "This non-honors course compares two European states in the Twentieth Century. The focus is on social history.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1253", "course_title": "INTRODUCTION TO HOLOCAUST LITERATURE", "description": "This course surveys the central texts of the literature of the holocaust, while introducing students to the main issues and preoccupations of holocaust testimony in literature and film.", "completed": false, "prereq_count": 0}, {"dept_code": "JS", "id": "1715", "course_title": "FEEDING THE SOUL: FOOD, GENDER AND RELIGION", "description": "Food is sustenance and absolutely essential to life. But food is never simply about nutrition. Because it is fundamental to the human experience, food is also a medium for the expression of culture and social identity. Moreover, food relays complex social messages about gender, sexuality, and family. Consequently, food is also a means for expressing the social and symbolic use of power and control in which social inequalities are expressed in culinary forms. This course will examine food from the vantage point of gendered and religious systems of production, distribution, and consumption as we consider: How does your food come to your table (or not) and what are the political implications of personal tastes?", "completed": false, "prereq_count": 0}], "links": []}