{"nodes": [{"dept_code": "HIST", "id": "0010", "course_title": "PROFESSIONAL DEVELOPMENT SEMINAR", "description": "You are at a family function and one of your relatives over hears what your major is asks you \"do you know what you call a BA in history?\" Then before you can answer or walk away, he/she responds with \"waiter!\" While this is the accepted wisdom of what happens to a history, is this the reality of life after college? The answer to that is an emphatic \"no!\" Therefore, in this class you will find out why this is false. Then you will prepare for the real world by practicing and implementing the skills needed to navigate your way through the process of finding a job or going on to graduate school.", "completed": false}, {"dept_code": "HIST", "id": "0125", "course_title": "RELIGIONS OF THE WEST", "description": "This course is a historical introduction to the religious traditions that developed in ancient Near East and the Mediterranean. Our major emphasis is on the history of the religious traditions that emerged in late antiquity in this area and which continue to be major world religions: Judaism, Christianity, and Islam. We will also touch on Zoroastrianism. We focus on key concepts, historical developments, and contemporary issues. Throughout the course, we also examine interactions among these religious traditions. In the last part of the course we examine the issue of globalization and the spread of these religions around the world as well as the presence of \"non-Western\" religion in the \"West.\" The course also serves as an introduction to the academic study of religion and provides a foundation for further coursework in Judaism, Christianity, and Islam. No prior knowledge of any of the religions studied is expected or assumed.", "completed": false}, {"dept_code": "HIST", "id": "0140", "course_title": "THE HISTORY OF THE BOOK", "description": "This course examines European book history in global context, from clay tablets through the age of print. Focusing primarily on the medieval and early modern periods, it considers the history of the book from several perspectives: as a story of technologies, both manual (papermaking, printing) and intellectual (literacy, memory), as a story of artistic and cultural forms, as a story of reading, and as a story of global networks. We will consider issues including forgery; censorship; the role of political, religious, and economic forces in the production of books; the development of trust in the written word; the history of libraries; and the formation of reading communities.", "completed": false}, {"dept_code": "HIST", "id": "0150", "course_title": "HISTORY OF MODERN IRELAND", "description": "This class will examine how Britain came to Ireland and why in the context of that period (16th and 17th centuries). It will also examine the very complex relationships between the Catholic church and the British crown in the 17th century, as these relationships played a great role in the Cromwellian era. This will lead us to the heart of the class where we will trace the very complex relationship between modern Irish republicanism and Cromwell.", "completed": false}, {"dept_code": "HIST", "id": "0187", "course_title": "WORLD WAR II-EUROPE", "description": "The causes of WW II are surveyed, including World War I, the Russian Revolution, the Great Depression, and the rise of fascist regimes. The determinants of German expansionism will be discussed and related to the outbreak of war in 1939. The military struggle receives attention, but such topics as economic mobilization, propaganda, occupation policies, resistance movements and the Holocaust are also discussed. The course concludes with an analysis of war time diplomacy, the Postwar settlement, and the onset of the Cold War.", "completed": false}, {"dept_code": "HIST", "id": "0190", "course_title": "THE DICTATORS", "description": "This course offers a venue to explore a large variety of political regimes frequently bounded together in the professional literature under the conceptual umbrella of \"dictatorship.\" After gaining an introductory overview and acquiring a conceptual toolkit we will systematically scrutinize the trajectories, structures, and policies of some twenty political regimes throughout the world aiming to identify their commonalities and singularities. These findings will allow us to search for shared patters, identify types of political regimes, establish comparisons and connections between them, and understand every regime within a wider global context.", "completed": false}, {"dept_code": "HIST", "id": "0302", "course_title": "SOVIET RUSSIA", "description": "This course examines the history of the USSR from 1917 to the present. Particular attention is paid to the revolutionary transformation of society, the construction of the Soviet state and Soviet society, and to the ways in which state and society relate.", "completed": false}, {"dept_code": "HIST", "id": "0423", "course_title": "MODERN CHINESE HISTORY IN MANDARIN", "description": "This course is offered in conjunction with HIST 1423, Modern China. It is a supplementary, one-credit Chinese-language recitation, where issues raised each week in HIST 1423 will be discussed in greater detail in a Chinese-immersion format. This recitation offers students the opportunity to utilize, reinforce, and deepen the skills they have acquired in language courses. Activities will include discussion of main issues in the class, primary documents, films and video, and preparation for course assignments. It will incorporate new methods in the study of history.", "completed": false}, {"dept_code": "HIST", "id": "0475", "course_title": "RELIGION AND CULTURE IN EAST ASIA", "description": "Words have consequences. How a society defines \"religion\" and \"culture\" have much to say about how they balance individual freedom and collective responsibility. This course focuses on how religion has been and is practiced in East Asia in modern and contemporary times. We begin with an overview of the major religions in the region (e.g., Confucianism, Daoism, Buddhism, Shinto, folk traditions), and examine various themes to help us learn how religion influences the lives of individuals and the wider societies in which they live. Themes dealt with include the relationship between religion and politics and law; nationalism, terrorism, and secularization; gender, sexuality, and the family; healing, the environment, and ethical behavior; and the life cycle and ritual calendar year. By looking at how these issues unfold in modern China and Japan and at their global significance enable us to better understand how religion shapes our world.", "completed": false}, {"dept_code": "HIST", "id": "0500", "course_title": "COLONIAL LATIN AMERICA", "description": "This course explores the material history of Latin America during the period of Spanish and Portuguese Colonial Rule, from 1500 to 1825. In it, we will examine the interplay between material conditions (climate, natural resources, flora and fauna, and geographic features) and material culture (built space, technology, commodities, agriculture, as well as cultural products), asking how they shaped human action. Weekly case studies-ranging from pre-contact indigenous agriculture, through the role of technology in the success of Spanish conquistadors, to the impact horses on the Spanish frontier-prompt students to engage with the lived experience of a broad range of people living in pre-independence Latin America.", "completed": false}, {"dept_code": "HIST", "id": "0501", "course_title": "MODERN LATIN AMERICA", "description": "History of the Latin American republics from independence, in 1825, to the present.", "completed": false}, {"dept_code": "HIST", "id": "0502", "course_title": "AFRO-LATIN AMERICA", "description": "A survey of black history in the countries of Latin America, from the period of European conquest (c. 1500) to the present.", "completed": false}, {"dept_code": "HIST", "id": "0600", "course_title": "UNITED STATES TO 1877", "description": "This is an introductory, lower division, course that develops the history of United States from the 1400s through the 1880s.", "completed": false}, {"dept_code": "HIST", "id": "0700", "course_title": "WORLD HISTORY", "description": "This course is an introductory survey of world history, by which is meant an overview of major processes and interactions in the development of human society since the development of agriculture some 10,000 years ago. It is a selective overview, emphasizing large-scale patterns and connections in political, social, cultural, technological, and environmental history, yet it also provides balance among regions of the world. It encourages students to apply historical techniques to issues of their own interest.", "completed": false}, {"dept_code": "HIST", "id": "0707", "course_title": "SEX AND GENDER: A GLOBAL HISTORY OF THE MODERN WORLD", "description": "How do ideas of sex and sexuality change over time? Can we understand global history through the lens of sex? This course will survey topics in global history and the history of sex and sexuality from the eighteenth to the twentieth century. We will explore continuities and changes in the definitions of sex and sexualities, the science and politics of sex and reproduction, the relationships between sex, sexuality, and imperialism, the sexual construction of social and cultural differences in different nations, changing portrayals of sex and sexuality by the state and by the media, social and legal activism with regard to issues of sex and sexuality, and the value of using sex and sexuality as a historical framework for issues in social, cultural, and political history.", "completed": false}, {"dept_code": "HIST", "id": "0755", "course_title": "RELIGION IN ASIA", "description": "This course serves as an introduction to the major religious traditions of South and East Asia. During the course of the semester, we encounter Hinduism and Jainism; the native Confucian, Daoist (Taoist), and popular traditions of China; and the Shinto, folk and new religions of Japan. Buddhism, which originated in India but later spread to East Asia, is examined in its relation to the history of both Chinese and Japanese religions. We approach these traditions through lectures and discussion based on Chinese classical and popular literature, secondary scholarship, and films, which inform us about cultural and historical context, beliefs, practices, and personal experience. In the process we expect to learn something about the ways in which non-Western religious traditions see themselves and their world on their own terms, and to see how/if they can complement our own worldviews.", "completed": false}, {"dept_code": "HIST", "id": "0756", "course_title": "INTRODUCTION TO ISLAMIC CIVILIZATION", "description": "This course aims to introduce students to Islamic and Middle Eastern History from the time of the Prophet (ca. 600 C.E.) to the Iranian Revolution in 1979. We will proceed chronologically, focusing mainly on political events. However, a special emphasis will be given to the formation of the Islamic tradition, its evolution across different regions and cultures in time, and its interaction with other traditions. In the modern era, we will particularly explore the Islamic societies' political, cultural, and military encounter with the rising power of the West in the Middle East. In addition to the several historical processes and developments such as modernization, nation-building, Islamic fundamentalism and globalization, which have shaped the history of the Middle East in the last two centuries, our class discussions will also touch on the main theoretical perspectives that have stamped the studies of Islam and the Middle East. Here, concepts such as orientalism, defensive development, and modernity will constitute our main focus.", "completed": false}, {"dept_code": "HIST", "id": "0795", "course_title": "HISTORY OF AFRICA BEFORE 1800", "description": "Surveys history of Africa from earliest times to eve of European civilization. Looks at Africa from the inside out and aims at promoting an appreciation of Africa's contribution to world civilization and an understanding of the historical processes that have shaped modern Africa. Major themes and topics include ancient kingdoms, Islam the slave trade and the European contact.", "completed": false}, {"dept_code": "HIST", "id": "1000", "course_title": "CAPSTONE SEMINAR", "description": "This course seeks to acquaint history majors with proper techniques of historical research and writing.", "completed": false}, {"dept_code": "HIST", "id": "1001", "course_title": "INTRODUCTORY SEMINAR", "description": "This course introduces its students to the ways historians work. Either by focusing on various interpretations of a common event or series of events, or by looking at historiographical literature in general, the course demonstrates the diversity of historical interpretation.", "completed": false}, {"dept_code": "HIST", "id": "1019", "course_title": "CITIES IN HISTORICAL PERSPECTIVE", "description": "This course examines the early history of cities, from urban settlements in the ancient world up to the Early Modern period. It will include investigations of imperial capitals, mercantile hubs, and religious centers, including Damascus, Rome, Aksum, Constantinople, Baghdad, Samarkand, Novgorod, Córdoba, Paris, and Venice. We will also consider the elements of urban settlements, the networks that linked them, patterns of urban life, and civic identity.", "completed": false}, {"dept_code": "HIST", "id": "1024", "course_title": "HISTORY POP-UP COURSE", "description": "This one credit course focuses on the rich history, culture and civilization of Austria. Throughout the course of her history, Austria has ruled over an empire in Europe that lasted for centuries, leaving lasting influences in the realms of science, fashion, music, theater, food, healthcare, medicine and much more, not only in Europe, but throughout the world. This course explores the culture of this great civilization to help understand her rise to power, downfall and ability to remain relevant today as a member of the European Union. We will do this using an interdisciplinary approach which will include reading and analysis of key historical texts within the context of major events that shaped her growth. Students will develop an understanding of the Austrian world view through readings of literary and scientific texts written between the Age of Enlightenment and World War I. These texts will answer questions such as: A. How did Austria view herself in relation to the other nations which she ruled and what was her response to nations that might have rejected her influence. B. How did Austrians view the body as it relates to medicine and how did this view in turn help shape the modern healthcare system, which may include non conventional therapeutic approaches. We will also engage with hands on activities that include cooking Austrian cuisine, working with marionettes (we will discuss the Marionette Theater in Salzburg, Mozart's and Haydn's contribution to the marionette theater) and looking at traditional Austrian fashion. This course will be great for students thinking about participating in the Comparative Healthcare in Graz study abroad program.", "completed": false}, {"dept_code": "HIST", "id": "1030", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}, {"dept_code": "HIST", "id": "1047", "course_title": "COMMUNISM: FROM MARXIST THOUGHT TO \"REALLY EXISTING SOCIALISM\"", "description": "This course introduces the history of communism from Marxist thought in the 1840s to the collapse of the Soviet-style socialist regimes in eastern Europe in the 1990s. It will cover the major turning points in the history of communism: the revolutions of 1848; the split of Europe's socialist movement in a revolutionary and an evolutionary wing; the Russian Revolution of 1917 and the establishment of the Soviet Union; the shift from Leninism to Stalinism in the 1920s; the implementation of Soviet-style regimes throughout eastern Europe after the Second World War; their economic accomplishments in the 1950s and 1960s; their eventual failure to meet the economic expectations of their citizens, which fueled the protest movements in some socialist countries, before the political developments in communist Poland in the 1980s caused a chain reaction that led to a collapse of the communist regimes throughout eastern Europe between 1989 and 1991; and significant economic changes in China.", "completed": false}, {"dept_code": "HIST", "id": "1049", "course_title": "AFTER HITLER: RETRIBUTION, RECONSTRUCTION, AND RECONCILIATION: POSTWAR EUROPE", "description": "Europe experienced unprecedented levels of destruction and violence during the Second World War. The experience of ethnic cleansing and mass murder, with the Holocaust standing out as the most disturbing case of mass murder in modern times, were so traumatic that many people lost their faith in modern civilization as such. Against this backdrop, would have predicted that Europe would not only recover but also reach an unprecedented level of political stability, prosperity, and civility after the Second World War. This course examines the striking transformation of postwar Europe by exploring the strategies European societies - with significant involvement of the United States - pursued to overcome the traumas of war and rebuild a shattered continent. Course topics include the legal persecution of war crimes, the building of societies and political orders that are based on the respect of human rights and the rule of law, the reconstruction of Europe's bombed cities, and the attempts to overcome nationalism and xeno-phobia through various forms of European integration.", "completed": false}, {"dept_code": "HIST", "id": "1062", "course_title": "HUMAN RIGHTS IN WORLD HISTORY", "description": "Human rights in world history, will provide a historical overview of the human rights movement, focusing on the 18th-20th centuries. The course will lay out the parameters of the struggle to define and implement human rights in the Western and non-Western world, and engage with the different resulting viewpoints. The course will explore controversial aspects of the implementation of human rights internationally, including calls for the respect of cultural differences. Finally, the course will examine case studies of the racial/ethnic/caste dimension of the human rights struggle, looking at the US, Brazil, Israel, and India as countries with quite different cultural traditions, political makeups, and demographic compositions. The course will enroll 40 students, and will meet once per week in the evening.", "completed": false}, {"dept_code": "HIST", "id": "1076", "course_title": "COMPARATIVE SLAVERY", "description": "This course will compare slave societies and slave systems in the old world (Europe and Africa) with the new world (U.S. And Latin America).", "completed": false}, {"dept_code": "HIST", "id": "1080", "course_title": "EMPIRES AND THE ENVIRONMENT IN WORLD HISTORY", "description": "This upper level seminar examines how global commodity trades in natural resources have shaped the world. We will consider how the pursuit of natural wealth has led people to alter the world around them, and what the consequences of those alterations have been for natural and human communities. We will consider places and practices as wide-ranging as silver production in colonial south America, sugar in the 18th Century Caribbean, opium in 19th Century China, and petroleum in the modern-day Middle East. We will examine global themes such as imperialism, colonialism, capitalism, and the spread of epidemic diseases.", "completed": false}, {"dept_code": "HIST", "id": "1082", "course_title": "WOMEN, GENDER AND SPORT", "description": "Serena Williams, Megan Rapinoe, Brittney Griner, Gabrielle Reese, and Aly Raisman each hold a unique place in American culture and elicit a different set of responses. This course seeks to unpack the history of female athleticism and understand the forces that surround access and participation. Societal changes have expanded female opportunities, but have those been experienced by all sectors? What barriers did and do women face? This course will analyze the relationship between gender and sport from multiple perspectives, focusing on economic, cultural, political, social, legal and educational influences. We will consider the evolving roles for women in sport, noting that beliefs regarding female bodies, gender equity, gender identity, health, and women's role in society have shaped the narrative. Topics will include the history of female athletes, structural constraints, race and ethnicity, class, sexuality and homophobia, the role of the media, and finally, the impact of Title IX.", "completed": false}, {"dept_code": "HIST", "id": "1084", "course_title": "FOOD AND HISTORY", "description": "The subject of food production, preparation, and consumption is examined from a variety of disciplinary perspectives in this reading seminar. The course contrasts pre-industrial and modern diets and food systems.", "completed": false}, {"dept_code": "HIST", "id": "1090", "course_title": "HISTORY OF MEDICINE AND HEALTH CARE", "description": "Provides an overview of the social history of medicine from prehistory to the present. Focuses on the emergence of medical institutions, education, theories, practices and the Orthodox and irregular medical sects. Describes the growth of the separate health disciplines of nursing, pharmacy and public health. Examines the impact of socioeconomic factors, religions and war on the evolution of medical science. Discusses the changing roles of government in the development of the American health care system.", "completed": false}, {"dept_code": "HIST", "id": "1095", "course_title": "SPORT AND GLOBAL CAPITALISM", "description": "The history of sport and global capitalism is designed for students seeking to make their way as professionals and/or for those interested in global sport as a social and political force both in the US and around the world. Focusing on the evolution of sport as a global industry and the creation of an imposing scholastic, community, and non-profit infrastructure, it equips students to understand and navigate those arenas. If, after graduation, students venture into the sports industry, scholastic sport, or sport for development, they should do so with their eyes wide open.", "completed": false}, {"dept_code": "HIST", "id": "1108", "course_title": "COMPARATIVE EUROPEAN HISTORY", "description": "This non-honors course compares several European states throughout modern history. The focus is on social and migration history.", "completed": false}, {"dept_code": "HIST", "id": "1111", "course_title": "MEDIEVAL HISTORY 2", "description": "This course examines Europe and the Mediterranean world in the later Middle Ages, ca. 1000-1500 CE. Taking into account social, political, economic, religious, artistic, and intellectual developments, we will assess the varieties, continuities, and radical transformations of medieval culture, with a particular emphasis on evaluation of source materials.", "completed": false}, {"dept_code": "HIST", "id": "1124", "course_title": "NORTHERN IRELAND: THE TROUBLES - 1969-1994", "description": "Ex-republicans and loyalists: \"you've been in Belfast for 2 weeks. Do you understand the conflict any better now?\" Pitt students: \"no. We are more confused now than when we arrived.\" Ex-prisoners: \"good! You've learned something.\" Contradictory? Confusing? Confusing? All of the above? If you say, \"\"all of the above\" then you will find this class \"intriguing.\" You will move beyond the \"inherited histories\" concerning the conflict in Ireland and investigate the roots of the Irish conflict. By the end, you will come to realize that history is rarely black and white and that there are many \"truths\" and shades of grey.", "completed": false}, {"dept_code": "HIST", "id": "1423", "course_title": "MODERN CHINA", "description": "China's abandonment of its traditional political culture and its emergence in the Twentieth Century as a modern nation-state ruled by the Chinese communist party is the primary theme of this course, which will include lectures, readings, films, and classroom discussion.", "completed": false}, {"dept_code": "HIST", "id": "1447", "course_title": "ECONOMIC HISTORY OF JAPAN", "description": "This course investigates the industrialization of Japan from 1868 to the present. The course first looks at the early modern precursors to industrialization, 1600-1850. It then turns to the actual process of economic growth in the late nineteenth century, the impact of this process on the outbreak of World War II, and Japan's recovery and rise to economic preeminence after the war.", "completed": false}, {"dept_code": "HIST", "id": "1560", "course_title": "WOMEN IN LATIN AMERICAN HISTORY", "description": "A course tracing the history of women in Latin America from the conquest to the modern day.", "completed": false}, {"dept_code": "HIST", "id": "1610", "course_title": "UNITED STATES COLONIAL", "description": "This is an upper division course that develops the history of the North American English colonies from around 1400 through the early 1760s.", "completed": false}, {"dept_code": "HIST", "id": "1611", "course_title": "AMERICAN REVOLUTION 1763-1791", "description": "This is an upper division course that considers the history of Revolutionary America between the 1750s and the 1790s.", "completed": false}, {"dept_code": "HIST", "id": "1653", "course_title": "COLD WAR AMERICA IN THE WORLD", "description": "This course explores the impact of the Cold War on the American home front during its years of peak influence, 1945-1965. We will investigate the postwar division of the world into two opposing camps, and then take up topics such as McCarthyism, American reactions to the atomic bomb, the culture of consumption, suburbanization, and youth culture. We will ask how the Cold War climate fostered (or hindered) social movements for racial equality, participatory democracy, and women's rights. At its close, the course asks which hallmarks of the early Cold War - from lonely crowds to paranoid politics - persist today.", "completed": false}, {"dept_code": "HIST", "id": "1661", "course_title": "GENDER AND SEXUALITY IN THE US SINCE 1865", "description": "This upper-level course is part of a two-course sequence which surveys the history of women in the United States. Part 2 focuses on women's experiences from 1865 to the present with special attention to class, ethnic, and geographic differences among women.", "completed": false}, {"dept_code": "HIST", "id": "1685", "course_title": "U.S. POPULAR CULTURE", "description": "This course examines the development and social impact of mass-produced and mass-consumed forms of culture in Twentieth Century America.", "completed": false}, {"dept_code": "HIST", "id": "1692", "course_title": "LGBTQ IN THE USA, 1900-PRESENT", "description": "With growing contemporary interest in LGBTQIA issues and student activism surrounding gender identity and sexuality, this course provides necessary historical context for understanding such political and cultural phenomena in 20th-century U.S. history. It charts the trajectory of different identities and sexualities (too often classified as transgressive or deviant) from the beginning of the century through post-World War II efforts to seek greater freedom and inclusion in American society.", "completed": false}, {"dept_code": "HIST", "id": "1695", "course_title": "ENVIRONMENTAL HISTORY", "description": "Environmental affairs since World War II with an emphasis on policy controversies. Topics include air and water pollution, public lands, wildlife, energy, toxic chemicals, urban environment, facility siting and more. Emphasis on the rise of environmental values in American society, the resulting policies, opposition to them, and the role of science, economic analysis, technology and management in the public debate.", "completed": false}, {"dept_code": "HIST", "id": "1706", "course_title": "DRUGS IN GLOBAL HISTORY", "description": "This course examines the global development of the modern \"pharmaceutical era\" through historical, anthropological, and sociological analyses. It traces the ever-increasing role played by chemical substances in shaping conceptions of health, treatment, and society itself from the early modern period until the present day. Topics include pharmaceuticals as an arena for competing and complimentary interests, the social character of drugs (both legal and illegal), the blurred lines between medicinal and recreational use, and the evolvement of government and scientific regulation of medications.", "completed": false}, {"dept_code": "HIST", "id": "1731", "course_title": "THE HISTORY OF GOD", "description": "God has a history. In the earliest days of that history, God was worshiped as one of a plethora of deities controlling various spheres of cosmic activity or the human world. Students in this course will learn about this ancient pantheon - how gods functioned in society and how their presence was experienced by those devoted to them. They will then trace the evolution of the God of Israel from a mountaintop deity of the southern Levant in the late second millennium BCE to a supreme deity worshiped by a small group of absolute monotheists based in Jerusalem in the mid-first millennium BCE. Students will become more sophisticated readers of biblical texts in the process. The sources of the Hebrew Bible reflect not a homogeneous monotheism, but rather a diverse set of belief systems tending toward henotheism or even polytheism. By appropriating and reinterpreting the religious myths of their neighbors, the Israelites arrived at a character of the divine that has proven problematic to many contemporary theologians, particularly on issues of LGBT rights, women's rights, and the environment.", "completed": false}, {"dept_code": "HIST", "id": "1757", "course_title": "RELIGION IN INDIA", "description": "An introduction to the religious traditions that have developed in the Indian subcontinent and their role in shaping the cultures of India.", "completed": false}, {"dept_code": "HIST", "id": "1765", "course_title": "ISRAEL IN THE BIBLICAL AGE", "description": "This course explores the history and development of the people of Israel in ancient times. What do we know about the Israelites and how do we know it? Using biblical texts and archaeological remains, students will learn about everyday life in ancient Israel, the role of class and gender, life-cycle events, religious festivals, political institutions, systems of belief, and famous personages in history and lore. The trajectory of the course will begin with the Near Eastern origins of the people, continue through the rise of the Israelite and Judahite monarchies, and end with the Second Temple commonwealth of Judea in the Persian and Hellenistic periods.", "completed": false}, {"dept_code": "HIST", "id": "1772", "course_title": "RACE, CASTE AND ETHNICITY IN A GLOBAL PERSPECTIVE", "description": "This course will compare and contrast the ways in which race, caste and ethnicity operate in a variety of national, economic, demographic and cultural settings, notably Cuba, Brazil, South Africa, India, China, and the U.S. The course will include films, readings and slides obtained for a semester-at-sea voyage to those countries.", "completed": false}, {"dept_code": "HIST", "id": "1776", "course_title": "VARIETIES OF EARLY CHRISTIANITY", "description": "Through early Christian literature (such as non-canonical gospels and the writings of the Church Fathers) and various types of archaeological evidence, this course examines the many different and often competing forms of Christianity that developed in the first four centuries of the common era. Among the areas of examination are key theological issues, creedal formulation, Gnosticism, martyrdom, asceticism, Christian relations with pagans and Jews, and the battles over orthodoxy and heresy. We also assess the conversion of Constantine and the social and political implications of the Christianization of the Roman Empire.", "completed": false}, {"dept_code": "HIST", "id": "1781", "course_title": "ROMAN HISTORY", "description": "This course surveys the history of Rome from the earliest times through the late empire, with particular emphasis on political and social developments during the late republic and early empire.", "completed": false}, {"dept_code": "HIST", "id": "1796", "course_title": "HISTORY OF AFRICA SINCE 1800", "description": "Surveys history of Africa from 1800 to the present day. Major themes include African statecraft, European colonization, African nationalism and postindependence problems. Processes of African institutional growth within the perspectives of resiliency, change and adaptation will be emphasized.", "completed": false}, {"dept_code": "HIST", "id": "1802", "course_title": "REES CAPSTONE COURSE", "description": "¿ The objective of this capstone course in Russian, East European, and Eurasian Studies is to provide you with the opportunity to draw on and synthesize all of the skills and knowledge gained in the various courses and seminars that you have taken, and apply them to a topic relevant to the subject of the course. The course is open to all students interested in Russia, Eastern Europe, and/or Eurasia, and not just to those who are pursuing the REEES Certificate.", "completed": false}, {"dept_code": "HIST", "id": "1906", "course_title": "ATLAS INTERNSHIP", "description": "The Digital Atlas Design Internship supports student research by teaching interns how to use digital tools and methods to explore the global past. Students manage a semester-long independent research project using an interactive, public-facing platform that utilizes GIS and web design skills gained during the internship. Students engage with both world history and digital humanities while developing a spatial database about a topic of their choosing. Experience with digital methods or GIS is not necessary, and students can receive publication credit for their work. To learn more about the Digital Atlas Design Internship, please visit https://www.worldhistory.pitt.edu/digital-atlas-design-internship. You can also view past internship projects by visiting our project gallery at https://www.worldhistory.pitt.edu/projects.", "completed": false}, {"dept_code": "HIST", "id": "1910", "course_title": "READING HISTORICAL RUSSIAN", "description": "This mini-course is designed to improve students' ability to read and understand Russian-language texts from the Russian Empire and Soviet Union. It focuses on texts that have never been translated, thus offering a unique glimpse into the past made possible only through investment in language study. It is targeted at students who have completed equivalent of at least 4 semesters of Russian language study, as well as heritage speakers.", "completed": false}], "links": []}