{"nodes": [{"dept_code": "PS", "id": "0200", "course_title": "AMERICAN POLITICS", "description": "This course is, quite generally, designed to provide students with a basic working knowledge of the basic goals of the constitutional framers, giving students an understanding of the purposes of the American political system; the essential structures (or institutions) within the American political system, the behavior (broadly defined) of the actors within the American political system, the purpose and performance of the linkage institutions in the United States (possibly including political parties, elections, and interest groups); and the types of policies that are often produced by a system with the characteristics of those found in the United States. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0300", "course_title": "COMPARATIVE POLITICS", "description": "This course provides students with basic information about a range of political systems outside the United States and teaches them to use that information to examine major theories about politics. The course is also designed to help students understand the government and the politics of the United States in comparative perspective and to develop some understanding of comparative methodology and the logic of comparison as a social science method. Depending on the interests, area of expertise, and inclinations of the particular instructor, some regions and topics might be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0500", "course_title": "INTERNATIONAL RELATIONS", "description": "This course aims to increase students' knowledge of the history of the modern state system and, in particular, political developments during the past few decades. It introduces students to basic concepts and analytic frameworks that political scientists employ to understand world politics, enhancing students' knowledge of international institutions that play important roles in world politics and exploring current issues in world affairs relating to human welfare and security. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0550", "course_title": "INTRODUCTION TO GLOBAL STUDIES", "description": "Global Studies is a rapidly growing interdisciplinary field that explores how people interact with one another and with nature across existing boundaries, over long distances, and in ways that affect the entire planet. It provides new and exciting ways of looking at connections and divisions in the world beyond the confines of particular places, nation states, and regions. This course provides an introduction to the field. It examines current global trends and issues in ways that encourage you to think critically about how we analyze, interpret, and respond to global interactions and their consequences for different regions, localities, and groups. It gives particular attention to the concept of globalization, highlighting the controversies surrounding its use and engaging core debates about the impact of global and transnational processes on economic relations, politics and governance, cultural interactions, and the environment.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0600", "course_title": "POLITICAL THEORY", "description": "This course is designed to introduce students to the idea of normative political theory and to important authors and concepts in the western political theory tradition. Students will learn to understand both historical and contemporary debates surrounding important political concepts such as authority, justice, liberty, and democracy, and to appreciate the differences among normative, empirical, logical, and faith-based political claims. Students will learn to read critically and analytically, to make simple normative arguments, and to explain the specific role of normative arguments in political science and political life. Depending on the interests, area of expertise, and inclinations of the particular instructor, some of these may be emphasized more heavily than others.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "0700", "course_title": "RESEARCH METHODS IN POLITICAL SCIENCE", "description": "The course provides an introduction to scientific inquiry applied to the study of politics. The main emphasis of this course is to introduce political science majors to key analytical concepts and to their application to the study of politics. The course covers the logic of scientific inquiry, research design, and quantitative methods.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1000", "course_title": "HONORS THESIS-MAJORS", "description": "Students prepare a thesis, under guidance of a faculty advisor, which is read and evaluated by a committee of three faculty members.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1201", "course_title": "CONSTITUTION AND CIVIL LIBERTIES", "description": "The course will explore major topics in the area of civil liberties and civil rights which have concerned the Supreme Court in recent years and which have provoked extensive political and social controversy. Examples include decisions about discrimination, privacy, freedom of speech and assembly, and conflicts between freedom of the press and a fair trial.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1202", "course_title": "AMERICAN CONSTITUTIONAL LAW", "description": "The course will serve as an in-depth introduction to the study of constitutional law. The class work and discussions will focus on the development and evolution of the law relating to the powers of each branch of government, the checks and balances limiting those powers and the rights of individuals protected by amendments to the Constitution. Students will be responsible for reading and being able to discuss court decisions addressing major constitutional issues confronted by government and society as a whole. Class members will also be encouraged to identify and discuss factors that may impact judicial decision making, such as current events, political forces, judge¿s backgrounds and historical events.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1211", "course_title": "LEGISLATIVE PROCESS", "description": "This course provides an analysis of the legislative process in modern democracies with primary attention devoted to the legislative process in the United States. The history and meaning of representation is analyzed as is the behavior of participants in the legislative process. The impact of social-economic forces on decision-making in the United States is studied as are the roles of interest groups, political parties, the executive branch, and the judiciary.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1212", "course_title": "AMERICAN PRESIDENCY", "description": "This course provides an analysis of presidential leadership in the united states. The first part of the course deals with factors helping to explain presidential leadership; how presidents are nominated and elected, the constitutional framework within which the presidency operates, presidential relations with the bureaucracy, and presidential personality. This framework is then used for an intensive analysis of presidential leadership in foreign and domestic policy.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1216", "course_title": "MODERN CIVIL RIGHTS IN AMERICAN POLITICS", "description": "In this class, we will analyze several major areas of civil rights in American politics from the 20th century until the present day. Our primary case studies will be disability rights, women's rights, Black civil rights, and LGBT rights. For each of these topics, we will detail the role of the political parties, coalitions, mass activism, and the judiciary in the expansion of civil rights.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1220", "course_title": "SPORTS AND AMERICAN POLITICS", "description": "This course focuses on the intersection of politics and sports from a social science perspective. We will critically examine empirical evidence on the politics of sports on such topics as race, gender, stadium siting, concussions, collective bargaining, and corruption. These are just a few of the issues that demonstrate how sports and politics are intertwined. Indeed, sports are even used as a tool by government to promote nationalism (e.g., the olympics, the singing of the national anthem before events, etc.). You do not need to be a fan of sports to understand and analyze the relationship between them and politics; indeed, being a fan may lead you to have \"blind spots\" on certain topics.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1231", "course_title": "POLITICAL PARTIES AND ELECTIONS", "description": "This course examines the organization and character of American political parties, the impact of environmental factors on party processes and behavior, patterns of party competition, and the role of parties in shaping public policy and in providing a linkage between public and government. Attention is also given to the political behavior of the American public. Recent changes in the organization of party institutions are examined.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1240", "course_title": "THE POLITICS OF DIVERSITY", "description": "This course explores the benefits and pitfalls of diversity both in American national politics and the politics of everyday life. Students will read and discuss some of the top research on questions surrounding diversity and will conduct original research on the topic. Students will also learn valuable skills they will be able to bring to bear as they enter today's diverse workplaces.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1252", "course_title": "STATE GOVERNMENT", "description": "This course will survey political processes and public policy outcomes in the fifty American states. Policy areas to be covered include the environment, era, taxation, crime and law enforcement, and welfare.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1261", "course_title": "AMERICAN PUBLIC POLICY", "description": "This course will focus on a variety of public policy issues. The issues include social welfare programs, management of the economy, governmental regulation of business activities, environmental programs, urban problems, civil rights, civil liberties, crime control efforts, and foreign policy.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1263", "course_title": "HEALTH POLICY AND HUMAN FLOURISHING", "description": "The nation is facing a health crisis. For the first time since the early 20th century, we are experiencing a reduction in life expectancy overall and especially in vulnerable communities. Moreover, Americans face even broader and more existential threats to personal and community health as evidenced by growing rates of loneliness, depression, social isolation, civic unrest, and polarization. The government has an important role to play in promoting a health of the nation through development of public policy that promotes conditions that make health possible. In this class, we explore different conceptions of health and work to develop a capacious definition of health as ¿human flourishing¿ that incorporates threats to personal and community health beyond the physical and psychological. We then discuss ways in which the government in combination with rich civil society might promote human flourishing. We conclude the course exploring challenges and opportunities facing American liberal democracy in promoting human flourishing.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1281", "course_title": "CAPSTONE SEMINAR IN AMERICAN POLITICS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1311", "course_title": "WESTERN EUROPEAN GOVERNMENT AND POLITICS", "description": "This course covers the politics and government of Western European countries at the national and local levels. It also considers some aspects of the relationships between the European Union and its member states.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1316", "course_title": "ASIAN POLITICS", "description": "This course introduces students to the politics of Asia by examining and comparing the political systems, economic performance, civil society, and the effect of globalization among countries of East- and South-East Asia. Particular attention will be given to Asian regionalism, focusing on regional powers and their efforts in promoting regional cooperation and integration. The course offers an overview of Asian regional cooperation mechanisms (ASEAN and ASEAN+, East Asia Summit, ARF) as well as current thematic issues such as Asian integration, contemporary Asian nationalism, and state-centered capitalism. Through the use of contemporary film and media, students will be engaging in discussions on Asia and its impact on the future of the international order.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1317", "course_title": "POLITICS OF THE EUROPEAN UNION", "description": "This course is designed to introduce students to the government and politics of the European Union. It will provide a historical overview of the creation of the EU and development of European integration and introduce students to the EU's governing institutions, current policies and debates, and the public's views of the EU through public opinion and electoral politics.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1332", "course_title": "GOVERNMENT AND POLITICS IN CONTEMPORARY CHINA", "description": "An introductory analysis of contemporary Chinese politics. Topics to be considered include the traditional background, the Chinese revolution, the role of revolutionary ideas and institutions in Chinese political life since 1949, recent and current policy issues, and possible future trends.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1351", "course_title": "GOVERNMENT AND POLITICS OF THE MIDDLE EAST", "description": "A survey of the developing political systems of the Middle East and their positions in world affairs. Considered are the growth of political institutions in the modern era, the nature of political leadership, the evolution of political attitudes, and the legacy of Western and Soviet imperialisms. The states dealt with are Iran, turkey, Iraq, Lebanon, Jordan, Syria, Egypt, and Israel. The course includes a diplomatic simulation exercise designed to illustrate the complexity of foreign policy interactions in the region.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1367", "course_title": "ENVIRONMENTAL POLITICS", "description": "A multidisciplinary general education course designed at an introductory level. This course provides students with comprehensive knowledge of the organizations, interests, and processes that shape environmental policy. It explores the local, regional, and global dimensions of the most critical environmental problems and issues facing policy makers today, including land-use management, energy conservation, acid rain, lead poisoning, indoor air pollution (radon pollution), ozone depletion, waste management, waste dumping in the ocean, deforestation worldwide, habitat destruction, and global warming.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1381", "course_title": "CAPSTONE SEMINAR IN COMPARATIVE POLITICS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1387", "course_title": "POLITICS OF WATER", "description": "Given the need to highlight the contributions political science offers to our study of the Anthropocene, this interdisciplinary course investigates the role of water in the political development of contemporary Central Eurasia. As a landlocked world region, Central Eurasia provides a compelling case for the study of the political, social, and technological innovations that has yielded sites of ecological disaster and environmental frontiers of opportunity. This course guides students through the key stages of Soviet political change and its impact on the issues of Central Eurasian water culture: the collapse of tsarist governance and the withdrawal of its engineer-specialists, ending its \"civilizing mission\"; the arrival of US experts whose modern irrigation methods inadvertently contributed to environmental degradation and economic dependence; the \"shock\" construction sites of the Stalin era; the misguided dam-building projects of the late Soviet period; and finally the issues relating to the international cooperation to manage the river basins connecting Kyrgyzstan, Tajikistan, Uzbekistan, Turkmenistan, and Kazakhstan.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1399", "course_title": "ANALYSIS OF COMPARATIVE POLITICS", "description": "Comparative Parties and Elections. In this class, you will become familiar with political parties, party systems and elections around the world and gain a better understanding of the role that parties play in different contexts. For the analysis portion of the class, we will analyze party platforms, election data, and voter surveys. You will learn how to use, interpret, and present data relating to party positions, election results, and voter behavior.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1508", "course_title": "INTERNATIONAL TERRORISM", "description": "Terrorism has gone from a relatively marginal security concern to one of the thorniest security issues in international politics. Indeed, today there are few countries that do not suffer from some form of terrorism. And terrorist groups such as the Islamic state in Syria pose significant challenges for the international community. This course aims to introduce students to main debates surrounding terrorism. The course will deal with questions regarding the definition of terrorism, its causes and historical evolution, the relationship between insurgency and terrorism, the organizational structure of terrorist groups and the tactics they use. We will also analyze counter-terrorism and the factors that influence its effectiveness. Throughout the course, we will have a chance to take a closer look at some of the terrorist groups such as Al-Qaeda, Islamic state, Hamas, ETA, Tamil Tigers, among others. In the last part of the course, we will deal with the rise of domestic terrorism in the U.S.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1511", "course_title": "AMERICAN FOREIGN POLICY", "description": "Provides a historical survey of American foreign policy from the end of World War II until the present, an analysis of the decision making process led by the president of the United States, and a discussion of the impact of both the international political system and American domestic politics on this process.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1517", "course_title": "US FOREIGN POLICY TOWARD THE MIDDLE EAST", "description": "The purpose of the course is to have students use a conceptual framework to analyze U.S. foreign policy towards the Middle East. They will do this within the context of the various traditions that have given direction to U.S. foreign policy conduct over the ages. As part of this, students will analyze U.S. policy towards the Middle East since the Cold War, and then use this as an historical backdrop for looking at different foreign policy options towards this tumultuous region for the future. The class will help develop the students' conceptual understanding of the complexities of foreign policy-making and enable them to tease out pertinent trends and patterns that otherwise might seem elusive. They will also get a grounding in how to conduct high level foreign policy analysis and gain an understanding of the foundations of strategy and its application in U.S. foreign policy towards the Middle East.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1537", "course_title": "PEACEMAKING & PEACEKEEPING", "description": "This course explores the conditions that lead to initiation, escalation, and termination of Civil Wars as well as the circumstances that promote or restore peace within states. Why do Civil Wars break out in some countries but not others? Why do Civil Wars last as long as they do? How does the international community help resolve Civil Wars? The ultimate goal of this course is not to examine a particular Civil War in detail but rather to provide a broad theoretical treatment of Civil Wars, and a better understanding of international relations. Upon completion of this course, you should be familiar with the factors that mitigate or exacerbate conflict within states and develop informed insights about the mechanisms of conflict management and resolution.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1555", "course_title": "GLOBAL STUDIES MINI COURSE", "description": "This mini course will be offered in Fall and Spring terms. The basic descriptions differ in each term and can be found below. Additionally, specific information will be added to the Notes section as it becomes available and edited by individual events and instructors each term. Fall Terms: Global Health: This course engages the interdisciplinary nature of global health by approaching the issue through the lens of the Sustainable Development Goals (SDG) developed by the United Nations. With an applied focus, the course will assist students in engaging and advocating for a community on a global health issue through a policy memo. For more information see the Global Studies web site or contact global@pitt.edu. Spring Terms: Cities in Transformation: This course views cities as hubs where patterns, connections, discussions, and the processes shape such issues as social justice, economic development, technology, migration, the environment among others. By examining cities as a lens, this course encourages students to examine cities as a system for discussing social processes being built and rebuilt. For more information see the Global Studies web site or contact global@pitt.edu.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1581", "course_title": "CAPSTONE SEMINAR IN INTERNATIONAL RELATIONS", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "PS", "id": "1583", "course_title": "TOPCS IN INTERNATIONAL RELATIONS", "description": "Current topics of interest in international relations. Topics covered vary with instructor and term.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1591", "course_title": "CONFLICT AND WAR - ANALYSIS", "description": "The primary objective of this course is to introduce the student to theoretical arguments and empirical evidence concerning the sources of conflict and war in human society, particularly within the international arena. Reading material will be drawn from a number of disciplines, including psychology, sociology, history and political science. This class will include a significant training in a specific analysis method or methods to complement the course topic, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1661", "course_title": "GAME OF THRONES AND POLITICAL THEORY", "description": "This course considers George R.R. Martin's popular \"song of fire and ice\"/\"game of thrones\" series in a political context. The class will consider the way that the series speaks to and shapes political attitudes and beliefs, as well as the way that martin's creative vision was formed by reference to history and politics. The course will begin with reading martin's own writing: the book game of thrones. Then it will explore the historical inspiration of the series, the wars of the roses, and some of the political theory that was created in reaction to that period. Following that, it will cover a few critical political theorists whose works focus on narratives about power, deception, and authority (the core themes of the series). Students in the class will gain exposure to Machiavelli, Locke, de Montesquieu, and Arendt in the course of this consideration, while also getting a chance to understand and discuss the popular books and television show in academic and sustained fashion. As a note, prior reading or viewing of the series is not required, nor necessary, though it will be helpful (and a spoiler policy will be given before the start of the term to minimize concern for those at various points of encountering the series). Grading will be primarily focused on short reaction papers, in-class writing and recall exercises, and a final argumentative research paper.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1675", "course_title": "POLITICS OF HUMAN RIGHTS", "description": "Human rights have become the dominant normative discourse in global politics today. They are invoked by world leaders justifying military or 'humanitarian' interventions and by local and indigenous social movements challenging their domination within existing systems of social relations. They are lauded as essential to human dignity and decried as tools of imperialism and neo-colonialism. They are tools of the oppressor and tools for the oppressed. How can we make sense of these seemingly contradictory uses and understandings of human rights? This course seeks to explain human rights as fundamentally contested political claims. It develops this perspective through attention to the real politics of human rights, surveying existing human rights law and institutions, examining several important contemporary human rights issues, and reflecting on the different tools that political and social science offer for making sense of these controversies. The emphasis is on helping students to acquire a critical understanding of human rights that they can use to assess contemporary events; students will work together on collaborative projects on issues of their own choosing to develop and apply their learning.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1681", "course_title": "CAPSTONE SEMINAR IN POLITICAL THEORY", "description": "Capstones are writing intensive courses for senior, PS majors. Subject matter will vary from term to term depending on the interests, area of expertise, and inclinations of the particular instructor.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1691", "course_title": "MYTH, PROPAGANDA, AND THE STATE - ANALYSIS", "description": "This course focuses on a single notion: that states use narrative(s) to support their regimes. The class aims to prepare students for understanding how story, myth, propaganda, and indoctrination are used by various political actors to build, sustain, and/or destroy regimes. The course begins with a consideration of quintessential cases of states engaging in these practices (ancient Rome, fascist Italy, imperial Japan, and Cambodia under the Khmer Rouge). It then examines parallel examples within united states history and narratives. The second half of the course then focuses on the practice of propaganda specifically, considering its modern origins in WWI, examining transitions in technique across multiple states, weighing linkages to advertising and public information campaigns, and finally having students construct their own propaganda. The course concludes with a formal content analysis training focused on a particular vein of propaganda, and an assignment that has students blending content analysis consideration with political theory argument construction. This class will include a significant training in a specific analysis method or methods to complement the course topic, as well as satisfy the requirement for a Political Science department analysis course.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1702", "course_title": "VISUALIZING AND UNDERSTANDING SOCIAL DATA", "description": "Much of modern data analysis involves presenting and interpreting various forms of ¿social data¿ (e.g. political, economic, and sociological) in a way that is clearly interpretable and understandable to a general audience. This class is a gentle introduction into data analysis and visualization. The key objective is learning through practical examples how messy real world data can be turned into clear and interpretable visualizations, tables, and more. The course will cover topics such as creating maps of spatial data, visualizing trends over time, analyzing text data, merging different datasets and creating reproducible projects. It aims to give students exposure to coding and computer languages that are often used in data analytics in industry, government and academia.", "completed": false, "prereq_count": 0}, {"dept_code": "PS", "id": "1910", "course_title": "INSTITUTE OF POLITICS INTERNSHIP/SEMINAR", "description": "Students selected for the institute of politics internship will register for this course for the experiential component of their internships. The purpose of the internship experience is to provide the student with direct exposure to the process of public decision-making. Each student will spend nine hours a week working with an individual or office directly involved in the policy making process. Students will be given specific responsibilities and will be expected to be an active and integral part of the office in which they are placed. The details and terms of each placement will be carefully worked out and agreed upon by the student, the placement supervisor and the placement sponsor. Utmost care will be taken to insure that the student is placed in a situation that will maximize his/her exposure to all office activities and that the student is not left unsupervised and uninvolved. Students from all disciplines may apply, but preference will be given to students in their junior and senior years. Students must report to their placement for at least nine hours a week and fulfill any agreed upon responsibilities. Students will also be required to keep a written journal which describes and analyzes their internship experience", "completed": false, "prereq_count": 0}], "links": [{"source": "0200", "target": "1281"}, {"source": "0300", "target": "1381"}, {"source": "0500", "target": "1581"}]}