{"nodes": [{"dept_code": "HHD", "id": "0031", "course_title": "MODERN DANCE 1", "description": "Introduces the college student to modern dance as a point of view, rather than a particular technique. There will be exercises to increase strength, and flexibility, as well as to teach techniques of movement, exploration and improvisation. Emphasis is on developing a sensitive awareness of one's own body movement in time and space.", "completed": false}, {"dept_code": "HHD", "id": "0032", "course_title": "MODERN DANCE 2", "description": "This course is designed for those students who have mastered beginning dance technique and wish to gain more advanced skills. Advanced technique and compositional work is stressed. Course objectives include increased technical skills, awareness and appreciation of modern dance as an art form, ease in phrasing rhythmical movement and skill in improvisational movement.", "completed": false}, {"dept_code": "HHD", "id": "0033", "course_title": "BALLET 1", "description": "For absolute beginners introducing them to basic fundamentals of the classic ballet technique.", "completed": false}, {"dept_code": "HHD", "id": "0040", "course_title": "CHOREOGRAPHY", "description": "The art of making dances. Studies dealing with timing, grouping, energy, quality, etc., Lead to the creation of dances. Designed for students who wish to explore the creative process or for those wanting more advanced dance training.", "completed": false}, {"dept_code": "HHD", "id": "0041", "course_title": "JAZZ 1", "description": "Fundamentals of jazz dance for beginning dance students. Class includes warm-up, center floor, and cross floor movement combinations, contemporary jazz and pop music is emphasized.", "completed": false}, {"dept_code": "HHD", "id": "0050", "course_title": "SPORTS AND DRUGS", "description": "This course presents medical and scientific information about the use of drugs in sports. It is especially designed for college athletes, but should also be of interest to students preparing for careers in athletic training, coaching, exercise science, health and physical education, physical therapy, and sports medicine.", "completed": false}, {"dept_code": "HHD", "id": "0060", "course_title": "INTRODUCTION TO DANCE", "description": "A comprehensive overview of dance as an art form and physical activity, covering the history and philosophy of dance. Dance will be examined as a means of communication and expression, and its relationship to other art forms. A particular emphasis will be placed on Western dance forms and its multicultural roots.", "completed": false}, {"dept_code": "HHD", "id": "0196", "course_title": "FIRST AID AND CPR", "description": "A 2-credit lab/lecture discussion course in which American Red Cross techniques of cardiopulmonary resuscitation (CPR) for the professional rescuer and community first aid and safety are presented. In addition to these skills, current methods of management and treatment of emergency illnesses and injuries are also taught. American Red Cross certification available to all students who meet the standards.", "completed": false}, {"dept_code": "HHD", "id": "0244", "course_title": "DANCE PRODUCTION 2", "description": "This course is designed to familiarize students with both the technical and production aspects of dance in all its forms. The students will have experiences with lighting, costume, choreography, public relations, and stage management.", "completed": false}, {"dept_code": "HHD", "id": "0477", "course_title": "INTRODUCTION TO EXERCISE SCIENCE", "description": "This course will introduce students to the field of Exercise Science and its related professions. This course is intended for those students considering Exercise Science and its related professions as an academic major and for career placement. This course will involve exposure to the history and contemporary opportunities within Exercise Science that will involve both lecture and applied experiences.", "completed": false}, {"dept_code": "HHD", "id": "1001", "course_title": "INTRO EDUCATIONAL PSYCHOLOGY", "description": "A survey of current problems in education which psychological theory and research can address. Topics include developmental approaches to teaching, educational applications of learning theory, classroom management, and testing strategies for teachers.", "completed": false}, {"dept_code": "HHD", "id": "1003", "course_title": "DEVELOPMENT: MIDDLE CHILDHOOD THROUGH ADOLESCENCE", "description": "Adolescence is studied from a developmental perspective. Discussion begins with the history and cultural varieties of adolescence and proceeds to cover psychological accompaniments to puberty. Lectures and readings deal with cognitive growth, identity formation, moral development, family and peer relationships, psychological disturbance and education through the adolescent years.", "completed": false}, {"dept_code": "HHD", "id": "1005", "course_title": "TEACHING GLOBALLY AND LOCALLY IN A DIVERSE WORLD", "description": "Students will be able to apply this knowledge specifically to their teaching practice as they begin their field experiences. We will critically engage in understanding the complex factors that impact education in the United States today, with an emphasis on Urban Education. A review of past teaching policies and practices will support a better understanding of the American schooling system in the 21st Century. In the Teaching Globally and Locally in a Diverse World class pre-service teachers will: (a) discuss strategies for teaching all children in a responsive, equitable manner , (b) learn to analyze the effects that marginalization has on children, (c) investigate the impact that race, culture, and socioeconomic status have on a child's education, and (d) review school reform and policy practices that have created various types of schools available to students in the United States. Knowing that the landscape of education is changing in the United States we will discuss the globalization of schooling in our society, along with the need for a higher technological understanding to prepare children for success in today's world.", "completed": false}, {"dept_code": "HHD", "id": "1011", "course_title": "APPLIED HUMAN ANATOMY", "description": "This is a non-laboratory lecture discussion course in which all body systems are investigated. Primary emphasis is placed on the skeletal, articular, muscular, cardiovascular and nervous systems. In addition, the basic mechanical principles underlying human movement and an understanding of human structure are used to analyze movement and physical skills.", "completed": false}, {"dept_code": "HHD", "id": "1012", "course_title": "APPLIED HUMAN ANATOMY LAB", "description": "", "completed": false}, {"dept_code": "HHD", "id": "1013", "course_title": "DEVELOPMENTAL PSYCHOPATHOLOGY", "description": "Examines the traditional medical-model view of psychopath ology in children and youth, presents alternative ways of looking at this behavior, and gives an introduction to the interpersonal skills needed for therapeutic intervention.", "completed": false}, {"dept_code": "HHD", "id": "1016", "course_title": "DEVELOPMENT CURRICULUM AND ACTIVITIES", "description": "Study of the theoretical rationale for activity and environmental programming; its relationship to the development of children and youth; and practical applications in media selection, use, and environmental design for various populations.", "completed": false}, {"dept_code": "HHD", "id": "1029", "course_title": "DEVELOPMENTAL PRACTICE SEMINAR 2", "description": "A continuation of Developmental Practice Seminar 1 for the integration of theory, research, practice skills and experience related to developmentally focused child and youth care practice. The seminar is particularly focused on the internship experience and the related knowledge base.", "completed": false}, {"dept_code": "HHD", "id": "1042", "course_title": "PHYSIOLOGY OF EXERCISE", "description": "A lecture and laboratory class in which the effects of exercise and sport upon body systems will be investigated. Reviews knowledge concerning physiological mechanisms which relate to improvements of physical performance.", "completed": false}, {"dept_code": "HHD", "id": "1043", "course_title": "CHILD/YOUTH PRACTICE 2", "description": "This course is a university approved, agency based, supervised internship in applied developmental practice which may or may not involve intervention practices. The internship may focus on work with and /or for children, youth and /or families. Fifty hours of on-site placement are required for each credit of registration.", "completed": false}, {"dept_code": "HHD", "id": "1044", "course_title": "BIOMECHANICS", "description": "Required course for undergraduate students in athletic training, exercise science, and teacher education. Provides studies to develop knowledge of biomechanical concepts and principles. Includes experiences to develop proficiency in the diagnosis of motor performance errors. Also places emphasis on applications of biomechanics in making curriculum and instruction decisions in physical education programs.", "completed": false}, {"dept_code": "HHD", "id": "1045", "course_title": "DIRECTED RESEARCH PRACTICUM", "description": "Students complete a comprehensive review of literature on a movement-related problem and then, under the guidance of a faculty member, design, conduct, and report an original research project.", "completed": false}, {"dept_code": "HHD", "id": "1050", "course_title": "SUPRVSN ADM CHLD YOUTH WRK SETNG", "description": "This course focuses on issues and skill development in areas related to management and supervision in child and youth care programs. A modular format will cover the function of supervision and administration in child care; communication skills; supervisory functions and skills; program development and management; and current issues in child and youth care administration.", "completed": false}, {"dept_code": "HHD", "id": "1089", "course_title": "SPECIAL TOPICS", "description": "", "completed": false}, {"dept_code": "HHD", "id": "1169", "course_title": "HEALTH FITNESS PRACTICUM 1", "description": "", "completed": false}, {"dept_code": "HHD", "id": "1172", "course_title": "GROUP FITNESS INSTRUCTOR", "description": "This course is designed to provide students with the knowledge and practical skills needed to lead contemporary group exercise classes in bootcamp style fitness, total body conditioning, aquatic conditioning, and therapeutic water rehabilitation. Upon completion of this course, students will be competent to lead dynamic, high quality group exercise courses in both the fitness studio and from the pool deck. It will provide necessary instructor skills such as leadership, appropriate exercise selection, program design, and effective cueing. Students will gain experience in leadership in a variety of traditional and contemporary modes of instruction.", "completed": false}, {"dept_code": "HHD", "id": "1174", "course_title": "YOGA AND PILATES INSTRUCTOR", "description": "This course is designed to provide students with the knowledge and practical skills needed to lead Yoga and Pilates group exercise. Upon completion of this course, students will be competent to lead dynamic, high-quality group exercise classes in Yoga and Pilates. It will provide necessary instructor skills such as leadership, appropriate exercise selection and program design, and effective cueing. Students will experience introductory leadership in a variety of traditional and contemporary modes of resistance training instruction.", "completed": false}, {"dept_code": "HHD", "id": "1175", "course_title": "CARDIO CONDITIONING INSTRUCTOR", "description": "This course is designed to provide students with the knowledge and practical skills needed to lead cardiovascular conditioning group exercise classes including: General aerobics, hi-lo, step, cycle exercise, Kickboxing, and others. Upon completion of this course, students will be competent to lead dynamic, high-quality group exercise classes with a focus on cardiovascular conditioning. It will provide necessary instructor skills such as leadership, appropriate exercise selection and program design, and effective cueing. Students will experience introductory leadership in a variety of traditional and contemporary modes of cardiovascular conditioning exercise.", "completed": false}, {"dept_code": "HHD", "id": "1224", "course_title": "FITNESS ASSESSMENT AND EXERCISE PRESCRIPTION", "description": "Fitness for instructors will teach the student the major elements of fitness. How to assess fitness levels, determine fitness goals, design fitness programs and facilities. The course will be a combination of classroom, exercise, and practical experiences.", "completed": false}, {"dept_code": "HHD", "id": "1233", "course_title": "PRINCIPLES OF STRENGTH AND CONDITIONING", "description": "Instruction is provided describing the principles for development of pre-season, in-season and off-season strength and conditioning programs. Laboratory experiences will include the theory and techniques of operating strength training equipment.", "completed": false}, {"dept_code": "HHD", "id": "1241", "course_title": "TEACHING EXPERIENCE 1", "description": "One term clinical teaching experience with an instructor in \"basic instruction physical education\". Responsibilities include: teaching undergraduate students basic skills, physical fitness, and safety.", "completed": false}, {"dept_code": "HHD", "id": "1242", "course_title": "TEACHING EXPERIENCE 2", "description": "One term clinical teaching experience with an instructor in \"basic instruction physical education\". Responsibilities include teaching undergraduate students basic skills, physical fitness, and safety.", "completed": false}, {"dept_code": "HHD", "id": "1300", "course_title": "NUTRITION IN EXERCISE AND SPORT", "description": "This course will provide the student with basic nutritional information as it pertains to sport and exercise performance. Topics of discussion include weight reduction and management, nutritional requirements for athletic performance and maintenance of a healthy lifestyle, proper eating habits, diet fads, disordered eating, and supplementation.", "completed": false}, {"dept_code": "HHD", "id": "1486", "course_title": "BEHAVIOR CHANGE STRATEGIES", "description": "This course will focus on behavioral strategies for modifying health related behaviors. Primary focus will be placed on physical activity, eating behaviors, and weight control. Emphasis will be placed on practical application of behavioral principles in health related environments.", "completed": false}, {"dept_code": "HHD", "id": "1491", "course_title": "TEACHING HEALTH AND WELLNESS IN ELEMENTARY SCHOOLS", "description": "This class will focus on those factors that affect the health and well-being of children and how teachers may, through their work, promote the health of children both in and outside the educational setting. We will learn the importance of both promoting a healthy lifestyle within the young and the importance of advocating for a healthy environment in which all children and adults may flourish. Students will plan learning activities that will enhance the health knowledge, skills, attitudes and experience of young children.", "completed": false}, {"dept_code": "HHD", "id": "1996", "course_title": "CLINICAL INTERNSHIP", "description": "Supervised clinical experience for the B.S. Degree student. The student is placed in a clinical setting appropriate to his/her degree interests and career goals and must complete a minimum of 25 hours of clinical work per credit hour. Supervision is provided by both a cooperating clinical supervisor and the university clinical advisor.", "completed": false}], "links": [{"source": "1003", "target": "1013"}, {"source": "1011", "target": "1044"}, {"source": "1011", "target": "1224"}, {"source": "1011", "target": "1233"}, {"source": "1012", "target": "1224"}, {"source": "1012", "target": "1233"}]}