{"nodes": [{"dept_code": "HINDI", "id": "0102", "course_title": "HINDI 2", "description": "At the end of the second term of the first year of study the student should be able to produce all the significant sound patterns of the language, to recognize and use the major grammatical structures within a limited core vocabulary. The student should be able a) to engage in simple conversations with native speakers about a limited number of everyday situations and b) to read and write simple material related to the situations presented.", "completed": false, "prereq_count": 0}, {"dept_code": "HINDI", "id": "0104", "course_title": "HINDI 4", "description": "At the end of the second term of the second year the student should be able to converse comfortably with a native speaker on a variety of non-specialized subjects. The student will be offered an opportunity to experience and more fully understand the culture of the people who use the language through readings of various types. More complex writing tasks will be expected at this level.", "completed": false, "prereq_count": 0}, {"dept_code": "HINDI", "id": "1615", "course_title": "MANY RAMAYANAS: TRADITION AND DIVERSITY IN MODERN INDIA", "description": "This course will introduce you to the great Hindu epic, the Ramayana, a blue-print for daily living in India. Although composed two millennia ago, the remarkable fluidity of the story has resulted in literally hundreds of Ramayanas, as it continues to be retold and reimagined while moving across space and time. Within the Ramayana itself there are many controversial episodes; among these the two most important are Sita's trial-by-fire and her subsequent banishment by her husband, Rama, and Rama's mutilation of Shurpanakha as punishment for the latter's bold romantic and sexual overtures. These incidents are of great import because the faithful and loyal Sita is the \"Ideal Indian woman\" in popular imagination even today. More significant is the fact that authors and commentators continue to use both these characters to address modern issues relating to gender inequality. The Ramayana is thus a rich source of information not just in literary terms, although its defining characteristic, its fluidity, is under threat, with groups on the ultraright attempting to dictate the \"correct\" version , but also in political, social and religious terms. This course will thus take a multi-disciplinary role in exploring the richness of what modern scholars have come to call the Ramayana tradition, and its role in India today; we will study its implications for women, its reception in South India, and its role in the rising tide of Indian nationalism, while eventually questioning whether its characteristic fluidity is at threat by those who insist on only one \"pure\" version.", "completed": false, "prereq_count": 0}, {"dept_code": "HINDI", "id": "1909", "course_title": "SPECIAL TOPICS IN HINDI", "description": "", "completed": false, "prereq_count": 0}], "links": []}