{"nodes": [{"dept_code": "ANTH", "id": "0536", "course_title": "MESOAMERICA BEFORE CORTEZ", "description": "When Cortez and his Spanish soldiers arrived in Mexico, they found Indians living in large cities with impressive temples raised on tall pyramids, lavish palaces for rulers, elaborate markets, and skilled craftsmen working in gold, copper, feathers, stone, pottery, and other materials. They were astonished at a civilization so like their own and yet so different (so \"barbaric\" to European eyes). This course explores the development of this civilization back to its roots several thousand years ago, by reconstructing earlier cultures known only from archeological evidence.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0582", "course_title": "INTRODUCTION TO ARCHEOLOGY", "description": "Examines the nature of modern archaeological research. Lectures look at how archaeologists work in the field, their analytic techniques, and some of the principal methodological and theoretical problems facing the field. Specific examples are used to illustrate these topics.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0620", "course_title": "BIOCULTURAL ANTHROPOLOGY", "description": "This course is an introduction to general anthropology emphasizing the interaction of human biology and behavior. The course considers what it means to be human by examining the biocultural interface of both present and past human populations. Topics of discussion will include human adaptation to extreme environments, cross-cultural variations in infant sensorimotor development and biological and cultural diversity in general. An understanding and appreciation of the how's and why's of human biological and cultural variation will be stressed.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0680", "course_title": "INTRODUCTION TO PHYSICAL ANTHROPOLOGY", "description": "This course is designed to introduce the undergraduate to the issues, theories and methods of physical anthropology. Beginning with a consideration of evolutionary, genetic and geologic principles, the course goes on to consider, the diversity of fossil and extant primates, including humans. Issues in anatomy, paleontology and behavior will all be addressed.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0681", "course_title": "INTRODUCTION TO HUMAN EVOLUTION", "description": "This is an introduction to human evolution and, in general, the evolution of the larger group to which we belong, the order primates. We will survey first the development of evolutionary ideas and modern developments in biology and geology and then review the diversity of living and fossil primates, dwelling especially on the discoveries and controversies surrounding our own evolutionary past.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0711", "course_title": "THE INTRODUCTION TO THE ANTHROPOLOGY OF SPORT", "description": "Sport captures the minds and money of billions of people everyday, the Olympics, World Cup Soccer, American College Football, and Little League World Series. Television, radio, cell phones, internet keep us updated on the latest scores, highlights and goings on of our favorite and least favorite athletic personalities. Yet despite its overwhelming significance in everyday life it goes largely ignored in Anthropological discussions. This course serves to introduce students to the significance and centrality of sport in understanding and interpreting social life. Sport will be critically examined through major anthropological categories of race, class, ethnicity, gender and power. We will be using sport as the focal point with which to examine varying attitudes, institutions and social dynamics. This will not be a history of sport nor will it be a cross-cultural comparison of different kinds of sport from around the world but rather this course will seek to demonstrate to you how sport figures into the shaping of our worldview and structuring of social institutions.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0717", "course_title": "MAGIC, WITCHCRAFT AND THE SUPERNATURAL BODY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0768", "course_title": "HUMAN SEXUALITY IN CROSS CULTURE", "description": "This course explores the expression of human sexuality across a diversity of cultural and social settings using a cross-cultural framework that is based on comparing information on sexuality in other cultures with data from us. It includes how human groups manage sexuality and reproduction; theories of the development of marriage, family, and household systems; differences in values and expectations related to sexuality; the development as sexual expression across the life span; understanding heterosexual and homosexual relationships; and understanding sexual violence.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "0780", "course_title": "INTRODUCTION TO CULTURAL ANTHROPOLOGY", "description": "By examining the behavior and customs of peoples throughout the world, the course considers what it means to be human. We will describe the patterns of marriage, family organization, warfare and political behavior, economic systems, rituals, etc., Of other peoples, especially those of tribal societies, and compare these with American social patterns. Anthropological films and slide presentations will supplement lectures.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1528", "course_title": "SOUTH AMERICAN ARCHAEOLOGY", "description": "This course deals with cultural development in South America from 20,000 B.C. To Spanish contact. Emphasis will be placed on the earliest evidence for man, maritime adaptations, and origins of agriculture, rise of the state in the Central Andes and the rise of complex societies in the tropical forest. Stress will be placed on the evolution of Andean states including the origins and spread of the Chavin, Moche, Nasca, Tiahuanco, Chimu and Inca Empires.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1540", "course_title": "SPECIAL TOPICS IN ARCHEOLOGY", "description": "Topics covered vary greatly with instructor and term.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1543", "course_title": "ANCIENT STATES IN THE NEW WORLD", "description": "Drawing on the fact that the ancient new world was a dazzling treasure house of non-Western political thought and organization, this course uses archaeology and ethnohistory to document and make comparative sense of the rich variety of political arrangements which existed among prehispanic states in MesoAmerica and Andean South America. A special aim is to understand how Amer-Indian concepts about state craft and rulership mesh with anthropological and other theories about ancient states.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1551", "course_title": "GIS IN ARCHAEOLOGY", "description": "This is a \"lab\" class in GIS (Geographic Information Systems), specifically designed for students interested in archaeology. The course covers the basic background and skills necessary to manage and analyze spatial datasets in archaeology using GIS. We will cover all the basics that any introductory GIS class would cover (and more); however, we will especially emphasize the techniques that are most useful to archaeologists, such as field data acquisition, spatial queries, georeferencing, working with distance, working with DEMs (Digital Elevation Models), and cost-distance and visibility analysis. Over the semester, students will get substantial hands-on practice applying these skills to manage real archaeological data and investigate past social processes in space, especially at the regional scale.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1602", "course_title": "HUMAN SKELETAL ANALYSIS", "description": "This is an introduction to the study and analysis of the human skeleton, which will be based on lectures and lab. Topics include: development of teeth and bone, identification of whole bones and fragments and determination of sex, age, and stature (and other metric analyses), disease, and populational features. Real bony materials will be used in lab.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1619", "course_title": "SPECIAL TOPICS IN PHYSICAL ANTHROPOLOGY", "description": "Topics covered vary greatly with instructor and term.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1701", "course_title": "RELIGION AND RACE", "description": "This course examines the intersections of religion, race, and racism. Recently, scholars of religion have demonstrated that religious identities are often racialized as well. In this course, we will discover that religion and race are both modern categories rooted in post-enlightenment ideas about what it means to be human. We will see how the establishment of these religious and racial categories led to new hierarchies and inequalities. We will discuss how post-enlightenment thinkers linked religion and race, and how their ideas played a role in european imperialism. We will also investigate how the discipline of religious studies has developed its analytical tools with a racialized understanding of religion. The course will examine case studies in which religion has been racialized, and consider the political ramifications of these examples. In particular, we will think about the impact of white supremacy on black religion in the united states, the complicated relationship between antisemitism and islamophobia, and contemporary islamophobia in the us. Finally, we will explore the possibilities of anti-racism through faith-based scholarship and activism.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1703", "course_title": "THE HISTORY OF GOD", "description": "God has a history. In the earliest days of that history, God was worshiped as one of a plethora of deities controlling various spheres of cosmic activity or the human world. Students in this course will learn about this ancient pantheon - how gods functioned in society and how their presence was experienced by those devoted to them. They will then trace the evolution of the God of Israel from a mountaintop deity of the southern Levant in the late second millennium BCE to a supreme deity worshiped by a small group of absolute monotheists based in Jerusalem in the mid-first millennium BCE. Students will become more sophisticated readers of biblical texts in the process. The sources of the Hebrew Bible reflect not a homogeneous monotheism, but rather a diverse set of belief systems tending toward henotheism or even polytheism. By appropriating and reinterpreting the religious myths of their neighbors, the Israelites arrived at a character of the divine that has proven problematic to many contemporary theologians, particularly on issues of LGBT rights, women's rights, and the environment.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1709", "course_title": "ACTIVIST ANTHROPOLOGY", "description": "Following the work of activist anthropology this course will teach students that \"critical engagement brought about by activist research is both necessary and productive. Such research can contribute to transforming the discipline by addressing knowledge production and working to decolonize our research process. Rather than seeking to avoid or resolve the tensions inherent in anthropological research on human rights, activist research draws them to the fore, making them a productive part of the process. Finally, activist research allows us to merge cultural critique with political action to produce knowledge that is empirically grounded, theoretically valuable, and ethically viable.\" (Speed 2006). This course will teach students both the importance and value of conducting research that moves outside of the \"ivory tower\" of academia. \"[A]ctivist scholars work in dialogue, collaboration, alliance with people who are struggling to better their lives; activist scholarship embodies a responsibility for results that these \"allies\" can recognize as their own, value in their own terms, and use as they see fit.\" (Hale 2008) This course will explore major conceptual work on the role and ethical responsibility of anthropological research and social justice issues. Students will be required to participate in methodological exercises that will require engagement in the Pittsburgh community. While simultaneously learning as a student one will also be producing tangible resources for under-represented, marginalized and underserved communities.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1719", "course_title": "ANTHROPOLOGY OF RACE AND SCIENCE", "description": "One of Anthropology's major contributions to the world was the concept of \"Race\". But after the 1940s it was abandoned and \"Culture\" became Anthropology's trademark. This course examines why this happened and how our understandings of culture and race are connected. This course takes a critical look at the narratives and discourses in and around race and its relationship to Anthropological and scientific thought. We will examine how these discourses essentialize and naturalize bodies as well as our understandings of them. We will explore narratives which use the tool and authoritative voice of Anthropology, science, scientific method and genetics. In addition, we will look at some of the historical and contemporary narratives of the biological underpinnings of race discourse and its incorporation into everyday imaginings of social identities. This course will seek to engage both the social and biological framings of race and attempt to demonstrate where these discourses converge and where they divert away from one another. In addition to academic readings we will look at blogs, internet posts and media to view and critique the ways in which science logic becomes racialized logic in everyday discourse.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1727", "course_title": "HEALTH AND ENVIRONMENT IN PITTSBURGH", "description": "This course examines the relationship between environment and health, with a special focus on the city of Pittsburgh and the surrounding environs as a case study. We will use medical anthropology to systematically investigate the effect of the environment on health and the interplay of natural and human systems. Drawing on research in political ecology, this class will consider the social, political, and economic systems that shaped Pittsburgh and its inhabitants. We will pay particular attention to the way changing industrial and environmental conditions changed incidence of disease, and how exposure to risk and disease are shaped by race, gender, and class. We will examine issues like the histories of air pollution and resource extraction including coal mining, oil and gas drilling and their impacts on the environment and health. The course will examine how knowledge about health is produced and the development of new forms of citizen science that enlist local residents in projects to monitor issues like air quality.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1728", "course_title": "GENDER AND GLOBALIZATION", "description": "Gender is a key structuring principle of difference and inequality in society, while globalization is a condition characterized by time-space compression and ever-expanding connections across national boundaries. Globalization emerged out of such (and often violent) practices of contact as capitalism, colonialism, socialism, the Cold War, and neoliberalism. This course will explore the intersection of gender and globalization asking how gender shapes processes of globalization and how the role of gender is shifting as national/cultural regulatory systems are no longer able to maintain control over what is recognized as \"normative\" in the context of gender roles and gendered practices. This course will examine various facets of the interface between gender and globalization in such contexts as cross-border marriages, international adoption, sex and colonialism, gender and state violence, women in socialist welfare states, labor migration, the global sex industry, queer identities and activism, as well as gender and technology (especially, the intersection of gender inequality and the idea of technological enabled empowerment). The particular historical contexts in which we will discuss these themes include colonialism, the Cold War Era, post-socialism, and neoliberalism.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1737", "course_title": "SPECIAL TOPICS IN CULTURAL ANTHROPOLOGY", "description": "This course will be on a topic in the area of specialization of a visiting scholar yet to be determined.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1750", "course_title": "UNDERGRADUATE SEMINAR", "description": "This seminar brings together all undergraduate majors in anthropology for a seminar on the methods by which cultures around the world change over time. Defining such methods occupies much of any anthropologist's time, be he or she an ethnographer, archaeologist, physical anthropologist or linguist. The seminar therefore examines this central problem from many perspectives and affords the student ample opportunity for personal expression as well as rewarding discussion and research in a peer group environment.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1752", "course_title": "ANTHROPOLOGY OF FOOD", "description": "This course surveys the general subject of culinary anthropology. Topics include food exchanges and the construction of social groups, food and social boundaries, food taboos, symbolism of food, folk conceptions of food, sacrifice and food in religious contexts, world standardization of food preferences. Thus, the focus is on social aspects of food, eating, and exchange.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1760", "course_title": "ANTHROPOLOGY OF LAW", "description": "This course examines anthropological analyses of law and law-like phenomena in a number of societies, including the United States. Particular attention is given to the various ways that disputes are resolved in different social and cultural settings, and to the theoretical analyses used to explain these differences.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1761", "course_title": "PATIENTS AND HEALERS: MEDICAL ANTHROPOLOGY 1", "description": "This course surveys the field of medical anthropology and its history within the discipline of anthropology as a whole, from the perspective of social-cultural theory. Topics dealt with include ethnomedicine, ethnographic cases, cross-cultural studies of healing practices and connections between medicine and religion. Reference is also made to applied research in contemporary situations.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1762", "course_title": "HUMAN ECOLOGY", "description": "This course explores the ecology of the human species. We will study how humans adapt to their physical and cultural environment, and the interrelationships between people and the environment. Topics discussed include evolution and adaptation, population growth and regulation, foraging and subsistence strategies and production decisions, population interactions and resource management, and energy and human society.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1770", "course_title": "KINSHIP AND THE FAMILY", "description": "In this course Western and Non-western forms of kinship, family, and marriage will be discussed and analyzed. Special attention will be given to the history of European marriage, to family organization and industrialization, and to women's relation to kinship and family order. The differences in European and Non-European reactions to industrialization will be compared in some detail. Europe, China, India, and Japan will receive special attention.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1774", "course_title": "PERSPECTIVES ON RELIGION", "description": "A serious introduction to the study of religion is undertaken by reviewing the efforts and insights of the principal scholars in the field in the modern period.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1776", "course_title": "MYTH, SYMBOL AND RITUAL", "description": "A comparative examination of the myths, symbols, and rituals of different cultures.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1784", "course_title": "JAPANESE SOCIETY", "description": "This course will introduce students to contemporary Japanese culture and social institutions. Using scholarly books, essays, fiction and film, it will give students a range of different exposures to various aspects of Japanese society and everyday life: economic miracle, recession, middle class society, gender relations, sexuality, education, consumerism, and mass culture. The special focus of the course will be popular culture in japan. We will review the postwar history of popular culture and consider the reasons for its recent appeal abroad.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1793", "course_title": "ASIAN MEDICAL SYSTEMS", "description": "Using scholarly texts, ethnographic studies and historical documents, this seminar will focus on the medical systems of India, china, Japan, and South East Asia. The primary objective of the course is to understand various Asian medical systems on their own terms, both in theory and in contemporary practice. Primary attention will be given to Ayurveda, Unnani and traditional Chinese medicine. We will look at how so-called traditional medicine in Asia is being modernized in response to political, economic, social, and cultural transformations.", "completed": false, "prereq_count": 0}, {"dept_code": "ANTH", "id": "1804", "course_title": "RACISM AND CIVIL RIGHTS IN THE UNITED STATES", "description": "To introduce students to the legacy of racism and the social response of the Civil Rights Movement in the United States. Students will be given the opportunity to explore through an eight-day trip to key sites of the freedom struggle, as well as hear personal narratives of foot-soldiers and scholars of this crucial period in our nation's history. This course will be ideally suited for any majors but will be of interest to students in many disciplines in Arts and Sciences but also in other schools and colleges at the university with interest in these topics. Students in anthropology, history, sociology, urban studies, majors in the College of General Studies will also find applicable theories and knowledge for their majors. This course will serve as an elective in the Anthropology major but will also be submitted to satisfy various General Education requirements for all students at the university. To introduce students to the legacy of racism and the social response of the Civil Rights Movement in the United States. Students will be given the opportunity to explore through an eight-day trip to key sites of the freedom struggle, as well as hear personal narratives of foot-soldiers and scholars of this crucial period in our nation's history. The course will be divided into two main parts. The first part will be a seven-week academic curriculum with guest lectures and readings on the era and connected social issues around racism, law and politics. The second part will consist of an eight-day trip visiting sites and hearing from former leaders and current scholars specializing on connected topic. This course is designed to give students a highly experiential in-person experience on the role and impact of racism and its structuring effect on policies, institutions and individuals. The course will also give students the opportunity to connect current issues and concerns about racism with the Civil Rights era. Enrollment in the course is required for participation in the Study Away program.", "completed": false, "prereq_count": 0}], "links": []}