{"nodes": [{"dept_code": "REHSCI", "id": "1000", "course_title": "PRINCIPLES OF RESEARCH METHOLOGY", "description": "The study of the nature of research and the applications of the scientific approach in the research procedures. The course focuses on concepts, design techniques and interpretations, as well as limiting factors and ethical considerations.", "completed": false}, {"dept_code": "REHSCI", "id": "1206", "course_title": "HUMAN PHYSIOLOGY LAB", "description": "Detailed study of the functioning, integration and interrelationships of the organ systems of the human body using lecture and lab exercises. Topics will include microscopy, cell transport, bone and joint movement, EMG, EEG, Blood, Cardiovascular including: ECG, blood pressure and heart sounds, pulmonary function, urinalysis and digestion. Must be in or previously taken RESCHI 1205 to register for this lab.", "completed": false}, {"dept_code": "REHSCI", "id": "1215", "course_title": "EXERCISE PHYSIOLOGY", "description": "This course focuses on the effects of exercise in preventing and treating disability, in optimizing the rehabilitation process, and in maintaining the health of those with disabilities. The course emphasizes the effects of exercise on the various body systems, including the cardiovascular, neuromuscular, and musculosketetal, in individuals with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1216", "course_title": "EXERCISE PHYSIOLOGY LAB", "description": "Required lab component for REHSCI 1215 Exercise Physiology: This course focuses on the effects of exercise in preventing and treating disability, in optimizing the rehabilitation process, and in maintaining the health of those with disabilities. The course emphasizes the effects of exercise on the various body systems, including the cardiovascular, neuromuscular, and musculosketetal, in individuals with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1220", "course_title": "KINESIOLOGY AND BIOMECHANICS", "description": "Course will cover the functional anatomy and biomechanics of the major joints of the human body and the application of mechanics to describe and analyze normal and pathological human movement. Students will be analyzing muscle function and joint motions involved in an exercise or functional activity, palpating muscle groups and bony landmarks, testing the strength of a muscle group, and demonstrating exercises to stretch or strengthen various muscles.", "completed": false}, {"dept_code": "REHSCI", "id": "1221", "course_title": "KINESIOLOGY AND BIOMECHANICS LAB", "description": "Required lab component for rehsci 1220 kinesiology and biomechanics: course will cover the functional anatomy and biomechanics of the major joints of the human body and the application of mechanics to describe and analyze normal and pathological human movement. Students will be analyzing muscle function and joint motions involved in an exercise or functional activity, palpating muscle groups and bony landmarks, testing the strength of a muscle group, and demonstrating exercises to stretch or strengthen various muscles.", "completed": false}, {"dept_code": "REHSCI", "id": "1235", "course_title": "MEDICAL TERMINOLOGY", "description": "This course is designed to introduce students to the fundamentals of medical terminology. It includes word structure of basic medical and surgical terms and procedures, body parts and organs, body systems, selected medical specialties, and commonly used medical abbreviations and symbols. This course is a self-directed learning course, using a programmed text, with online quizzes (through Blackboard) and a final exam administered in a classroom.", "completed": false}, {"dept_code": "REHSCI", "id": "1250", "course_title": "PATHOPHYSIOLOGY/HUMAN DISEASE", "description": "This course has been designed as an extension of Physiology, in an effort to provide pre-clinical students with a foundational scientific knowledge and conceptual understanding of pathophysiological processes. The course fundamentally focuses on general mechanisms of disease that are typically applicable to multiple body regions and/or organ systems. In addition to these general mechanisms, focus is also afforded to the pathogenesis of systemic conditions, again, due to their influence on the patient as a whole.", "completed": false}, {"dept_code": "REHSCI", "id": "1265", "course_title": "PHARMACOLOGY IN REHABILITATION", "description": "This course serves as a foundation to general pharmacology, and begins with lectures on the general principles affecting drug response: drug absorption, distribution, metabolism and excretion. The major drug categories will then be discussed, with an emphasis on drug classification, mechanism of action, side effects (especially those that are predictable), and significant drug interactions. At the completion of this course, the student will be able to recognize and describe the action of prototype drugs in each major drug category, compare and contrast their action with other drugs in each category, and explain the role of those drugs in the mitigation, treatment, cure or prevention of disease in humans.", "completed": false}, {"dept_code": "REHSCI", "id": "1275", "course_title": "INTRO TO OCCUPATION SCIENCE", "description": "This course provides the foundation for understanding the role of activity and occupation in life-span human development by first considering human behavior in the absence of activity/occupation and then in the presence of activity/occupation. Consideration is given to the influence of inactivity and immobility on human systems (biologic, psychological and psychosocial) including knowledge of the disuse syndrome and the deleterious effects of living in stimulus deprived environments (such as nursing homes). The course also examines human behavior in the presence of activity/occupation including the role of movement and purposeful activity (occupation) as determinants of health.", "completed": false}, {"dept_code": "REHSCI", "id": "1280", "course_title": "PSYCH AND SOCLGY OF DISABILITY", "description": "Topics covered in this course include individual and societal views of persons with disabilities; both historical and current trends are discussed including disability rights legislation, independent living options, access to everyday living activities, education, employment, assistive technology, and the need for ongoing advocacy, as described by various guest speakers with disabilities.", "completed": false}, {"dept_code": "REHSCI", "id": "1290", "course_title": "PRACTICAL ISSUES IN DISABILITY", "description": "This course will review the natural progression of several age and non-age related physical disabilities such as Alzheimer's and Dementia, Parkinson's disease, CHF, COPD, DM, Spinal Cord injury, and Multiple Sclerosis (subject to change). When possible, individuals with disabilities are invited to participate in classroom discussions to share their first-hand experiences of living with a disability. This course will likely include an observational experience outside the classroom. This may include traveling to someone's home with a disability and/or their place of employment via public or a student's private mode of transportation. Additional details will be reviewed on the first day of class.", "completed": false}, {"dept_code": "REHSCI", "id": "1292", "course_title": "DIVERSITY AND CULTURAL ISSUES IN HEALTH, DISABILITY AND REHABILITATION", "description": "This course provides a forum for exploring issues of diversity and multiculturalism as they affect both daily interactions and professional practice in health care and rehabilitation. In this course students will build a greater understanding of: personal culture; how factors of culture and diversity influence an individual's health, living needs, and response to stress; international concepts of disability and health & rehabilitation services; and globalization and its relationship to rehabilitation. In addition, students will learn how to apply concepts of cross-cultural competence and intercultural communication to clinical services and program development.", "completed": false}], "links": [{"source": "1215", "target": "1216"}]}