{"nodes": [{"dept_code": "AFRCNA", "id": "0031", "course_title": "INTRODUCTION TO AFRICANA STUDIES", "description": "This is a survey course for Africana studies. An Afrocentric approach will be used to review the eight basic subject areas of the multidisciplinary focus; black history, black religion, black creative productions, black politics, black economics, black social organizations, black psychology and black education. Two alternative views will be pursued; a theoretical review of the literature and a summation of the practical experiences of black life.", "completed": false}, {"dept_code": "AFRCNA", "id": "0212", "course_title": "WEST AFRICAN DANCE", "description": "To pursue at an introductory level specific ethnic dance forms of West Africa.", "completed": false}, {"dept_code": "AFRCNA", "id": "0242", "course_title": "AFRICANA URBAN WOMAN", "description": "This course introduces students to literature by African American, Caribbean, and African women writers. Published within the last two decades, the novels in the course detail the lives of female protagonists who learn to adjust to family, educational, economic, and other social changes while navigating urban spaces. Using critical perspectives within Africana Studies, the course teaches students to examine and understand the cultural, historical and theoretical contexts surrounding the literary works. Students will also become more skilled in conducting detailed analyses of literary features, such as voice, language, structure and style, to better comprehend the characters¿ quest for self-fulfillment. In addition to closely reading the texts and providing thorough critiques, students will identify and assess the use of a wide range of real-life themes in the narratives, including structural inequality, immigration, motherhood, gender, identity, crime and violence, to further explore the insight that the readings offer on urban environments and lifestyles.", "completed": false}, {"dept_code": "AFRCNA", "id": "0454", "course_title": "MAN/WOMAN LITERATURE", "description": "Through prose and poetic works one will note how black men are viewed and characterized by female writers as well as how black women are treated by male writers. The basis for the difference lies in racial and sexual stereotyping in Afro-American literature.", "completed": false}, {"dept_code": "AFRCNA", "id": "0586", "course_title": "EARLY AFRICAN CIVILIZATIONS", "description": "The course surveys the emergence and growth of early African civilization from the beginnings of the evolution of the human race to the eve of the European colonization of the continent. It introduces students to the multiple disciplines contributing to knowledge about early Africa, and shows the centrality of Africa and Africans for humanity in general. Among the principal themes that the readings and discussions focus on are: pre-history of Africa and the genesis of humankind; the complexity of migration, and state formation; and African and European earlier contact. A fundamental approach will be to look at Africa from the inside out and to analyze African societies from the perspective of their internal development and reaction to external influences. Its basic goal is to promote, first, an appreciation of Africa's contributions to world civilization.", "completed": false}, {"dept_code": "AFRCNA", "id": "0639", "course_title": "HISTORY OF JAZZ", "description": "The course focuses on the chronological development of jazz from its beginnings on the plantation to its present state as a world concert music. Various styles such as ragtime, blues, gospel, spirituals, rhythm and blues, rock, soul, etc., Are examined.", "completed": false}, {"dept_code": "AFRCNA", "id": "0787", "course_title": "BLACK CONSCIOUSNESS", "description": "Introduction to the growing body of coherent cultural ideas and beliefs which provide a positive framework for study and interpretation of the black experience in North America. The course is pan-African in scope and context. One of the goals is to enable the student to view the African and the African-American struggles as part of the world struggle of human rights.", "completed": false}, {"dept_code": "AFRCNA", "id": "0805", "course_title": "BLACK PERFORMANCE AESTHETICS", "description": "By examining the behavior and customs of peoples throughout the world, the course considers what it means to be human. We will describe the patterns of marriage, family organization, warfare and political behavior, economic systems, rituals, etc., Of other peoples, especially those of tribal societies, and compare these with American social patterns. Anthropological films and slide presentations will supplement lectures.", "completed": false}, {"dept_code": "AFRCNA", "id": "1083", "course_title": "SPECIAL TOPICS: BLACK LIFE IN THE POST-INDUSTRIAL CITY", "description": "This course closely explores key demographic, political, economic, and cultural themes in African American life in post-industrial U.S. cities. It takes as its particular focus the persistence of urban residential segregation as a key structural lynchpin of American race relations and inequality. Relying on scholarly and historical sources and films, we will analyze the ways the racialization of urban space produces inequities in housing, employment, education, social welfare policy, policing, and redevelopment. We will also explore the complicated interplay of race, class, ethnicity, and gender in the transformation of black urban life in the late twentieth-century United States, and various expressive cultures and modes of resistance that have emerged out of the post-industrial urban context", "completed": false}, {"dept_code": "AFRCNA", "id": "1309", "course_title": "WOMEN OF AFRICAN AND AFRICAN DIASPORA", "description": "A cross-cultural study of women of African descent in West and southern Africa, the United States, brazil, and the Caribbean.", "completed": false}, {"dept_code": "AFRCNA", "id": "1331", "course_title": "AFRICAN LIBERATION MOVEMENTS", "description": "A course on the theories of revolution and national liberation struggles, decolonization and guerrilla warfare, and their special application to continental African experience since the end of World War II.", "completed": false}, {"dept_code": "AFRCNA", "id": "1353", "course_title": "COMPARATIVE DANCE EXPRESSION", "description": "This course will examine the cultural patterns of black dance styles and the similarities and differences in the motor behaviors among blacks in dance from South America, the Caribbean islands, Africa, and North America. Contents of the course will be introduced through films, lecture and videotapes.", "completed": false}, {"dept_code": "AFRCNA", "id": "1415", "course_title": "RELIGION AND RACE", "description": "This course examines the intersections of religion, race, and racism. Recently, scholars of religion have demonstrated that religious identities are often racialized as well. In this course, we will discover that religion and race are both modern categories rooted in post-enlightenment ideas about what it means to be human. We will see how the establishment of these religious and racial categories led to new hierarchies and inequalities. We will discuss how post-enlightenment thinkers linked religion and race, and how their ideas played a role in European imperialism. We will also investigate how the discipline of religious studies has developed its analytical tools with a racialized understanding of religion. The course will examine case studies in which religion has been racialized, and consider the political ramifications of these examples. In particular, we will think about the impact of white supremacy on black religion in the united states, the complicated relationship between antisemitism and Islamophobia, and contemporary Islamophobia in the US. Finally, we will explore the possibilities of anti-racism through faith-based scholarship and activism.", "completed": false}, {"dept_code": "AFRCNA", "id": "1510", "course_title": "HEALTH IN THE AFRICAN DIASPORA", "description": "", "completed": false}, {"dept_code": "AFRCNA", "id": "1522", "course_title": "SEX AND RACISM", "description": "Sex and racism affords an opportunity to explore sex, sexism, and racism, to examine the historical development and economic impact of racism in America, to analyze the conceptual framework, the research methods, and approaches from which past and current studies on sex, sexism racism, have been and are being developed. The course will also explore sex and racism as a multi-dimensional continuum, and solutions to sex and racism.", "completed": false}, {"dept_code": "AFRCNA", "id": "1535", "course_title": "DIMENSIONS OF RACISM", "description": "", "completed": false}, {"dept_code": "AFRCNA", "id": "1628", "course_title": "AFRO-LATINOS IN THE UNITED STATES", "description": "", "completed": false}, {"dept_code": "AFRCNA", "id": "1655", "course_title": "AFRICAN CINEMAS/SCREEN GRIOTS", "description": "Ousmane Sembene, known as the father of African cinema, popularized the notion of the African director as the modern day griot (oral historian) and traditional storyteller. Therefore, this course is an introduction to a cross-section of post-independence films (1963-2004) as an art form and as a visual space on socio-political, economic and cultural topics by screen griots from Burkina Faso, Cameroon, and chad, the democratic republic of the Congo, Ethiopia, Niger, Nigeria, Senegal, South Africa and Zimbabwe.", "completed": false}, {"dept_code": "AFRCNA", "id": "1768", "course_title": "AFRICANA SENIOR RESEARCH SEMINAR", "description": "This course will assist the student in conducting a research project of her choice. The student will select a topic, write a proposal including the statement of a question or hypothesis, a list of the goals and objectives. A design of the methodology and a review of the relevant literature.", "completed": false}], "links": []}