{"nodes": [{"dept_code": "BUSENV", "id": "0060", "course_title": "MANAGERIAL ETHICS AND STAKEHOLDER MANAGEMENT", "description": "Examines the social, political and legal interfaces between the business institution (especially the corporation) and the environment. Topics typically considered include ethical and value issues in business, the social responsibilities of business, business-government relations, and the management of stakeholder relationships and corporate social policy.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSENV", "id": "1755", "course_title": "SERVICE LEARNING IN ORGANIZATIONS", "description": "This course is designed around an experiential learning methodology that uses a service project for a community organization to enhance student understanding of a particular content area in leadership and ethics. Students will be challenged to immerse themselves in readings, essays and discussions in a specific content area that will be operationalized and reviewed throughout the duration of the community service project.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSENV", "id": "1757", "course_title": "RACE AND BUSINESS ETHICS", "description": "In what ways are corporations responsible for alleviating racial injustice? The Race and Business Ethics course is designed to give students the confidence and ability to address pressing social issues that are affecting corporate decision-making. Corporate leaders are making heavy investments in training and leadership programming to build a deeper understanding of racial injustice with the hope of bringing about a more fair and equitable society. The pressure on leaders to envision social issues as a part of corporate strategy comes from internal and external stakeholders and is consistent with the rise of important business movements that include sustainability and corporate social responsibility. Topics addressed in the course include African-American entrepreneurship, white racial identity, theories of justice, and structural racism, among others. Course assignments include a formal debate concerning front-page issues, leading a conversation about race via social media networks, and reading-based examinations. Students who take the course will be presented with readings, speeches, films, and other media that take a scholarly approach to the issue of race and the variety of ways it continues to exert its force on culture and commerce.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSENV", "id": "1760", "course_title": "BUSINESS LAW", "description": "Provides students with an exposure to the extensive laws and regulations that affect almost all major aspects of business operations. Topics covered are chosen on the basis of their importance to contemporary business.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSENV", "id": "1790", "course_title": "BUSINESS ENVIRONMENT INTERNSHIP", "description": "The business environment internship provides business credits for project assignments that augment a professional business environment work experience.", "completed": false, "prereq_count": 0}], "links": []}