{"nodes": [{"dept_code": "ECON", "id": "0100", "course_title": "INTRODUCTION TO MICROECONOMIC THEORY", "description": "Introduction to principles of economic analysis as applied to the study of prices and markets. The course builds a theoretical basis for understanding producer and consumer behavior, and prepares students to appreciate the importance of markets in our economic system.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "0110", "course_title": "INTRODUCTION TO MACROECONOMIC THEORY", "description": "An introductory course which develops the basic tools needed to analyze the behavior of various macroeconomic phenomena including inflation, gross domestic product, and unemployment. In addition, these tools are used to study how and whether the government can impact the behavior of the overall economy. Finally, the course looks at the role various institutions such as banks and the stock and bond markets play in affecting the economic environment.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "0150", "course_title": "ECONOMIC DATA ANALYSIS", "description": "An introduction to economic data and statistical concepts. Topics covered include: measures of location and dispersion and introduction to probablility theory; characteristics of probability distributions; sampling theory, point estimation and hypothesis testing. Correlation analysis and the linear regression model are treated with special emphasis placed on the construction, estimation, and interpretation of economic models. Emphasis is placed on understanding and using statistical concepts rather than on proving theorems.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "0200", "course_title": "GAME THEORY PRINCIPLES", "description": "This course introduces the basic concepts of game theory. The emphasis is on the unifying perspective that game theory offers to questions in economics, other disciplines, and everyday life. The course draws on a wide range of substantive and intellectually stimulating applications of game theory across areas in economics, other disciplines, and beyond. It will enable students to view social interactions as strategic games, to use game theoretic concepts to predict behavior in these interactions and to conceive of ways in which altering the game affects social outcomes.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "0280", "course_title": "MONEY AND BANKING", "description": "The course is directed toward giving the student an insight into the role that monetary policy and financial markets play in the economy. It will cover both the theoretical and institutional aspects of banking necessary to function successfully in the business world. One object of the course is to give the student the ability to analyze and appraise critically the monetary policy of federal reserve system.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "0290", "course_title": "FINANCIAL MARKETS AND INSTITUTIONS", "description": "This course will provide the student with a strong foundation in financial market analysis and the roles of non-bank financial institutions in the modern economy. The course covers financial markets such as debt markets, equity markets, and derivatives markets and non-bank financial institutions, including mutual funds, pension funds, securities firms, and insurance companies.", "completed": false, "prereq_count": 2}, {"dept_code": "ECON", "id": "0410", "course_title": "ECONOMICS OF DIVERSITY", "description": "This course aims to strengthen students' understanding of how race, class, gender, disability, ethnicity, nationality, culture, sexuality, religion, and age interact with public policies to influence various economic outcomes. We analyze the evolution of economic consequences on populations that have been historically disadvantaged. Specifically, we discuss how governments (especially the U.S. government) and societies deal with diversity and their level of discrimination vs inclusivity of different groups over time and across space.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "0460", "course_title": "SPORTS ECONOMICS", "description": "The objective of this course is for students to understand and apply the concepts of microeconomics that are relevnt for the business and practice of sports. Areas of study include labor economics, public economics, industrial organization, the economics of information, and the economics of sports betting markets. Examples of questions addressed within these fields include: how have owners in professional sports leagues coordinated to limit player salaries? How much are players worth, in an economic sense? What pricing strategies can teams employ to maximize profits?", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "0500", "course_title": "INTRODUCTION TO INTERNATIONAL ECONOMICS", "description": "Provides an introduction to international economics. Half the topics are pure theory, half international monetary economics. Topics from the real world are analyzed. Topics include alternative pure trade theories; effects of trade barriers; U.S. commercial policy; forms of regional integration; balance of payments; elimination of balance of payments disequilibrium; international monetary system.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "0530", "course_title": "INTRODUCTION TO DEVELOPMENT ECONOMICS", "description": "An introductory description and analysis of the economic systems of countries commonly referred to as less developed countries. Alternative development policies with respect to international trade, agriculture, industry, health, and education will be outlined. The roles played by government, population growth, environmental degradation, income distribution, and foreign aid will be discussed. The economic aspects of development will be stressed.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "0800", "course_title": "INTRODUCTION TO ECONOMICS", "description": "A one-term course designed primarily for the non-major. The main goals are to create interest in the study of economics and introduce some basic tools economists use to analyze social issues. Issues range from farm subsidies to changes in income tax rates to changes in spending on crime reduction.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "0900", "course_title": "PROFESSIONAL DEVELOPMENT FOR ECONOMISTS", "description": "In this course, students will 1) understand the range of career and advanced degree options for which their studies in Economics will make them eligible. 2) develop professional skills in presentation and communication. 3) maximize progress within the major by setting broader academic and career goals and exploring learning opportunities.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "1100", "course_title": "INTERMEDIATE MICROECONOMICS", "description": "An intermediate-level course in resource allocation theory emphasizing the origins and uses of theoretical reasoning in economic analysis. Topics covered include the methodology of economic analysis; theories of consumer behavior; demand and supply analysis; production theory; the theories of the firm and market behavior; income distribution theory; and general equilibrium theory.", "completed": false, "prereq_count": 2}, {"dept_code": "ECON", "id": "1110", "course_title": "INTERMEDIATE MACROECONOMICS", "description": "A systematic treatment of macroeconomic analysis including such topics as policy analysis, inflation-unemployment tradeoffs, business cycles, budget deficits, and the balance of payments.", "completed": false, "prereq_count": 2}, {"dept_code": "ECON", "id": "1150", "course_title": "APPLIED ECONOMETRICS 1", "description": "Introduces basic tools in applied econometrics that are commonly employed in government, business, and academic research. The main emphasis is on application of various econometric methods. Students are expected to become familiar with standard computer programs that are frequently used in quantitative economic research. Topics covered are a review of basic statistics, classical linear regression models, and associated inferential problems, and generalized linear regression models and associated inferential problems.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "1200", "course_title": "GAME THEORY", "description": "The aim of the course is to introduce the main elements of game theory, in a manner which emphasizes the connections between the \"cooperative\" and \"non-cooperative\" traditions. Students will be expected to develop understanding sufficient to construct proofs as well as to perform computations, and there will be emphasis on modelling issues.", "completed": false, "prereq_count": 0}, {"dept_code": "ECON", "id": "1440", "course_title": "ECONOMICS OF CORPORATION FINANCE", "description": "The course is intended as an analysis of the investment valuation and financing of the corporation. Attention will be focused on the application of economic theory to the solution of financial problems. The interrelations between investment and financing policies and their dependence on security valuations will be stressed. The institutional background necessary to analyze these problems will be examined, and practical cases drawn from personal and business situations will be used along with more theoretical materials.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "1540", "course_title": "ECONOMIC GROWTH: INNOVATION & POLICY", "description": "In this course, we will seek to understand both the causes and effects of long-term economic growth. We will study how industrial organization, intellectual property policy, education, knowledge diffusion, cultural and political institutions, international trade, productivity, health, welfare, and inequality impact economic growth. We will document the broad trends in growth and development in a global context, first historically, then with greater emphasis on the experience of the US in the 20th century and beyond. We will study a variety of models that have been proposed over the years to explain the observed facts.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "1700", "course_title": "CAPSTONE SEMINAR IN MICROECONOMICS", "description": "In this seminar, students will study in-depth a current topic in Economics. Their work will include a research paper or other culminating project which requires them to apply economic concepts and theories to analyze issues and situations in the real world.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "1710", "course_title": "CAPSTONE SEMINAR IN INTERNATIONAL ECONOMICS", "description": "In this seminar, students will study in-depth a current topic in International Economics. Their work will include a research paper or other culminating project which requires them to apply economic concepts and theories to analyze issues and situations in the real world.", "completed": false, "prereq_count": 2}, {"dept_code": "ECON", "id": "1720", "course_title": "CAPSTONE SEMINAR IN MACROECONOMICS", "description": "In this seminar, students will study in-depth a current topic in Economics. Their work will include a research paper or other culminating project which requires them to apply economic concepts and theories to analyze issues and situations in the real world.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "1910", "course_title": "SEMINAR IN CURRENT ECONOMIC RESEARCH", "description": "This course features research by Pitt faculty exploring the current frontier of a selected topic in economics. Students will learn to read and evaluate research papers in economics. Students will understand how research in the field builds on prior work and how multiple studies with different approaches, methods, data, and cases contribute to consensus in the field.", "completed": false, "prereq_count": 1}, {"dept_code": "ECON", "id": "1923", "course_title": "ECONOMIC RESEARCH & DATA SKILLS 3", "description": "This course teaches students hands-on skills for conducting and presenting economic research and data analysis. Topics vary each semester, reflecting current software and new techniques.", "completed": false, "prereq_count": 0}], "links": [{"source": "0100", "target": "0410"}, {"source": "0100", "target": "0460"}, {"source": "0100", "target": "0500"}, {"source": "0100", "target": "0530"}, {"source": "0100", "target": "1100"}, {"source": "0100", "target": "1110"}, {"source": "0110", "target": "0280"}, {"source": "0110", "target": "0290"}, {"source": "0110", "target": "1100"}, {"source": "0110", "target": "1110"}, {"source": "0150", "target": "0290"}, {"source": "1100", "target": "1440"}, {"source": "1100", "target": "1700"}, {"source": "1100", "target": "1710"}, {"source": "1100", "target": "1910"}, {"source": "1110", "target": "1540"}, {"source": "1110", "target": "1710"}, {"source": "1110", "target": "1720"}]}