{"nodes": [{"dept_code": "SOCWRK", "id": "1000", "course_title": "INTRODUCTION TO SOCIAL WORK", "description": "Explores social work in terms of what the profession seeks (its goals); what it does to achieve those goals (its direct practice methods); which principles are to be reflected in all professional social work activity (its values and ethics); how the profession evolved (its history); which social issues are of particular concern to social workers (its special mission re: poverty, racism, sexism, among others); what types of agencies/services involve professional social workers (its fields of practice); and how effective is professional social work (its evaluative systems). This is a service learning course and requires 45 hours of volunteer service as part of the course.", "completed": false}, {"dept_code": "SOCWRK", "id": "1006", "course_title": "POLICY ANALYSIS", "description": "Engages students in analyses of the nature and impact of economic/political/social ideologies and forces which shaped the development of American social welfare policies and services from 1935 to present, including policies/services related to personal and social services, health and mental health, income redistribution and income maintenance, employment, and criminal justice and including discussions of the processes of policymaking itself. This is a service learning course and requires 45 hours of volunteer service as part of the course.", "completed": false}, {"dept_code": "SOCWRK", "id": "1008", "course_title": "GENERALIST SOCIAL WORK PRACTICE WITH DIVERSE POPULATIONS", "description": "This course provides an understanding and working knowledge of the interface of ethnicity and race and the social welfare system. Critical ways in which the social welfare system has been shaped by ethnic and racial factors will be discussed, as well as the effects of race and ethnicity on the ways in which various ethnic and racial groups use the social welfare system, ways in which services/resources are allocated, and reasons that propel individuals and groups to seek out social services and resources.", "completed": false}, {"dept_code": "SOCWRK", "id": "1012", "course_title": "SOCIAL WORK WITH COMMUNITIES AND ORGANIZATIONS", "description": "This course introduces the student to macro practice through understanding and analyzing organizations and the relationship of organizations to the urban community. The focus is on the acquisition of practice skills in community organization, e.g. locality development, social planning, and social action.", "completed": false}, {"dept_code": "SOCWRK", "id": "1026", "course_title": "PRACTICUM SEMINAR AND LAB 2", "description": "The purpose of this course is to facilitate the student's development of a professional self through the integration of classroom and practicum learning and to provide students an opportunity to amplify their practice learning beyond their immediate placements as a result of guided interactional experiences with other students.", "completed": false}, {"dept_code": "SOCWRK", "id": "1027", "course_title": "PRACTICUM 2", "description": "A continuation of Practicum 1.", "completed": false}, {"dept_code": "SOCWRK", "id": "1035", "course_title": "GLOBAL PERSPECTIVES SOCIAL WORK", "description": "This course is designed to introduce students to the international dimensions of the human condition; the global context of responses to human need; and social development as an approach to global social work practice.", "completed": false}, {"dept_code": "SOCWRK", "id": "1040", "course_title": "POVERTY AND INCOME INEQUALITY: SOCIAL RESPONSES", "description": "The course focuses on the nature and extent of poverty and income inequality in the United States including its causes and consequences as well as the resulting political and public policy debates and governmental efforts to combat it. The course provides a broad social science approach to understanding the intersection of gender, race, and class with poverty and income inequality. Competing theories of poverty are discussed and their relationship to different polices are assessed. The course continues with the analysis of a range of social policy debates and reform options that might further reduce poverty and income inequality. The course concludes with a discussion about the nature of social and economic justice and the role social workers and professional social work currently play and could play in taking a social action role to addressing poverty and income inequality", "completed": false}, {"dept_code": "SOCWRK", "id": "1079", "course_title": "CHILD WELFARE SERVICES", "description": "Engages students in the study of child welfare, its historical roots, the services provided to families and children, the problems and policy issues in the current child welfare system and culturally competent practice. The study will focus on the etiology, rationale for service, and the current and future provision of services, with emphasis given to legislative mandates for service.", "completed": false}, {"dept_code": "SOCWRK", "id": "1080", "course_title": "BROWNE LEADERSHIP FELLOWS SEMINAR", "description": "This seminar engages students in a practice that will lead to their own professional growth and development. The primary focus of this seminar will be on the development of the knowledge, values, and skills of a professional. During seminars, browne fellows will begin program design and implementation strategies for the summer program. Fellows will have the opportunity to hear from experts in the field but spend significant time exploring the topics. The final assessment is focused on a presentation and poster session. Only students that have applied to and been accepted into the Browne Leadership Fellows program are eligible to enroll in this course.", "completed": false}], "links": [{"source": "1000", "target": "1006"}, {"source": "1000", "target": "1035"}, {"source": "1000", "target": "1079"}]}