{"nodes": [{"dept_code": "CHE", "id": "0200", "course_title": "CHEMICAL ENGINEERING THERMODYNAMICS", "description": "This course combines the ideas from both pure and multicomponent thermodynamics. It introduces molecular insight and the tools (including commercial software) for solving both simple and complex problems in phase and chemical equilibria. The course will have a strong focus on multiscale analysis, for example, covering intermolecular potentials (molecular-scale) to aid students in choosing equations of state for novel materials (macro-scale). Advanced topics covered include interfacial behavior, adsorption, and osmotic equilibrium.", "completed": false}, {"dept_code": "CHE", "id": "0201", "course_title": "CHE THERMODYNAMICS LABORATORY", "description": "Laboratory corresponding to CHE 0200.", "completed": false}, {"dept_code": "CHE", "id": "0214", "course_title": "INTRODUCTION TO CHEMICAL PRODUCT DESIGN", "description": "Traditionally, chemical product design has focused on a set procedure for product development from conception to development and testing and finally the launching of the product. Unfortunately, this model which does not keep in mind the values or needs of the customer has resulted in a high number of failures for new product launches. What skills are thus needed in order to be entrepreneurial and succeed in the development of new chemical products within industry today? This course examines the initial stages on how to approach chemical product design from an innovation perspective complete with the provision of the necessary technical skills to get the job done while placing an emphasis on the business and entrepreneurial skills required to be successful in the chemical product design business.", "completed": false}, {"dept_code": "CHE", "id": "0400", "course_title": "REACTIVE PROCESS ENGINEERING", "description": "This course integrates reactor design, reaction kinetics, and advanced separation processes to allow the comprehensive study of systems ranging from polymerization reactors to enzyme-catalyzed metabolism to (bio-) artificial organs. Coverage includes integrating multiple topics, such as chemistry, physics, biochemistry/medicine and reactor engineering. Furthermore, it addresses all length scales from the molecular level to the reactor level to the full systems level. Both theory and experiment will be highlighted and detailed simulations will be included.", "completed": false}, {"dept_code": "CHE", "id": "0401", "course_title": "REACTIVE PROCESS ENGINEERING LABORATORY", "description": "Laboratory corresponding to CHE 0400.", "completed": false}, {"dept_code": "CHE", "id": "0602", "course_title": "CHEMICAL ENGINEERING SAFETY AND ETHICS", "description": "This class will provide the student with a thorough understanding of the fundamentals in workplace health and safety with emphasis on chemical industry applications. This will be accomplished through presentation a discussion of critical issues as well as the application of these principles to the senior design project. This course will also cover ethical situations likely to arise in the chemical plant environment.", "completed": false}, {"dept_code": "CHE", "id": "0613", "course_title": "SYSTEM ENGINEERING 2: PROCESS DESIGN", "description": "This course integrates aspects of previous chemical engineering courses into the design of a complete chemical plant including the use of computer process simulation, pinch technology, and discounted cash flow economic analysis. The detailed design of chemical engineering units/processes is carried out for all aspects of the plant.", "completed": false}, {"dept_code": "CHE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "The departmental seminars are designed to acquaint the student with aspects of engineering which are normally not encountered in classes.", "completed": false}, {"dept_code": "CHE", "id": "1290", "course_title": "DIFFERENTIAL EQUATIONS IN CHEMICAL ENGINEERING", "description": "This class will present an introduction to ordinary differential equations, including Chemical Engineering context. Topics will include linear and nonlinear ordinary differential equations, Laplace transformation, and introduction to Fourier series. This course will balance analytical solution methods and the use of numerical solution tools (Matlab) and techniques to address a range of modeling and engineering problems arising in the context of Chemical Engineering.", "completed": false}, {"dept_code": "CHE", "id": "1533", "course_title": "CONTROLLED DRUG DELIVERY", "description": "This course will provide students with a basic understanding of the engineering of controlled drug delivery systems, which stands as a 114 billion dollar industry. To this end, we will focus on topics at the interface between engineering and medicine such as biomaterials, pharmacokinetics, polymer chemistry, reaction kinetics, and biological transport phenomena. Design of transdermal, aerosol, oral, bio-mems, gene delivery, and targeted cellular delivery, will be reviewed with emphasis being placed upon us FDA regulatory considerations and the relevant physiological milieu.", "completed": false}, {"dept_code": "CHE", "id": "1540", "course_title": "PRACTICAL ELECTROCHEMISTRY", "description": "This graduate-level elective focuses on the practice of electrochemistry in laboratory analysis and in a wide range of technological applications. We will begin with a brief overview of the fundamentals of electrochemistry in terms of thermodynamics, kinetics, and transport processes. We will then dive immediately into practical concepts with a survey of laboratory methods and technological/industrial applications of electrochemistry.", "completed": false}, {"dept_code": "CHE", "id": "1822", "course_title": "ADVANCED TOPICS IN CHEMICAL ENGINEERING", "description": "This course introduces the fundamentals of capillarity via canonical problems in surface tension and wetting phenomena. Topics include static wetting phenomena (e.g. contact angles, shapes of menisci and drops), dynamic phenomena in which viscosity plays a role (e.g. rupture of menisci, coating operations), and thermodynamics (e.g. capillary condensation, nucleation).", "completed": false}], "links": [{"source": "0200", "target": "0201"}, {"source": "0200", "target": "0400"}, {"source": "0400", "target": "0401"}]}