{"nodes": [{"dept_code": "ECE", "id": "0101", "course_title": "LINEAR CIRCUITS AND SYSTEMS", "description": "This course covers the fundamentals of linear electric circuit analysis used throughout the electrical and computer engineering curricula. Students learn basic concepts and terminology of electrical engineering and develop knowledge and skills to analyze, evaluate, and design electrical circuits in class and in an accompanying laboratory where they build prototyping and analysis skills using modern test equipment. Primary topics include electric variables and circuit elements, Kirchhoff's and Ohm's Laws, mesh and node equations, Thevenin and Norton equivalent circuits, first- and second-order circuits, time- and frequency-domain analyses, ideal transformers, and AC power. PREREQUISITES: PHYS 0175 and ENGR 0012 or ENGR 0016 COREQUISITE: ECE 0401", "completed": false}, {"dept_code": "ECE", "id": "0102", "course_title": "MICROELECTRONIC CIRCUITS", "description": "This course covers the fundamentals of microelectronic circuits,specifically operational amplifiers, diode and rectifier circuits, analysis and design of MOS field-effect transistor and bipolar-junction transistor amplifiers, and CMOS digital-logic circuits. In this course, the students will integrate their knowledge of linear circuits and will learn how to analyze, evaluate, and design electronic circuits. This course includes a laboratory section in which the students will gain prototyping, design, and testing skills using conventional equipment.", "completed": false}, {"dept_code": "ECE", "id": "0111", "course_title": "LINEAR CIRCUITS TRANSFER LAB", "description": "Linear Circuits Transfer Lab", "completed": false}, {"dept_code": "ECE", "id": "0112", "course_title": "MICROELECTRONIC CIRCUITS TRANSFER LAB", "description": "Laboratory section of Microelectronic Circuits for transfer students", "completed": false}, {"dept_code": "ECE", "id": "0201", "course_title": "DIGITAL CIRCUITS AND SYSTEMS", "description": "In this course, students study the fundamental building blocks used in the design of modern digital electronics and computers. Students learn how to use and combine digital components to create circuits that perform fundamental computing tasks such as arithmetic and storage of information. Primary topics covered include Boolean algebra and binary arithmetic, combinational and sequential logic circuits, Finite-State Machine (FSM), Hardware Design Language (HDL), and Register Transfer Level (RTL) for digital design. Students extend their knowledge to practice by way of hands-on laboratory exercises where various software and hardware tools are used to design and test solutions for real-world applications. After completing this course, students understand the design of digital computing systems at their most fundamental level and are able to craft such systems using modern tools and techniques.", "completed": false}, {"dept_code": "ECE", "id": "0202", "course_title": "EMBEDDED PROCESSORS AND INTERFACING", "description": "This course covers the fundamentals of embedded processors and interfacing, including microprocessor structure and instruction sets, programming using C and assembly languages, memory and peripherals, interfacing, and embedded system design. Detailed studies of microprocessor I/O and interrupt techniques as applied to analog-to-digital, digital-to-analog, timers, and parallel and serial interfaces are also included. Laboratory activities provide the student with experience in developing and testing the hardware and software required to incorporate embedded computers into systems that solve real-world problems.", "completed": false}, {"dept_code": "ECE", "id": "0211", "course_title": "DIGITAL CIRCUITS AND SYSTEMS CREDIT LAB", "description": "Digital Circuits and Systems Credit lab for transfer students. Associated with ECE 0201.", "completed": false}, {"dept_code": "ECE", "id": "0212", "course_title": "EMBEDDED PROCESSORS AND INTERFACING CREDIT LAB", "description": "Embedded Processors and Interfacing Credit Lab for transfer students. Associated with ECE 0202.", "completed": false}, {"dept_code": "ECE", "id": "0301", "course_title": "ECE PROBLEM SOLVING WITH C++", "description": "This course covers fundamental concepts and techniques in software design for solving problems in electrical and computer engineering (ECE) using C++. Students learn procedural and object-oriented program development, as well as basic control structures, data structures, and algorithms. Students apply these skills in crafting and testing structured programs to solve problems of interest in ECE, such as linear circuits and systems, digital circuits and systems, and linear algebra and differential equations, through assignments that are tied to concepts covered in these other core sophomore courses of ECE.", "completed": false}, {"dept_code": "ECE", "id": "0302", "course_title": "DATA STRUCTURES AND ALGORITHMS", "description": "This course covers the fundamentals of data structures and algorithms. Topics include stacks, queues, trees, lists, heaps, and other widely used abstract data types. Students will learn how to implement these data structures using C++ and techniques for analyzing algorithms that contain them. Advanced applications of recursion, sorting, and searching algorithms and other algorithms that incorporate data structures will also be discussed. This course will also introduce topics in parallel computing, and students will learn how to solve problems using modern application programmer interfaces (API) for parallel programming.", "completed": false}, {"dept_code": "ECE", "id": "0401", "course_title": "ECE ANALYTICAL METHODS", "description": "This course provides the fundamental mathematical background to solve problems in electrical and computer engineering (ECE). The main objective is to cover topics from calculus, linear algebra, differential equations, and complex analysis most relevant to electrical and computer engineering. Primary topics include matrices, vectors, systems of equations, determinants, double integrals, first- and second-order ordinary differential equations, complex numbers, Eulers identity, phasor analysis, signal waveforms, Laplace transform, transfer functions, frequency response, and an introduction to the Fourier transform. Students also learn to solve mathematical problems based upon these topics, both analytically and using the MATLAB programming environment.", "completed": false}, {"dept_code": "ECE", "id": "0402", "course_title": "SIGNALS, SYSTEMS, & PROBABILITY", "description": "This is an introductory course covering the mathematical modeling and analysis of signals and input-output systems, probability and statistics, with an emphasis on ECE applications of these concepts. The signal-processing portion builds on existing knowledge of ordinary differential equations and Laplace transforms, to a complete treatment of continuous-time signals and systems, especially linear time-invariant systems, in the time and frequency domains. The latter portion of the course covers basic concepts in probability, including discrete and continuous random variables, probability density and mass functions, computation of expected values, conditional probability densities, as well as an introduction to hypothesis testing and statistical analysis.", "completed": false}, {"dept_code": "ECE", "id": "1110", "course_title": "COMPUTER ORGANIZATION AND ARCHITECTURE", "description": "This course provides a detailed introduction into the basics of computer design common to most computer architectures including topics of digital computer data representation, arithmetic and logic units, instruction formats, control, microprocessor architecture, and memory systems. This course includes a heavy focus on assembly language and its interaction with a RISC computer architecture.", "completed": false}, {"dept_code": "ECE", "id": "1140", "course_title": "SYSTEMS AND PROJECT ENGINEERING", "description": "This course covers system and software engineering processes, tools, and common practices through lectures and labs. Both the waterfall model and agile methods, specifically Extreme Programming and Scrum, are presented and used in developing a term-long group project. Students experience firsthand each of the concepts covered throughout the term by specifying, designing, and building an integrated working hardware/software system with equal contribution from each of the 5 or 6 team members. During the group project, full lifecycle documentation is created, UML is used for designing the system and a fully working system is developed, tested, and publicly presented. During the course students will use an IDE, UML, code repository, defect tracking, testing, scheduling, and documentation tools.", "completed": false}, {"dept_code": "ECE", "id": "1150", "course_title": "COMPUTER NETWORKS", "description": "The course covers a theoretical understanding of technology involving, as well as problem solving skills for, interconnected devices where potential methods of interconnection are fundamental to the system design. Fundamentals related to wireless network systems and networks of computers or embedded digital devices, especially the lower levels of the stack, are emphasized. Coverage includes data link protocols, medium access control, addressing, routing, and transport protocols.", "completed": false}, {"dept_code": "ECE", "id": "1155", "course_title": "INFORMATION SECURITY", "description": "This course is an introduction to information security at the computer system level, the network level, and the human level. Students will first learn general computer security technology and principles such as cryptographic tools, user authentication, access control, malicious software and attacks, and defending techniques. Then, we will delve into the details of software and system security, including buffer overflow vulnerability, operating system security, and Cloud and Internet-of-Things (IoT) security. The latter units of the course cover cryptographic and message authentication algorithms and their application in security network protocols, as well as human factors and legal and ethical issues.", "completed": false}, {"dept_code": "ECE", "id": "1170", "course_title": "SPECIAL TOPICS: COMPUTER", "description": "An undergraduate course dealing with special topics of current interest in computers.", "completed": false}, {"dept_code": "ECE", "id": "1175", "course_title": "EMBEDDED SYSTEMS DESIGN", "description": "This course introduces the fundamental challenges, methodologies, and techniques for designing different components of embedded computing systems, including microprocessors, I/O, memory and caches, and external sensors and actuators. Various system design issues including power management, real-time operating system design and system scheduling will also be discussed. Laboratory activities provide the students with the opportunities of gaining hands-on project experiences with modern embedded and mobile computing platforms such as microcontrollers, smartphones, sensors and wearables, as well as practicing these programming platforms over real-world embedded computing applications.", "completed": false}, {"dept_code": "ECE", "id": "1180", "course_title": "COMPUTATIONAL MODELING AND SIMULATION FOR ENGINEERS", "description": "In this course students will develop several software programs to model and simulate a range of different physical systems. The course will focus on building software simulations of systems in terms of underlying model objects, world representations, interactions between objects, and a variety of models for time. Some experience in c/c++ programming is assumed.", "completed": false}, {"dept_code": "ECE", "id": "1188", "course_title": "CYBER-PHYSICAL SYSTEMS", "description": "The arrival of the internet-of-things (IOT) has brought about a world where the everyday objects we interact with, ranging from health monitoring devices to appliances and automobiles, are embedded with intelligence, the ability to communicate over a network and act on information stored in the \"cloud\". In this intensive laboratory course, students, by way of a series of projects, follow the journey data takes from a sensor, to a microcontroller, through a network and then to the cloud (and back!). Along the way students are exposed to a broad range of electrical and computer engineering topics including electronic design, embedded programming, digital signal processing, networking and information theory, wireless communications, antenna theory and big data analytics.", "completed": false}, {"dept_code": "ECE", "id": "1195", "course_title": "ADVANCED DIGITAL DESIGN", "description": "This course is designed to teach both the theoretical and practical considerations in the design of computing systems. It introduces the students to modern computer aided design (CAD) tools, languages, and techniques. The student is exposed to a variety of design experiences that complement their knowledge of digital circuits and microprocessors. Students will complete a series of laboratory assignments and learn how to implement large-scale, complex digital systems with commercial CAD tools. Designs will be prototyped using Field Programmable Gate Arrays (FPGA) and verified using electronic test equipment.", "completed": false}, {"dept_code": "ECE", "id": "1212", "course_title": "ELECTRONIC CIRCUIT DESIGN LAB", "description": "An electronic circuits laboratory experience with emphasis on circuit applications and design. Topics include: multi stage amplifier design; operational amplifier applications; analog-digital conversion applications, active filters.", "completed": false}, {"dept_code": "ECE", "id": "1232", "course_title": "INTRO LASERS & OPTCL ELECTNC", "description": "Introduction to and applications of basic laser and optical electronic principles; optical modulation and detection systems.", "completed": false}, {"dept_code": "ECE", "id": "1247", "course_title": "SEMICONDUCTOR DEVICE THEORY", "description": "Electrical properties of solids, energy levels, semiconductor theory, diodes, bipolar junction transistors, field effect transistors.", "completed": false}, {"dept_code": "ECE", "id": "1251", "course_title": "MICRO AND NANO DEVICE FABRICATION LABORATORY", "description": "Micro/Nano fabrication area in science and engineering has already produced remarkable results in understanding and controlling matter and is expected to make a tremendous impact on electronics and society by facilitating breakthroughs for tomorrow's electronic devices. Micro and Nano Device Laboratory will introduce students to device fabrication and design methodology for fundamental fabrication processes. In addition, this course will provide an understanding of the scientific and technical aspects of microtechnology/nanotechnology and will enable students to contribute to this rapidly developing new technology field. This course comprises laboratory work and accompanying lectures that cover cleanroom introduction, wafer cleaning, silicon oxidation, mask design, photolithography, thin film deposition, wet and dry etching, and other nanofabrication processes. This elective course is designed for junior and senior level undergraduate students.", "completed": false}, {"dept_code": "ECE", "id": "1259", "course_title": "ELECTROMAGNETICS", "description": "Vector calculus, gradient curl, divergence theorem and stokes' theorem, coulomb's law gauss's law, Laplace equation, poisson equation, dielectrics, BIOT-Savart Law, vector potentials, ampere's law, faraday's law, inductance, magnetic materials, Lorentz force, Maxwell's equation, electromagnetic radiation.", "completed": false}, {"dept_code": "ECE", "id": "1270", "course_title": "SPECIAL TOPICS: ROBOTICS STUDIO", "description": "An undergraduate course dealing with special topics of current interest in electronic devices, lasers, and optical electronics.", "completed": false}, {"dept_code": "ECE", "id": "1395", "course_title": "INTRODUCTION TO MACHINE LEARNING", "description": "Machine Learning methods are at the core of many recent advances in \"intelligent computing\". Current applications include machine perception (vision, speech recognition), control (process control, robotics), data mining, time-series prediction (e.g. in finance), natural language processing, text mining and text classification, bio-informatics, neural modeling, computational models of biological processes, and many other areas. This is an introductory undergraduate course on machine learning and its applications in different areas. The course will briefly cover techniques for visualizing and analyzing multi-dimensional data along with algorithms for projection, dimensionality reduction, regression, clustering, classification and neural networks, and deep learning. A main course objective is to present various approaches to classifier design so that students can make judicious choices when confronted with real pattern recognition problems. However, it is important to emphasize that the design of a complete pattern recognition system for a specific application domain requires domain knowledge, which is beyond the scope of this course. Students will use available tools and libraries to implement some algorithms using MATLAB.", "completed": false}, {"dept_code": "ECE", "id": "1473", "course_title": "DIGITAL COMMUNICATION SYSTEMS", "description": "Analysis of modern digital communications systems, including the theory underlying their design and practical implementation issues. Baseband digital signaling: pam, PCM, quantization, ISI, multiplexing. Modulation formats: ask, FSK, BPSK, DPSK, GAM. Probability, information channel capacity random signals, optimal receivers and performance analysis. Case studies include modems, satellite systems, and cellular telephone.", "completed": false}, {"dept_code": "ECE", "id": "1560", "course_title": "DIGITAL SIGNAL PROCESSING", "description": "This course provides students with theoretical background and practical experience in data acquisition and digital signal processing related to computer-based measurements. The course addresses the representation, analysis, and design of discrete time signals and systems. Topics covered include implementation of discrete systems, discrete-time Fourier analysis and the FFT algorithm, analysis of discrete systems in terms of poles and zeros, and design of infinite and finite impulse response filters.", "completed": false}, {"dept_code": "ECE", "id": "1562", "course_title": "DIGITAL AND ANALOG FILTERS", "description": "Active filter design; operational amplifier circuits; cascade design with first-order and biquad circuits; Butterworth and Chebyshev low pass filters; sensitivity and frequency transformations. Digital filter design; IIR filter design using bilinear transformation; window design of fir filters; realization of IRR and fir filters.", "completed": false}, {"dept_code": "ECE", "id": "1673", "course_title": "LINEAR CONTROL SYSTEMS", "description": "Introduction to feedback control systems, mathematical models, second order systems response and identification, system types, steady-state errors, root locus analysis and design, bode plots, nyquist theory and frequency domain compensation techniques. Includes a laboratory.", "completed": false}, {"dept_code": "ECE", "id": "1675", "course_title": "ROBOTIC CONTROL", "description": "This course focuses on the application of control theory in robotics. Topics to be covered include: review of classical and modern control design methods such as PID control, state feedback, optimal control, adaptive control, and hybrid system control; control of mobile robots; control of robot manipulators; reinforcement learning; cognitive robotics.", "completed": false}, {"dept_code": "ECE", "id": "1701", "course_title": "FUNDAMENTALS OF ELECTRIC POWER ENGINEERING", "description": "This is a first course in electric power engineering for electrical and computer engineers. The course provides the fundamental background to solve some common problems in electric power engineering, and to design power systems using engineering assumptions based on this background. The main objective is to cover topics in AC single phase and three phase power, transformers, transmission lines and electric machinery by integrating their knowledge of linear circuit analysis, electricity, and magnetism to these power systems topics. Students will also gain knowledge of power systems simulation using the PowerWorld simulator. This course will provide the prerequisite knowledge for the study of load flow, symmetrical components, and fault analysis which will be covered in a later course.", "completed": false}, {"dept_code": "ECE", "id": "1750", "course_title": "POWER ELECTRONICS CONVERSION THEORY", "description": "Analysis of power electronic circuits. Converter concepts, models and metrics. Rectifiers. DC-DC converters. Inverters. Thermal and reliable design. Control and applications, e.g. photovoltaic and motor drives.", "completed": false}, {"dept_code": "ECE", "id": "1770", "course_title": "SPECIAL TOPICS: ELECTRONIC MICROPROCESSOR SYSTEMS", "description": "An undergraduate course dealing with special topics of current interest in power.", "completed": false}, {"dept_code": "ECE", "id": "1773", "course_title": "POWER GENERATION, OPERATION, AND CONTROL", "description": "Area control error (ace), automatic generation control (AGC), characteristics of power generation units, economic dispatch of generators, unit commitment, hydrothermal coordination and storage, interchange power, limited energy supply, optimal power flow, power system security, production cost modeling, state estimation, transmission system effects, unit commitment.", "completed": false}, {"dept_code": "ECE", "id": "1774", "course_title": "ADVANCED POWER SYSTEMS ANALYSIS", "description": "Steady state phenomena, matrix transformations, system parameters, system unbalances, digital methods, and numerical analysis techniques applied to load flow, state estimators, and fault studies in the large power systems.", "completed": false}, {"dept_code": "ECE", "id": "1775", "course_title": "POWER QUALITY", "description": "An introductory power systems laboratory course providing hands-on experience covering various electric power topics. The course will be conducted in the Electric Power Systems Laboratory and will include lectures, analytical and simulation assignments, and laboratory procedures. Topics include: familiarization with lab equipment and safety, power system equipment, power conversion equipment, and electric machinery.", "completed": false}, {"dept_code": "ECE", "id": "1885", "course_title": "DEPARTMENTAL SEMINAR", "description": "Seminars are designed to acquaint the student with aspects of engineering that are not normally encountered in classes and school activities and include a wide range of topics such as the significance of engineering as a profession, and ethical problems in engineering and skills required for a successful engineering career.", "completed": false}, {"dept_code": "ECE", "id": "1890", "course_title": "ECE PROTOTYPING FUNDAMENTALS", "description": "In this course students will learn fundamental prototyping techniques used in the design of electronic systems. This includes Printed-Circuit Board (PCB) Design, soldering, manufacturing and various other hands-on skills. The learning objective of this course is to prepare students with practical skills that are often needed in design-oriented electrical and computer engineering courses and projects.", "completed": false}, {"dept_code": "ECE", "id": "1895", "course_title": "JUNIOR DESIGN FUNDAMENTALS", "description": "This course teaches students the engineering design process. Emphasis is placed on the development of fundamental hands-on-skills commonly used in the design of modern electrical and computer engineering technologies. Students participate in a series of mock design experiences, culminating in the participation of an actual design project. After completion of this course, students will be able to design a system that meets specifications and satisfies a stakeholder's needs and requirements. Students will also learn how to create functional design prototypes and verify them.", "completed": false}, {"dept_code": "ECE", "id": "1896", "course_title": "SENIOR DESIGN PROJECT", "description": "This is a rigorous, capstone design course where students apply the analytical and synthesis skills they have developed during undergraduate coursework to the design of a working prototype. Students work in teams to identify and analyze a real problem, design a hardware/software solution, and construct, test and then evaluate the effectiveness of the prototype. The primary goal of this course is to provide students with a culminating, major design experience that incorporates engineering standards and realistic constraints, preparing them for professional engineering practice.", "completed": false}], "links": [{"source": "0101", "target": "0102"}, {"source": "0101", "target": "1232"}, {"source": "0102", "target": "1212"}, {"source": "0102", "target": "1701"}, {"source": "0102", "target": "1750"}, {"source": "0102", "target": "1895"}, {"source": "0201", "target": "0202"}, {"source": "0202", "target": "1110"}, {"source": "0202", "target": "1140"}, {"source": "0202", "target": "1155"}, {"source": "0202", "target": "1175"}, {"source": "0202", "target": "1188"}, {"source": "0202", "target": "1195"}, {"source": "0202", "target": "1270"}, {"source": "0202", "target": "1895"}, {"source": "0301", "target": "0302"}, {"source": "0301", "target": "1395"}, {"source": "0302", "target": "1140"}, {"source": "0302", "target": "1170"}, {"source": "0302", "target": "1180"}, {"source": "0302", "target": "1188"}, {"source": "0302", "target": "1270"}, {"source": "0302", "target": "1770"}, {"source": "0302", "target": "1895"}, {"source": "0401", "target": "0402"}, {"source": "0401", "target": "1259"}, {"source": "0402", "target": "1212"}, {"source": "0402", "target": "1247"}, {"source": "0402", "target": "1395"}, {"source": "0402", "target": "1473"}, {"source": "0402", "target": "1560"}, {"source": "0402", "target": "1562"}, {"source": "0402", "target": "1673"}, {"source": "0402", "target": "1775"}, {"source": "0402", "target": "1895"}, {"source": "1701", "target": "1773"}, {"source": "1701", "target": "1774"}, {"source": "1895", "target": "1896"}]}