{"nodes": [{"dept_code": "BUSORG", "id": "1020", "course_title": "ORGANIZATIONAL BEHAVIOR", "description": "Provides an overview of topics and concepts in the field of organizational behavior. Emphasis is on developing a theoretical grasp of issues and problems as well as an understanding of the practical implications of various theories of human behavior at work. Specific topics include leadership, motivation, teamwork, career issues, work roles, job enrichment, employee participation, and work and non-work integration.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSORG", "id": "1101", "course_title": "FUNDAMENTALS OF BUSINESS COMMUNICTION", "description": "Provides conceptual foundations and training in key communication skills essential for a business professional's effectiveness. Develops skills in oral presentation, interpersonal communication, and communication in teams as applied in business settings.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSORG", "id": "1645", "course_title": "CORPORATE ENTREPRENEURSHIP", "description": "The course concentrates around the question: how do companies strategically manage technology & innovation? The goal is to provide theories and methodologies relevant to the management of innovation which will help achieve a sustainable competitive advantage for firms. Students will have to apply ideas, concepts, tools, and frameworks introduced in the course to real world cases. They will be challenged to develop and defend their opinions in matters that are not always straightforward.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSORG", "id": "1655", "course_title": "INTERNATIONAL DIMENSIONS OF ORGANIZATIONAL BEHAVIOR", "description": "Provides an introduction to organizational behavior in a global context. Emphasis is on applying core organizational behavior concepts such as leadership, motivation, and group processes, as well as more contemporary topics such as cultural diversity and expatriation to workers in Europe, Asia, and the Americas. Develops an understanding of culture and cross-cultural differences and an awareness of the key skills needed to interact effectively in cross-cultural settings.", "completed": false, "prereq_count": 1}], "links": [{"source": "1020", "target": "1655"}]}