{"nodes": [{"dept_code": "NUTR", "id": "1006", "course_title": "INTRO TO HUMAN NUTRITION", "description": "This course will cover an overview of the scientific principles of nutrition and application of these principles to humans throughout the life cycle. Major focuses of the course are the classification and function of the six major nutrients, review of current nutrition standards, safety of the food supply, and nutrition misinformation.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1604", "course_title": "FOOD SERVICE MANAGEMENT WITH LAB", "description": "This course presents the basic principles and skills of food service", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1605", "course_title": "PRINCIPLES OF NUTRITION EDUCATION", "description": "Concepts and components of the teaching-learning process and their application in the dietetics practice. Experience in the instructional planning and implementation functions of clinical dietitians is emphasized.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1610", "course_title": "FOOD APPLICATION", "description": "This is an introductory course emphasizing the chemical and physical properties of food in relation to its selection, quality, and preparation. Experience in the construction, modification and preparation of recipes to meet various dietary needs is also provided.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1612", "course_title": "FOOD AND CULTURE", "description": "Introduction to ethnic influence on the diversity of American food patterns. Social, cultural, economic, geographic, and religious factors are considered.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1613", "course_title": "FOOD APPLICATION LAB", "description": "Study of the chemical and physical changes that occur in food as a result of various food preparation methods and their effects on nutrient quality. Experience in the construction, modification and preparation of recipes to meet various dietary needs is also provided.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1614", "course_title": "NUTRITION CRITICAL THINKING", "description": "An application of critical thinking skills to evaluate nutrition issues.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1625", "course_title": "NUTRITION THERAPY", "description": "This course will provide an introduction to medical nutrition therapy in the prevention and treatment of disease. The course will cover the nutrition implications, nutrition assessment process, and nutrition interventions for specific diseases. Teaching approaches for the course include lectures, assigned readings, in-class discussions, and problem-based learning through simulation/case studies.", "completed": false, "prereq_count": 0}, {"dept_code": "NUTR", "id": "1628", "course_title": "PRACTICAL EXPERIENCE", "description": "Supervised practical experience providing students with the oppertunity to gain real world experience related to nutrition science. This course is for Nutrition Science students only.", "completed": false, "prereq_count": 0}], "links": []}