{"nodes": [{"dept_code": "CLASS", "id": "0010", "course_title": "GREEK CIVILIZATION", "description": "A general introduction to the culture and society of Ancient Greece, with emphasis on the Archaic Period and the fifth and fourth centuries B.C.", "completed": false}, {"dept_code": "CLASS", "id": "0020", "course_title": "ROMAN CIVILIZATION", "description": "A general introduction to the culture and society of the Roman world, with emphasis on the period of the republic and the early empire.", "completed": false}, {"dept_code": "CLASS", "id": "0030", "course_title": "MYTHOLOGY IN THE ANCIENT WORLD", "description": "This course examines in cultural context the traditional stories--myth, legend, and folktale--of the ancient Greeks and Romans. Theories drawn from various disciplines are critically evaluated. Attention to connections with ritual practice and to expression in daily life, art, architecture, etc.", "completed": false}, {"dept_code": "CLASS", "id": "0330", "course_title": "MYTH AND SCIENCE", "description": "The Greeks in the sixth to fourth century B.C. Initiated forms of thinking we have from then on called \"scientific\" and \"philosophical\". This course examines the question of how science is distinguished from \"non-science\" by studying the role of myth and science in ancient Greece. The aim is to understand what distinguishes the ideas of the first scientists and philosophers from those earlier beliefs called myth.", "completed": false}, {"dept_code": "CLASS", "id": "0600", "course_title": "INTRODUCTION TO MEDITERRANEAN ARCHAEOLOGY", "description": "", "completed": false}, {"dept_code": "CLASS", "id": "0700", "course_title": "ENVIRONMENTAL CLASSICS", "description": "The ongoing degradation and destruction of our natural environment, driven to a large extent by human factors, is often defined in terms of the loss of biodiversity, the collapse of ecosystems, and climate change. This course will focus on the attitudes and views espoused by human agents that led to these phenomena. We will study the history of human relationships with the natural environment in antiquity (ca. 2800 BCE- 400CE) to ask how we may usefully approach ancient thinkers and ideas in a way that allows us to gain a thorough understanding of our present situation, and to evaluate contemporary perspectives and strategies. Ancient readers of King Gilgamesh's conquest of nature, of the Old and New Testament, and of the various treatises, poems, and stories by Greek and Roman writers like Plato, Aristotle, Pliny, and Virgil, could not have envisaged the scale of human impact on the earth in the twenty-first century. Nevertheless, they were acutely aware that they existed as a part of an ecological system. Trying to make sense of the environment in which they found themselves led to broader questions about our human identity and its role in the natural world. We find in the writings of ancient thinkers many questions that are resurfacing in the current debate on environmental ethics: To what extend does true human flourishing require the consumption of material resources? Should a sense of community extend to the land in which we live? What happens if we envisage our natural environment as an independent moral agent? Are we justified in controlling and dominating parts of our environment, or specific types of living creatures? What are the connections between the well-being of the land and social justice? We will examine these questions against their historical background and explore strategies to negotiate current perspectives in a meaningful way.", "completed": false}, {"dept_code": "CLASS", "id": "1050", "course_title": "COMPUTER METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct the text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}, {"dept_code": "CLASS", "id": "1130", "course_title": "CLASSICAL MYTHOLOGY AND LITERATURE", "description": "This course examines how authors of classical antiquity used the traditional figures and stories of their culture's mythology as material for works of literature.", "completed": false}, {"dept_code": "CLASS", "id": "1142", "course_title": "ANCIENT EPIC", "description": "Study of selected Greek and Roman epics in English translation. Among the works that may be read are Homer's Iliad and Odyssey, Apollonius' Argonautica, Virgil's Aeneid, and Ovid's metamorphoses.", "completed": false}, {"dept_code": "CLASS", "id": "1210", "course_title": "GREEK HISTORY", "description": "A survey of the history of ancient Greece, with special emphasis on political and social developments during the fifth century B.C.", "completed": false}, {"dept_code": "CLASS", "id": "1216", "course_title": "ALEXANDER AND THE HELLENISTIC AGE", "description": "This course deals both with the career of Alexander the Great and with political, social, and intellectual developments in the several successor states into which Alexander's empire dissolved after his death.", "completed": false}, {"dept_code": "CLASS", "id": "1220", "course_title": "ROMAN HISTORY", "description": "A survey of the history of Rome from the earliest times through the late empire, with particular emphasis on political and social developments during the late republic and early empire.", "completed": false}, {"dept_code": "CLASS", "id": "1240", "course_title": "FROM PANDORA TO PSYCHOPATHY: CONCEPTIONS OF EVIL FROM ANTIQUITY TO THE PRESENT", "description": "This lecture course introduces students to the ways in which humanity has struggled to comprehend and explain the existence of evil. The focus lies not on natural evils (such as earthquakes and epidemics) but on moral evil: Why are human beings at time so manifestly wicked? In this course we will look at the many theories and explanations given by poets, philosophers, and theologians over the course of our intellectual history and critically examine their explanatory value as well as their unintended consequences. The course is highly interdisciplinary. It will take into account the literature of various periods, beginning from early bronze age to the 21st century, but also invite students to engage with texts from such different genres as poetry, ancient and modern philosophy, theology, and modern psychology. The aim of the class is to empower students better to evaluate and critique facile contemporary views and prejudices concerning the nature and origin of moral evil.", "completed": false}, {"dept_code": "CLASS", "id": "1314", "course_title": "ARISTOTLE", "description": "This course will examine the basic concepts of Aristotle's metaphysics, physics, ethics, and logic.", "completed": false}, {"dept_code": "CLASS", "id": "1432", "course_title": "VARIETIES OF EARLY CHRISTIANITY", "description": "An examination of the diverse strands of Christianity as developed both in the Christian bible and outside of it.", "completed": false}, {"dept_code": "CLASS", "id": "1524", "course_title": "ROMAN ARCHITECTURE", "description": "The course will examine the development of Roman architecture from its origins in Etruria and central Italy to the middle empire (ca. 150 A.D.). Special attention will be given to the relationship of architectural forms, types and functions to changes in Roman politics and society and the significance of materials and outside influences on the development of local Italian traditions and forms. The interaction between roman architectural forms and local traditions in the provinces to create a Roman imperial \"koine\", will be treated only in passing.", "completed": false}, {"dept_code": "CLASS", "id": "1640", "course_title": "THINK LIKE A ROMAN", "description": "The course explores the ancient world through the lens of cognition, examining a variety of socio-historical topics, like emotion, spatial and temporal perception, color cognition, and memory and mnemotechnics, as viewed through ancient literature and modern research in cognitive psychology. Through written assignments and group discussion, students practice interpreting psychological research and Classics scholarship that looks at ancient texts through the lens of cognitive science. In addition to studying ancient cognition, students reflect on their own learning, while engaging with research on metacognition to develop evidence-based practices for improving their writing and study habits. This course is designated as a Writing Intensive course, and students will conduct an independent research project that applies cognitive methods to ancient literature, history, or art.", "completed": false}, {"dept_code": "CLASS", "id": "1650", "course_title": "WARFARE: ANCIENT MEDITERRANEAN", "description": "Since the dawn of civilization, warfare has been a constant threat to society. Although the material remains of ancient warfare survive in the archaeological record, the literary accounts of Greco-Roman authors provide us with additional evidence to reconstruct developments in, and attitudes toward, armed conflict in the ancient Mediterranean region. This undergraduate course surveys the literary and material evidence of Greco-Roman warfare. Significant battles, developments, strategies, and attitudes are presented chronologically, and special attention is paid to issues of biological and chemical warfare, votive dedications and war trophies, casualties and commemoration, civilian impact, and the effects of post-traumatic stress disorder. This class is a designated W-course, so considerable attention will be paid to developing critical reading, writing, and oral presentation skills.", "completed": false}, {"dept_code": "CLASS", "id": "1720", "course_title": "SANSKRIT 2", "description": "A continuation of Sanskrit 1, this course is devoted to the reading of selected Sanskrit texts. Grammar presented in Sanskrit 1 is reviewed as necessary and some additional grammatical material is introduced.", "completed": false}, {"dept_code": "CLASS", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing-practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false}], "links": []}