{"nodes": [{"dept_code": "LATIN", "id": "0102", "course_title": "BEGINNING LATIN 2", "description": "An introduction to the sounds, vocabulary and basic grammatical structures of the Latin language. Students will begin to develop a competence in reading the language through textbook drills as well as Latin stories illustrating the Roman way of life. Please note that this course will be a hybrid of three 50-minute scheduled in-class meetings and a fourth 50-minute session to be completed by students working independently, either online at home, or though taking exams at the University Testing Center. Classroom time will generally center around instructor introduction of new material and some rudimentary work with said new material. In the online session, students will then complete more advanced exercises related to introduced material; take quizzes/exams; or complete group assignments. All online work will take place on Pitt supported applications (notably CourseWeb), or free platforms (e.g., Quizlet; TopHat; Centaur Education Software) or websites.", "completed": false}, {"dept_code": "LATIN", "id": "0220", "course_title": "INTERMEDIATE LATIN: VERSE", "description": "In this course students are introduced to Latin verse through close reading of selected portions of Virgil's Aeneid.", "completed": false}, {"dept_code": "LATIN", "id": "1301", "course_title": "LATIN AUTHORS 1: WRITING PRACTICUM", "description": "Writing practicum for students taking Latin 1300 as a writing course.", "completed": false}, {"dept_code": "LATIN", "id": "1402", "course_title": "ADV READINGS IN LATIN DRAMA", "description": "In this course students read selected works by Roman dramatists. The specific authors and works read vary from term to term; the course may be repeated for credit when the material covered is different.", "completed": false}, {"dept_code": "LATIN", "id": "1800", "course_title": "HONORS COURSE/MAJORS", "description": "In this course undergraduate majors in classics who wish to graduate with honors (and are otherwise qualified) write an honors paper, usually in conjunction with a Latin reading course at the 1300 or 1400 level.", "completed": false}], "links": [{"source": "0220", "target": "1402"}]}