{"nodes": [{"dept_code": "LCJS", "id": "0100", "course_title": "INTRODUCTION TO LAW, CRIMINAL JUSTICE, & SOCIETY", "description": "Enrollment Alert: Effective Spring 2022, this course replaces ADMJ 0100 SOCIETY AND THE LAW. If you have previously taken ADMJ 0100, contact your advisor about course repeat limitations/rules. This course introduces students to socio-legal theory related to the nature of crime, criminalization, and the purpose of punishment in the American criminal justice system. We use theory to explore and evaluate the workings of criminal justice institutions in a broader societal context, including how criminal justice compares with other institutions of social control/welfare (e.g. the education system). We also learn and apply major approaches to law & society in order to interrogate broader issues concerning law's intersection with societal values, power, and inequality. In so doing, we explore the nature, strengths, and limitations of legal reasoning and its application to the criminal justice issues examined throughout the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "0200", "course_title": "RACE, CLASS, GENDER, & THE LAW", "description": "Enrollment Alert: Effective Spring 2022, this course replaces LEGLST 0200 RACE, CLASS, GENDER, & THE LAW. If you have previously taken LEGLST 0200, contact your advisor about course repeat limitations/rules. That \"justice is blind\" is a central value and claim of criminal justice institutions, and modern legal systems more generally. This course takes a mainly historical approach to examine the overt and subtle ways that this blindness has been compromised by being commodified, gendered, and racialized. In terms of overt class boundaries, this 'blindness' emerged with the rise of the nation-state, but it was long gendered and racialized in overt ways and commodified in more subtle ones. Since roughly the 1960s, the U.S. has been in an era where all three social boundaries impinge on law's blindness in ways that tend to be more subtle than overt. Using a social boundary approach, students in this course will learn these historical trajectories to the present as a foundation for thinking critically about criminal justice, the legal system, and contemporary social inequality more generally. A major focus is law's relationship to inequalities based on race, class, and gender. Topics covered include slavery, Jim Crow, the development of formal equality under the law, affirmative action, and the commodification of legal rights.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1100", "course_title": "CRIMINOLOGY", "description": "Enrollment Alert: Effective Spring 2022, this course replaces ADMJ 0600 INTRODUCTION TO CRIMINOLOGY. If you have previously taken ADMJ 0600, contact your advisor about course repeat limitations/rules. This course provides an overview of the study of the causes and social responses to crime. It examines legal definitions and elements of crime; surveys major categories of crime, i.e., Predatory and non-predatory acts; reviews major measures of crime; identifies major correlates and theories of crime; differentiates types of offenders and evaluates the working of the criminal justice system.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1110", "course_title": "CRIMINOLOGICAL THEORY", "description": "Enrollment Alert: Effective Spring 2022, this course replaces ADMJ 1265 ADVANCED TOPICS IN CRIMINOLOGY. If you have previously taken ADMJ 1265, contact your advisor about course repeat limitations/rules. This class explores criminological theory from an interdisciplinary perspective. Throughout the semester, we examine major theories of criminality, crime causation, and criminalization. After a general introduction to theory, the first part of the course examines conventional or mainstream theory in criminology, which tends to focus on developing explanations for criminality and why people engage in criminal behavior. The second part of the course examines a relatively newer branch of criminological theory (environmental criminology), which endeavors to explain crime events and patterns rather than criminals and criminality. The last part of the course theorizes crime and criminalization from the perspective of critical criminology.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1200", "course_title": "CRIMINAL LAW", "description": "Effective Spring 2022, this course replaces ADMJ 1400, LEGLST 1140. INTRODUCTION TO CRIMINAL LAW. If you have previously taken ADMJ 1400, LEGLST 1140, contact your advisor about course repeat limitations/rules. This course acquaints students with the basic principles of criminal law derived from the English common law heritage and from more recent statutory penal code revisions in the American states. It examines criminal law in terms of what conduct is defined as criminal and what punishments are prescribed. Students will learn and apply the principles of criminal liability, theories of punishment, and the definition of specific offenses. Students will be encouraged to develop their own criminal law imagination as they engage with the course material.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1210", "course_title": "CRIMINAL PROCEDURE", "description": "This course examines the procedural aspects of criminal law, including constitutional rights, state criminal procedure, and appellate decisions and rules. Students will gain knowledge of the legal rules that govern the procedures by which crimes are investigated, prosecuted, and punished. Topics examined include the exclusionary rule, interrogations, the right to counsel, search and seizure, and police use of force.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1300", "course_title": "LAW AND POLITICS", "description": "Focusing on the United States, this course examines the relationship between law and politics both in general and with respect to specific substantive topics that are subject to change. Recent substantive topics have included low-level (misdemeanor) crime and police use of force. As we study these topics, we will observe the relationship between poverty, race, and the criminal justice system. \"Case studies\" for each topic will allow us to examine in greater depth the intersection of criminal justice, policing, race and poverty as we see how law and policy play out in real world encounters. Finally, for each topic we will ask \"Can we do better?\" and we will consider the suggestions of scholars who argue both that we can and we should. Following an initial introductory period on legal reasoning, each class will include student presentations of legal arguments using a courtroom format.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1310", "course_title": "LAW AND DEVIANCE", "description": "This course examines the concept of deviance, including types and theories of deviant behavior as well as how deviancy and responses thereto are socially constructed. We will examine the hypothesis that social, emotional, and legal responses to many types of behavior depend on myriad factors distinct from the behavior itself, including historical context and the social status of those both judging and being judged. Special attention will be given to variation in criminalization and punishment across historical contexts and social groups.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1320", "course_title": "CIVIL RIGHTS LAW", "description": "This course examines the nature and development of civil rights protections under U.S. law, especially as these relate to the U.S. Constitution. We will examine the important impact that interpretations of the Constitution have had on the character of civil rights law, including by allowing or disallowing certain forms of governmental and non-governmental action aimed at supporting or violating what today are recognized as civil rights. We will give attention to the role of civil and/or criminal liability in civil rights protections, and how this role relates to the legal system's approach to other socially defined harms. More broadly, this course considers the relationship between civil rights laws and various forms of group membership (e.g., sex/gender, race, citizenship ) and types of rights (e.g., religion, speech, education, privacy).", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1330", "course_title": "EMERGING ISSUES IN LEGAL AND SOCIAL POLICY", "description": "This fast-paced course explores several issues with which the law is now wrestling.  Topics addressed include our Constitution and our judicial system, the religion clauses of our Bill of Rights, assisted reproductive technologies, assisted suicide and right to die movements, intellectual property in the digital age, immigration law, the insanity defense, voting rights, environmental law and climate change, freedom of expression, social media and hate speech, international law, drug law and medical marijuana, and search, seizure, and privacy rights in this hi-tech age.  With all of these topics, we will explore how the law struggles to keep pace with advances in science and technology, as well as how the law reacts to a changing society.  The course proceeds in seminar fashion, with student participation encouraged, and includes a mid-term and final examination.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1340", "course_title": "LAW AND SOCIAL CHANGE", "description": "This course investigates the relationship between societal change and legal change. We examine how changes in society produce changes in law, how changes in law create changes in society, and the mutual, ongoing relationship between the two. Our investigation considers a range classical and contemporary theories and how they compare to specific cases that concern the dynamic relationship between law and social change.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1400", "course_title": "THE SYSTEM OF CRIMINAL JUSTICE", "description": "This course examines the criminal justice system as a set of interlocking institutions that have dynamic inter-relationships with one another and the larger society. We explore the history, structure, and function of policing, prosecution, the courts, and corrections. Special attention is given to trends in and contemporary problems of the criminal justice system.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1410", "course_title": "LAW ENFORCEMENT AND POLICING", "description": "This course examines law enforcement history, principles, and practices. We consider a range of topics including the origins and development of policing; different philosophical positions on law enforcement and its justification; and the emergence of the bureaucratized urban police force that is prevalent today. Attention is given to a critical examination of different approaches to policing, both past and present, as well as to the constitutional and social issues related to policing in a large-scale society.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1430", "course_title": "THE JUVENILE JUSTICE PROCESS", "description": "The general purpose of this course is to examine the law that has evolved in the U.S. to create and address the unique legal problems associated with children and adolescents. We examine the perception that young people constitute a special class under the law and identify the various ways in which the law operates to treat youth differently from adults as a result of that perception. We also explore various rationales that support this important distinction. In this overview of juvenile law concepts, we examine a number of important aspects of the juvenile justice system, including the nature, operation, and legal requirements of juvenile justice processes, as well as relationship between various parts of the juvenile system.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1440", "course_title": "CRIMINAL INVESTIGATION", "description": "The course introduces the student to basic and advanced procedures employed by crime scene investigators, with emphasis on the detection, collection, and presentation of physical and testimonial evidence. The course also identifies items commonly found at crime scenes and examines their significance as trace and physical evidence. Aspects of psychological and transient evidence associated with criminal activity will be explored, including the difficulties of presenting non-tangible evidence to a court and jury. Theories of information, observation and interrogation as they relate to crime scene investigation will be examined, as well the ethics of current investigative procedures utilized by modern law enforcement agencies. Finally, the course will emphasize the value of proper investigative techniques using discussions of case examples.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1500", "course_title": "CRIMINALISTICS", "description": "This course examines methods commonly used in the scientific investigation of physical evidence. Lecture topics include: the collecting, preserving, and lifting of latent fingerprints; photographing evidence; microscopic examination of hair and fibers; blood testing and typing; tool mark and firearms comparisons; impression casting; and chemical testing of paints, drugs, soils, alcohol, and inks. This course is designed to provide the student with a variety of learning experiences, including but not limited to: lecture using graphic PowerPoint picture presentations, group discussions, examinations, and experiential learning exercises, such as observations and/or presentations. Students must be prepared to work in a participatory learning environment with their peers.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1501", "course_title": "CRIMINALISTICS LAB", "description": "This is an optional lab for students enrolled in administration of justice 1115. Designed for non-science majors, the lab will introduce students to the basic principles of chemistry, biology, and physics as they are used on a daily basis in criminal investigations. Topics include: identification of hair and fibers, DNA, and chromatography. These and other techniques are then applied to a simulated drug bust, a kidnapping case, and a suicide/homicide investigation.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1510", "course_title": "PSYCHOLOGY AND LAW", "description": "This course introduces the student to the contributions of psychology to the legal process. Throughout the course, we will consider how psychological research can contribute to a better understanding of issues related to law and the legal process, how the legal and criminal justice system can be informed by the results of psychological research, and how the field of psychology can be more responsive to legal issues. Topics include the role of psychology experts in criminal proceedings, the problem of criminal insanity, the process of civil commitment, and the rights of those deemed to be mentally ill. Students will read and analyze legal cases as well as scholarly discussions of these and other related issues.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1520", "course_title": "CYBERCRIME", "description": "With the ever-increasing connectivity of devices to services, the likelihood of cybercrime victimization is expanding exponentially. In this course, students will learn the types of crimes that occur online, and receive a very basic overview of how these crimes are conducted. A basic overview of technology and common cyber terminology will be provided to assist students new to this subject. The course also will cover the process of cybercrime response, including an overview of evidence collection, evidence preservation, and legal considerations. Students will learn about the challenges Cyber crime investigator encounter when tracking down offenders on the web. Special attention will be given to the current Cyber threats faced by the financial industry.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1530", "course_title": "ORGANIZED CRIME", "description": "This course examines the history and ongoing development of organized crime. The emergence of \"non-traditional\" groups that compete for power and profits will be examined, as well as the alliances between various criminal groups that have evolved and resulted in the phenomenon of \"transnational\" organized crime.  Those \"non-traditional\" groups include, but are not necessarily limited to, domestic and international terrorist organizations. Neither organized crime nor a terrorist organization can be effectively discussed without integrating the evolution of US drug policy, which therefore will be included. The course also will give attention to the impact of organized crime on the private sector, as well as to the various government tactics used to counter organized crime.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1531", "course_title": "INTERNATIONAL ORGANIZED CRIME", "description": "Organized crime is no longer confined to a few countries such as Italy, the United States, and Japan. With the end of the Cold War and the immense technological advances that spread with globalization, organized crime has become much more pervasive, with a major impact in countries such as Russia, Mexico, and South Africa, and with increased operations (and especially co-operation) across borders. This course looks at the dynamics of transnational organized crime, explains why it develops in particular countries, the various forms it takes, and the responses of law enforcement agencies and international institutions.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1540", "course_title": "WHITE COLLAR CRIME", "description": "This course examines the meaning, varieties, and extent of \"white collar\" crime in the United States. It investigates the developmental history of this concept, theories of white collar crime causation, specific types of white collar crime, empirical and theoretical controversies surrounding white collar crime, and the probable future directions for this type of criminal behavior.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1570", "course_title": "PRINCIPLES OF HOMELAND SECURITY", "description": "This course examines the challenges facing our domestic public service and justice personnel in the context of a borderless world of globalization and technology. Attention is paid to problems of terrorism, incident management systems, violence incident response procedures, changing federal, state, and local response planning and security issues, mass casualty programs, crime scene operations, the evolving role of the intelligence community, and the balance of security and liberty.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1571", "course_title": "TERRORISM", "description": "This course will provide a broad overall understanding of the nature and history of terrorism. Areas to be covered include the history of terrorism, domestic terrorism, the psychology of terrorism, the development of modern terrorism through bio-chemical hazards, narco-terrorism, religion-based terrorism, internal terrorism, and assassinations. Possible root causes and patterns of terrorism will be discussed. Additional topics to be included are counter-terrorism policies, the economics of terrorism, and the role of foreign policy.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1580", "course_title": "THE LEGAL SYSTEM", "description": "This course provides students with an overview of the structure and operation of American law and legal systems. With an emphasis on legal institutions, the course examines the nature, functions, limitations, and operations of law in modern society. Various jurisprudential approaches are examined, and selected problems of law, power, morality, and social and economic stratification are studied.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1581", "course_title": "INTERNATIONAL LAW", "description": "This course focuses on the nature of international law and how it differs from law within states. Topics covered include the role of the United Nations, treaties, enforcement mechanisms, international courts, human rights issues, the law of war, genocide, and the prospects for the future of international law.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1583", "course_title": "SEX, LAW AND MARRIAGE", "description": "This course surveys the socio-legal aspects of marriage, marital alternatives, and related modes of sexual expression. Laws in these areas have been changing dramatically, reflecting, if not causing, fundamental shifts in the values and norms surrounding intimate behavior.The following topics are covered: sexual offenses, protection from abuse, abortion rights, child custody, child support, unwed cohabitation, marriage, annulment, separation, divorce, alimony, and marital property rights.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1590", "course_title": "SPECIAL TOPICS IN LAW AND CRIMINAL JUSTICE", "description": "Although the specific set of topics shifts from semester to semester, this course focuses on key issues at the intersection of law and criminal justice. Possible topics include: policies, goals, and procedures of criminal justice agencies; trends and controversies regarding law enforcement activities; the role of policing and corrections in ensuring human security; the role of law and the courts in ensuring justice; and the scope and impact of the criminal justice system.", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1620", "course_title": "INTRODUCTION TO LEGAL RESEARCH", "description": "This is an introductory course to legal research using both primary sources (constitutions, statutes, case-law, and administrative law) and secondary sources (digests, citators, encyclopedias, legal periodicals and newspapers, treatises, annotations, Restatements) for Federal and Pennsylvania law. It assumes no knowledge on your part. It will provide online training for various free and subscription databases (including ULS databases and Westlaw).", "completed": false, "prereq_count": 0}, {"dept_code": "LCJS", "id": "1700", "course_title": "ETHICS IN CRIMINAL JUSTICE", "description": "This writing-intensive course will employ a combined practical and theoretical approach to the study of ethics in relation to the American criminal justice system. We will examine ethical dilemmas at all levels of the criminal justice system from policing and investigations to prosecution and adjudication, paying particular attention to those that lead to discrimination based on race, class and gender and abuse of authority. To that end, we will examine in-group/out-group dynamics and noble cause corruption in both policing and prosecution. We will consider prosecutorial discretion and the ethical mandate of the public prosecutor as well as judicial conduct and oversight. Additionally, we will examine the role of structural biases in the criminal justice system in perpetuating race, class and gender inequality. Above all, we will ask how the criminal justice professional can operate ethically within a morally imperfect system. We will consider not only what is ethical behavior, but also common barriers (cognitive, interactional, organizational) to ethical action. The course will revisit topics introduced early in the major such as the nature of crime, the decision to criminalize and the purpose of punishment in the American criminal justice system, and it will ask students to assess the legitimacy and fairness of these approaches.", "completed": false, "prereq_count": 0}], "links": []}