{"nodes": [{"dept_code": "TLL", "id": "1000", "course_title": "INTRODUCTION TO TEACHING", "description": "Introduction to teaching explores contemporary perspectives of education. It provides a basic introduction to instructional planning, curriculum, and classroom management. Additionally, the class provides opportunities for practice of proven teaching strategies designed to meet individual student needs.", "completed": false}, {"dept_code": "TLL", "id": "1041", "course_title": "INTRO TO EARLY CHILDHOOD ED", "description": "The course is a general introduction to the theoretical, political, economic, and social issues that are inherent in the conduct and development of services for young children. The primary thrust is intended to provide students with both an overview of current issues and a basis for assessment.", "completed": false}, {"dept_code": "TLL", "id": "1047", "course_title": "INTEGRATED CURRICULUM PRE-K - 4", "description": "Engagement with general and specific issues related to the development of content and lessons that cross a broad range of curricular areas for children in pre-k through grade 4.", "completed": false}, {"dept_code": "TLL", "id": "1209", "course_title": "READING/WRITING METHODS 2: GRADES 2-4", "description": "This course is intended for teacher candidates who are pursuing prek-4 certification. It is the second in a two-course sequence and builds on concepts introduced in reading/writing methods 1. It is also part of set of courses that focus on literacy development and instruction. Other courses in the set include language and literature for the young child, and literacy assessment and instruction for children with disabilities in inclusive settings. Teacher candidates in reading/writing methods 2 will have opportunities to build their knowledge about specific aspects of literacy, including: (a) word study--decoding, spelling, and vocabulary, (b) comprehension, and (d) composition, including handwriting. In addition, candidates will learn about specific instructional approaches and resources for supporting students in developing those aspects of literacy in grades 2-4.", "completed": false}, {"dept_code": "TLL", "id": "1257", "course_title": "TEACHING ENGLISH LANGUAGE LEARNERS", "description": "This course will explore strategies for teaching English language learns (ell's) in formal and informal education settings. Students will be introduced to foundational theories and current research on the social and academic factors that influence ells learning experiences. The class will include a video component so students can observe instructional approaches for working with linguistically and culturally diverse ells.", "completed": false}, {"dept_code": "TLL", "id": "1270", "course_title": "INTEGRTG ART & MUSIC ELEM CLSSRM", "description": "To introduce preservice classroom teachers to art and music contents and processes with relevance to their expected role in integrating authentic arts learning experiences in their instruction. Emphasis is placed on developmental aspects of children's' responsive and expressive skills in art and music.", "completed": false}, {"dept_code": "TLL", "id": "1433", "course_title": "MATH METHODS FOR PREK-GRADE 4 STUDENTS", "description": "This course investigates methods for teaching mathematics to diverse elementary school children. The course is intended to contribute to your development as a critical, equity-oriented, supportive, reflective, and effective elementary teacher of mathematics. We will use readings, assignments, projects, and our classroom discussions to facilitate your understanding of important issues related to equitable mathematics teaching and learning. We will focus on topics such as cognitive demand, classroom discourse, group work (e.g., Complex Instruction), equitable pedagogical and assessment practices, culturally relevant pedagogy, social justice pedagogy, building relationships with students and their families, and developing political knowledge for teaching mathematics. You will work in small groups, partnerships, and individually in class and for your assignments and projects. Our class community will support each other's progress toward the course learning goals.", "completed": false}, {"dept_code": "TLL", "id": "1560", "course_title": "EARLY EDUCATION OF YOUNG CHILDREN WITH DISABILITIES", "description": "The course focuses on (1) an overview of early childhood special education, including its rationale, historical and legal foundations, efficacy, service delivery systems, and current trends and practices; (2) the developmental assessment of young children with disabilities in the areas of motor, cognition, social-emotional, language/communication, and adaptive skills; (3) designing preschool classroom environments that meet the needs of children with disabilities through adaptations and accommodations, embedded Learning, and special instruction.", "completed": false}, {"dept_code": "TLL", "id": "1580", "course_title": "FOUNDATIONS OF SPECIAL EDUC", "description": "Course provides an overview of the field of special education. It includes such topics as 1) identification; 2) placement; 3) programming; 4) inclusion; 5) advocacy; and other topics relating to individuals with disabilities, and gifted and talented individuals. The course examines the various philosophical views of exceptionality.", "completed": false}, {"dept_code": "TLL", "id": "1702", "course_title": "DIGITAL LITERACIES AND LEARNING ACROSS EDUCATIONAL CONTEXTS", "description": "This course will explore how literacy and learning are changing as people utilize digital technologies and traverse an evolving media landscape. To do so we will examine how people - particularly PreK-12 youth - are reading, writing, and making meaning with digital media and technology across educational contexts from schools to museums to library makerspaces. In this course, students will learn how to digitally compose a range of artifacts (e.g. digital stories, games, podcasts), engage in critical analysis of digital artifacts, and think about how to design digital experiences to nurture learning and literacy. Through our creation and reflection on digital artifacts we will also focus on key concepts in digital literacies like participatory cultures, multimodality, multiliteracies, algorithmic rights, and more.", "completed": false}, {"dept_code": "TLL", "id": "1704", "course_title": "CURRENT ISSUES IN SECONDARY EDUCATION", "description": "What would the ideal high school look like? How would it provide an engaging, equitable and quality education to all adolescents? In Current Issues in Secondary Education: Reimagining the American High School we will explore current issues in U.S. high schools, such as systemic racism and unequal funding, and learn about innovative schools that are doing things differently. We will reflect on our own schooling experiences and collaborate to design a model high school.", "completed": false}, {"dept_code": "TLL", "id": "1850", "course_title": "LIFE SKILLS PRACTICUM", "description": "For this practicum, which is part of the case program, students will be placed in either a primary life skills classroom or a preschool special education program and will be mentored by a classroom teacher, co-teacher, or itinerant teacher depending on the placement. Students will be expected to complete specific requirements in these settings to fulfill state competencies and program requirements.", "completed": false}, {"dept_code": "TLL", "id": "1852", "course_title": "LIFE SKILLS PRACTICUM SEMINAR", "description": "Seminar for preschool special education/primary life skills practicum. This course is the seminar that accompanies the preschool special education/primary life skills practicum.", "completed": false}], "links": []}