{"nodes": [{"dept_code": "CHIN", "id": "0002", "course_title": "FIRST YEAR CHINESE 2", "description": "This is the 2nd term of 1st year chin language course intended for those who have completed chin 1001/0001 or its equivalent. This course continues to help students to develop basic oral and written proficiency and understand the basics of chin language and culture. Students are expected to be able to converse in limited daily life situations and write short paragraphs on personal topics. Class activities consist of pair work, group work, and presentations on the course materials and other level appropriate authentic materials.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "0004", "course_title": "SECOND YEAR CHINESE 2", "description": "The course aims to enhance student's abilities for speaking accurately and appropriately in increasingly challenging situations, reading and understanding a wider range of narrative and descriptive texts and the relevant cultural aspects, writing longer narrative and descriptive paragraphs with proper discourse connectors and idiomatic expressions, and conversing on personal topics with sophistication and some non-personal topics. This course includes recognition and production of 350 characters presented in both traditional and simplified versions. Students should have control of a cumulative total of 1,400 characters by the end of the term.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "0007", "course_title": "INTRODUCTION TO CHINESE CIVILIZATION AND CULTURE", "description": "This course is an interdisciplinary introduction to Chinese society and culture from earliest times to the present. We will introduce the development of China in material terms as well as in terms of competing beliefs, and the relationship of these to social groups. The first part of the course explores ancient literature, philosophy, religion, art, architecture, customs, and other aspects of china's rich and diverse heritage. The second part will be devoted to china's transition to a modern society, covering such topics as social changes, urban life, popular culture, and the values and ideas that captivate contemporary Chinese people's attention. Cultural traditions of Hong Kong, taiwan, and tibet will also be employed.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "0010", "course_title": "SPECIAL TOPICS IN EAST ASIAN POP CULTURE", "description": "This 1-credit mini course explores the spread of Asian pop across the world in conjunction with the Asian Studies Center's annual lecture series on Asian pop culture.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "0081", "course_title": "EAST ASIA IN THE WORLD", "description": "To enhance a greater understanding of East Asian cultures; to explore the interactions and relations between the peoples and cultures of East Asia (china and Japan) and the rest of the world, from ancient times to the present. Literary works, memoirs, autobiographies, diaries, historical records and films will be used. Themes involve such topics as the significance of travel in self-understanding, diaspora, immigration, and changing ideas of the homeland.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1010", "course_title": "THIRD-YEAR CHINESE 2", "description": "The course aims to enhance student's abilities for speaking accurately and appropriately in challenging situations, reading and understanding original texts of different types, writing short essays on various topics with discourse connectors and idiomatic expressions, and conversing on both personal and non-personal topics with sophistication at discourse level. Students in this course should be aware of relevant Chinese traditions and perspectives and be able to make comparisons and connections with other cultures.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1027", "course_title": "CHINESE AS A SECOND LANGUAGE AND BILINGUALISM", "description": "The course introduces students to research methods and findings on Chinese as a Second Language (CSL) and it familiarizes students with pedagogical and issues of learning in CSL. The course content includes (1) linguistic perspectives of CSL and second language learners' grammatical knowledge development, including how key structures are acquired and typically dealt with in language classroom; (2) psycholinguistic experimental methods and cognitive development of bilingual speakers of Chinese and English, including in character recognition/production, vocabulary acquisition, morphological awareness development, etc.; (3) corpus approaches in CSL and applications; (4) pragmatics in L2 Chinese; (5) other CSL topics such as learner motivation, Chinese as a heritage language, proficiency assessment, and technologies in CSL. The course will use a combination of lectures, discussions, and presentations. Class will be conducted largely in English, while enrolled students are expected to have an intermediate or above level Chinese proficiency.", "completed": false, "prereq_count": 2}, {"dept_code": "CHIN", "id": "1033", "course_title": "SPECIAL TOPICS: ADVANCED CHINESE ACROSS GENRES", "description": "To develop greater fluency, accuracy and confidence in spoken Chinese. Rhetorical and presentational skills will be introduced and reinforced. Students will narrate and describe an event/situation, maintain sustained discourses, provide structured arguments, develop hypotheses and explain as well as defend opinions. Through reading news articles on various subjects such as society, finance, politics, technology, sports and entertainment, students will gain deeper understanding of social, cultural, political and economic situations in Chinese speaking regions and will be able to conduct in-depth conversations with native speakers.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1059", "course_title": "ADAPTED FOR THE SCREEN: CHINESE LITERATURE AND FILM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1084", "course_title": "MASTERPIECES OF CHINESE LITERATURE: MODERN", "description": "A critical analysis of some of the most representative literary works in modern china from a literary and socio-political perspective.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1086", "course_title": "LOVE IN CHIN AND WESTERN LITERATURE", "description": "The course will explore and compare expressions of love in Chinese and Western literature. The course will examine a succession of theories and ideas of love such as platonic, religious, courtly, romantic and post-romantic from the Western tradition; love in Confucianism, Monism, Taoism, and Buddhism.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1089", "course_title": "THE WORLD OF CHINA", "description": "This course will survey the wax and wane of pop culture through disparate phases of social and political developments of modern china. The readings will introduce students to works of literature, art, and film to see how tradition and modernity, elite and mass cultures, East and West conflict and converge; how china absorbs, adapts as well as resists capitalistic modernity while embracing global market economy; how china grapples with urban alienation, social flux, moral laxity and other negative aspects of industrialization and urbanization. The course will make available to students a host of art images, dvd clips and e-texts to enhance and expand their perception of modern china.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false, "prereq_count": 0}, {"dept_code": "CHIN", "id": "1999", "course_title": "SENIOR PROJECT", "description": "As a summative project for all Chinese majors, the course provides students with guidelines to complete the senior project through integrating culture and language (speaking & writing), traditional & modern Chinese culture as well learning experiences acquired both at Pitt and abroad in china and /or Taiwan. They are to prepare proposals, formulate essay themes in both the English senior essay and the Chinese essay, and determine other formats that can be accepted as supplements: audio-visual, electronic, etc. Also instructs students how to find appropriate resources.", "completed": false, "prereq_count": 0}], "links": [{"source": "0004", "target": "1027"}, {"source": "0004", "target": "1027"}]}