{"nodes": [{"dept_code": "CSD", "id": "1021", "course_title": "LANGUAGE DEVELOPMENT", "description": "Students in this course become acquainted with current models and empirical evidence concerning the process of language acquisition.", "completed": false}, {"dept_code": "CSD", "id": "1025", "course_title": "HEARING SCIENCE", "description": "Fundamental concepts in normal audition. Review of acoustics, anatomy, and physiology of auditory system, psychophysical methods and subjective correlates to auditory stimulus.", "completed": false}, {"dept_code": "CSD", "id": "1026", "course_title": "SPEECH SCIENCE", "description": "An introduction to speech physiology, acoustics, perception, models of speech production, research methodology and current topics in the area of speech science.", "completed": false}, {"dept_code": "CSD", "id": "1028", "course_title": "LAB IN HEARING SCIENCE", "description": "This is a one credit required experience for all students enrolled in \"Hearing Science\".", "completed": false}, {"dept_code": "CSD", "id": "1030", "course_title": "LAB IN SPEECH SCIENCE", "description": "An introduction to speech physiology, acoustics, perception, models of speech production, research methodology and current topics in the area of speech science.", "completed": false}, {"dept_code": "CSD", "id": "1031", "course_title": "GUIDED CLINICAL OBSERVATION", "description": "In this course guided clinical observations will be used as the context for students acquiring skills in describing and summarizing behaviors relevant to the study of communication disorders. Observation time earned in this course can be applied towards hours of clinical observation required by many graduate programs in audiology and speech-language pathology.", "completed": false}, {"dept_code": "CSD", "id": "1102", "course_title": "INTRODUCTION TO PROFESSIONAL AND CLINICAL ISSUES IN COMMUNICATION SCIENCE & DISORDERS", "description": "This course provides an introduction to professional issues related to clinical practice in speech-language pathology and audiology. It includes an introduction to issues that affect service delivery across settings, incorporating guided observation and learning activities to facilitate integration and application of knowledge.", "completed": false}, {"dept_code": "CSD", "id": "1230", "course_title": "INTRODUCTION TO SPEECH LANGUAGE PATHOLOGY", "description": "This course is designed to introduce students to the field of communication disorders, by acquainting them with the major disorder types as well as the major activities conducted by speech-language pathologists.", "completed": false}, {"dept_code": "CSD", "id": "1234", "course_title": "WRITTING PRACTICUM FOR CLINICAL METHODS IN COMMUNICATION SCIENCE & DISORDERS", "description": "A one-hour recitation section will be held weekly that will be dedicated to developing writing skills. Students will be required to produce samples of writing in many formats (article summaries and reviews, diagnostic reports, progress reports, and research reports) to prepare them to be effective communicators in the field of communication science and disorders. Students will be required to critique their own products as well as those of their peers.", "completed": false}, {"dept_code": "CSD", "id": "1235", "course_title": "CLINICAL METHODS IN COMMUNICATION SCIENCE & DISORDERS", "description": "This course provides an introduction to clinical approaches and methods reflected in the management of communication and swallowing disorders across the lifespan. Emphasis is placed on diagnostic and treatment processes and the use of an evidence-based framework to guide clinical decisions.", "completed": false}, {"dept_code": "CSD", "id": "1237", "course_title": "INTRO TO NEUROSCIENCE OF COMMUNICATION", "description": "This course describes the fundamentals of human brain structure and function as relevant to human communication. Methods used to probe the neural bases of speech, language, and hearing function along with current research findings are addressed. An understanding of how the brain processes speech and language provides insight into neurological disorders that affect communication.", "completed": false}], "links": []}