{"nodes": [{"dept_code": "CMPINF", "id": "0001", "course_title": "SCI FIRST-YEAR SEMINAR", "description": "The first-year seminar will provide students with an introduction to SCI and the University of Pittsburgh. The format of this course will be mixed between large group informational sessions, and small group discussions and activities. The small group sections will be led by members of our advising staff, undergraduate peer mentors, and/or faculty. The course will be split approximately evenly between large-group informational sessions and small-group discussions.", "completed": false}, {"dept_code": "CMPINF", "id": "0010", "course_title": "BIG IDEAS IN COMPUTING AND INFORMATION", "description": "Computing and information systems underlie nearly every facet of life in today's highly-networked societies. Accordingly, there are many paths through the degree programs offered by the School of Computing and Information, each focusing on different aspects of the theories, practices, and applications of computing and information. This course will introduce students to a variety of core principles and important themes that cross-cut this array of computing- and information-oriented disciplines, as well as explore the types of work that individuals educated in these disciplines engage in.", "completed": false}, {"dept_code": "CMPINF", "id": "0401", "course_title": "INTERMEDIATE PROGRAMMING", "description": "This is an intermediate programming course that focuses on programming via an object-oriented paradigm. Students entering CMPINF 0401 are expected to have some previous concepts and then focus on object-oriented programming, including classes, encapsulation and abstraction, inheritance, polymorphism and interfaces. Some introductory data structures and algorithms will also be covered in this course.This class is a programming-intensive course, and students will be expected to complete several non-trivial programming projects throughout the term.", "completed": false}, {"dept_code": "CMPINF", "id": "1201", "course_title": "DIGITAL NARRATIVE AND INTERACTIVE DESIGN", "description": "How are computational artifacts currently designed, and how can they be designed differently? What stories can be told by collaborating with computers? What stories can't be told? This project-based course will enable students to engage with and create computational narratives and interactive projects with data, hardware and algorithms. Each collaboratively taught iteration of the course will include 3-4 of these units, such as: fabrication, interactive hardware, computational narrative, interactive data, and prototyping. Students will consider what it means to compose with computers for human audiences, and with humans for computer audiences. Designed for Digital Narrative and Interactive Design (DNID) majors to take midway through the major, it will help students consolidate the interdisciplinary knowledge they have obtained in their prerequisite courses, introduce them to examples of interdisciplinary work that will inform their later capstone projects, and give them practice in working on collaborative projects that span the humanities and information/computing fields.", "completed": false}, {"dept_code": "CMPINF", "id": "1205", "course_title": "COMPARATIVE DIGITAL PRIVACIES", "description": "This course will offer a broad survey of significant issues relating to privacy in the digital age. It investigates privacy in the digital world from cultural, social, communication, and policy perspectives. Taking a comparative approach, privacy related to digital communication is compared across several global regions in an attempt to understand the distinctiveness of privacy in those regions. The course will first introduce students to the concepts of privacy, the digital age, and the relation between privacy protections and the state. Students will understand the significance of the issue of digital privacies and why we need to employ a comparative approach to examine it. The course will then look at selected case studies of digital privacy in several global regions, including the United States, Canada, Europe, China, and South East Asia. Issues related to digital privacies such as Internet laws and policies, media regulations and public interest, data protection, state control, and commercial interests in the digital age, surveillance, copyright, and privacy advocates will also be included.", "completed": false}], "links": []}