{"nodes": [{"dept_code": "ITAL", "id": "0050", "course_title": "ITALIAN CONVERSATION", "description": "This course offers students the opportunity to improve their ability to converse in Italian. Discussions will center on topics of general interest.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0081", "course_title": "MADE IN ITALY:INGENUITY, SINGULARITY, STYLE", "description": "This course provides an introduction to the central themes of Italian Cultural Studies, tracing them from their origins in early modern period to the present day. Students explore Italy's unique contributions to the areas of image and style; human mobility; science, technology and design; performance and spectacle; humanism and human rights.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0087", "course_title": "FOOD FOR THOUGHT: ITALIAN FOOD CULTURE", "description": "This course is taught in English. This course is an introduction to Italian history and culture in which students will explore the importance of Italian cuisine through the analysis of literary and historical texts, visual arts, and film related to food production, consumption, importation/exportation, and legislation. Students will examine the history of food culture from antiquity to the present day, and consider the socio-cultural and socioeconomic impacts of food and cuisine in contemporary Italy. No prerequisites. No textbook required. No knowledge of Italian is required.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0090", "course_title": "EURO CHIC: THE INVENTION OF FASHION", "description": "Since the Renaissance, Italy and France have occupied a fundamental role in the establishment and development of fashion as a creative and commercial enterprise deeply rooted in cultural mores. The course address the historical shifts in the cultural understanding of gender roles, class belonging, consumption habits and expectations, the international circulation of craftmanship and celebrities, and technological innovation. We will start addressing the anthropology of body ornamentation, gender markings and the difference between costume and fashion. Our historical point of departure is the grand arrival of Catherine De Medici from Florence to Paris in 1547, following her marriage to King Henry II of France. We then follow the progressive establishment of Paris as the capital of European (and eventually international) fashion, together with Italian cities like Florence, Venice and Milan. We also take a significant detour through London during the \"dandy\" era of the early 19th century and the \"mod\" and \"punk\" trends of the decades between 1960 and 1980. Punk leads us into a discussion of current international \"anti-fashion\" trends, such as the politics and economics of privilege, cheap labor and environmental concerns about \"fast fashion.\" This course is taught in English. *This course may be used for the Italian Studies major (whether listed as FR 0090 or ITAL 0090), but does not count for the Italian major or the Italian minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0101", "course_title": "ITALIAN LANGUAGE AND CULTURE 1", "description": "An introduction to the Italian language, including basic grammar, vocabulary and speech patterns. Primary goal is to achieve competence in the spoken language, along with basic skills in reading and writing. Face-to-face lesson meetings (3 days per week) consist of communicative activities in which students practiced learned structures and vocabulary. One hour per week is online. In this hour, students will watch/listen/read lectures, complete exercises related to grammar and vocabulary, and interact with apps and websites (Extempore, Quizlet, etc.) that will be tracked in the classroom management platform Schoology. This instructional approach is designed to allow for maximum interaction in the classroom environment, so that students can receive extensive feedback on their progress. No textbook required.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0102", "course_title": "ITALIAN LANGUAGE AND CULTURE 2", "description": "An introduction to the Italian language, including basic grammar, vocabulary and speech patterns. Primary goal is to achieve competence in the spoken language, along with basic skills in reading and writing. No textbook required.", "completed": false, "prereq_count": 1}, {"dept_code": "ITAL", "id": "0103", "course_title": "ITALIAN LANGUAGE AND CULTURE 3", "description": "This course is a logical continuation of the first-year sequence. Emphasis continues to be placed on the oral-aural skills, but the reading and writing skills become increasingly stressed. No textbook required.", "completed": false, "prereq_count": 1}, {"dept_code": "ITAL", "id": "0110", "course_title": "MODERN ITALY", "description": "An introduction to Italian literature and culture. The majority of readings are in the prose and poetry of modern Italian writers.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0113", "course_title": "MODERN AND CONTEMPORARY CULTURE", "description": "This course aims to build on the skills and knowledge students have acquired in ITAL 0003 and continue their development in all aspects of Italian language, with particular emphasis on tools and strategies necessary to advance reading and writing.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "0115", "course_title": "PERFORMING ITALIAN", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1071", "course_title": "THE ETERNAL CITY: ROME FROM ANTIQUITY TO TODAY", "description": "Rome has been called the \"Eternal City\" because of the enduringly important role it has played in Mediterranean, European, and global affairs over a period of more than two millennia. In this course we will use the rich urban history of Rome as the geographic focal point through which to examine the societal and cultural changes that unfolded across these centuries for Rome's citizens, Rome's imperial subjects, and people connected to Rome by networks of travel and trade. Students will learn about these societal changes through direct analysis of a broad range of authentic texts and media, including letters, short stories, biographies, cinema, travelogues, historical and contemporary maps, architecture and visual arts, graffiti, music, guidebooks, recipes, and exhibition catalogues. Students will create a digital final project: an interactive Story Map (created with the ArcGIS digital mapping platform) that will represent the routes and experiences of multiple individuals who traveled to and within the city of Rome in different centuries, based on these individuals' written accounts.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1072", "course_title": "MANGIARE ALL'ITALIANA: ITALIAN SOCIAL IDENTITIES AND FOODWAYS", "description": "Mangiare all'italiana? What does it mean to eat \"Italian-style\"? What does it mean to be \"Italian\"? This course explores Italian and Italian American social identities in both historical and contemporary society and culture. Students will engage with primary and secondary sources of various kinds (scholarly articles, literary texts, historical texts, visual arts, film, etc.) in order to broaden their understanding of the intersectionality of Italian identity through the lens of foodways, the social science of studying food traditions, practices, production, and consumption. The course is divided into four parts: an overview of Italian history and social identities as represented in texts on food and cuisine; the role of social class and socioeconomic identity in three historical periods; the roles of women in Postwar Italy; and topics in emigration and immigration historically and in contemporary Italy. Prerequisites: Two intermediate-cluster courses (i.e., ITAL 0113, ITAL 0115, ITAL 0117, ITAL 0119) or the equivalent (as determined by Italian Program faculty)", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1078", "course_title": "FULBRIGHT SEMINAR IN ITALIAN STUDIES", "description": "The fulbright seminar in Italian studies is the spring-term undergraduate-level course offered by the visiting fulbright distinguished scholar from Italy. This course is typically offered in the fields of art history, cultural studies, film, history, literature, museum studies, political science, or urban studies.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1079", "course_title": "INTRO TO HOLOCAUST LITERATURE", "description": "This course surveys the central texts of the literature of the holocaust, while introducing students to the main issues and preoccupations of holocaust testimony in literature and film.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1084", "course_title": "INTERCULTURAL PIAZZA", "description": "Italy has long been a nation of emigrants, but only in the last few decades has become a nation receiving large numbers of immigrants. The fall of communism in Eastern Europe, and wars and violence in the Balkans, across Africa and the Middle East, have spurred new migrants towards the West in search of safety and economic prosperity. The unique position of the Italian peninsula in the Mediterranean has made it a key territory of arrival in these modern-day migrations, but to what advantage and to what cost? This course will explore the complexities of cultural identity and migration, and the impact they have on intercultural conflict and cooperation. There will be a particular focus on migration in Italy and on the marginalized communities of contemporary Italy, such as migrants, their Italianborn non-citizen children, and the Roma. We will examine the fluidity of cultural boundaries across time and space, and how ingroup and outgroup dynamics contribute to the manufacturing of fear and prejudice among populations. During their semester abroad, students will reflect on the various elements that define a culture while gaining an increased understanding of how culture shapes individuals and how our cultural identities interact in shared social spaces such as the piazze of Florence. This is a Study Abroad course offered in Florence, Italy.", "completed": false, "prereq_count": 0}, {"dept_code": "ITAL", "id": "1910", "course_title": "ADVANCED-LEVEL PRACTICUM", "description": "This one-credit course is for students at the advanced proficiency level of Italian (pre-requisite is two of the following: ITAL 0113, 0115, 0117, or their equivalents). This course should be taken in conjunction with an advanced-level Italian course. In this course, students will practice advanced-level writing or speaking, with a focus on genre-based text types. Students will receive regular feedback on their written or spoken production with the aim of improving Italian proficiency. This course may be repeatable for credit when the topic, theme, or academic content is different from previous semesters.", "completed": false, "prereq_count": 0}], "links": [{"source": "0101", "target": "0102"}, {"source": "0102", "target": "0103"}]}