{"nodes": [{"dept_code": "SPAN", "id": "0082", "course_title": "LATIN AMERICA TODAY", "description": "This course is an overview of contemporary Latin America and its people and is designed to be an introduction for students who have no previous knowledge of the area. Students will be exposed to several aspects of Latin America. A special attempt will be made to show contemporary social reality as interpreted by some of the region's most gifted writers. In English.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0101", "course_title": "ELEMENTARY SPANISH 1", "description": "This course is designed to develop the student's communicative proficiency through an integrated approach to the teaching of all four language skills: listening, speaking, reading and writing. Grammatical structures; vocabulary and readings are presented as tools for developing good communication skills. The course also aims to foster cultural awareness of the Spanish-speaking world.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0102", "course_title": "ELEMENTARY SPANISH 2", "description": "A continuation of Elementary Spanish 1, training in spoken and written Spanish.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0103", "course_title": "INTERMEDIATE SPANISH 3", "description": "This course builds on the skills acquired during the elementary sequence (either Spanish 0001 and 0002 or Spanish 0015). It includes a functional review of the basic language structures and introduces even more complex structures. The course has a strong cultural component.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0104", "course_title": "INTERMEDIATE SPANISH 4", "description": "A continuation of Spanish 0003. Students continue to refine their language abilities and enhance their communicative competence. The course has a strong cultural component.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0115", "course_title": "INTENSIVE ELEMENTARY SPANISH", "description": "This is a condensed version of the first two courses of the Spanish language program (Spanish 0101 and 0102, formerly 0001 and 0002), and it has been designed for students who have taken at least two years of high school Spanish or its equivalent. Spanish 0115 follows a communicative approach: from the first day of class you will interact in Spanish in a meaningful context with your instructor and classmates. By the end of this course you will have a general knowledge of the grammar of the Spanish language and you will be able to communicate effectively in Spanish according to this level.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0120", "course_title": "CONVERSATION", "description": "The goal of this fifth-semester course is to enhance fluency and the development of oral proficiency in Spanish. Although the emphasis is on speaking and listening skills, reading and writing assignments are an important part of the syllabus. This course helps students to improve their fluency, pronunciation, and strategic competence such as paraphrasing skills, and increases their vocabulary through readings, films, digital recordings and other authentic materials.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0125", "course_title": "GRAMMAR AND COMPOSITION", "description": "This course reviews Spanish grammar, and, in addition, is designed to aid the students in vocabulary building, improving their knowledge of idiomatic usage, and their ability to translate from English to Spanish.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "0126", "course_title": "SPANISH ADVANCED GRAMMAR AND COMPOSITION FOR HERITAGE SPEAKERS", "description": "This course is specially designed for Spanish Heritage students who already understand and speak Spanish but they communicate almost exclusively in English and for students who speak Spanish mostly in informal settings and would like to improve their writing and spelling skills. This course aims to identify the skills that the heritage students already bring with them and develop them further. Through readings and film screenings, class presentations, discussions and debates, writing workshops and peer editing, this course seeks to strengthen the studentÂ´s confidence in the language. Students will review basic grammar structures and spelling, expand vocabulary and develop writing skills. The goal of this course is also to expose students to different products, practices, and perspectives from the Hispanic cultures in the US and abroad.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1055", "course_title": "INTRODUCTION HISPANIC LITERATURE 1", "description": "This course is designed to introduce students to the study of Spanish and Latin American literatures, while dealing with concepts and terms that can be applied to all literature.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1056", "course_title": "READING, WRITING, & HEALTH IN SPANISH", "description": "What is literature? What does the literary do? This course, conducted in Spanish, is designed to introduce students to the study of Hispanic literature, while the same time dealing with concepts which can be applied to all literature. We will analyze Hispanic literature understood in its broadest sense, touching upon significant works, genres, movements, and authors from Spain and Latin America, all of which will have either health-related themes or relevance to the field of narrative medicine. More than a survey course, however, this course is designed to teach students how to read literature, how to write about it, and why it matters. In partial answer to this question, this course is an introduction to the health humanities and narrative medicine in Spanish. Students will learn how narrative is central to empathy, to cultural competence, to the expression and processing of pain, sickness, and healing, and how developing the skills to interpret narratives and interact with them is key to promoting global health.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1250", "course_title": "HISPANIC CIVILIZATIONS", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1280", "course_title": "OVERVIEW OF LATIN AMERICAN LIT", "description": "Overview of Latin American literature", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1312", "course_title": "OVERVIEW OF SPANISH LINGUISTICS", "description": "This is a content course taught entirely in Spanish with the goal of developing students' competence beyond colloquial and formal registers toward an academic use of the language. It will examine various aspects of Hispanic linguistics such as phonology, phonetics, morphosyntax, semantics and pragmatics. Students will develop a basic of Hispanic linguistics in order to be able to critically evaluate other linguistic theories and studies in the future. Fields such as applied linguistics (both language acquisition and sociolinguistics) will be covered in order to observe the relationship between theory and current use of Spanish.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1315", "course_title": "SPANISH FOR PROFESSIONAL COMMUNICATIN", "description": "This course will present a variety of formal communication-related topics throughout the Hispanic world and help students begin to develop their professional profile in Spanish. The main objective is to introduce students to the Hispanic professional environment through formal Spanish terminology and usage, cultural practices, and professional communication. This class will be conducted in a seminar format, with a strong focus on conversation and writing. Students will also learn about the geographical, political, demographic and economic realities of Hispanic countries. In order to develop intercultural competence, students will be invited to make connections and comparisons between the US and Hispanic world. Moreover, students will engage with invited speakers and job interviewers from Latin America", "completed": false, "prereq_count": 2}, {"dept_code": "SPAN", "id": "1323", "course_title": "MEDICAL SPANISH", "description": "This course is intended for translators in training who desire experience in translating the types of medical documents professional translators handle \"on-the-job\". Course emphasizes acquisition of practical translation skills, and introduces basic medical principles and terminology, as they are used in medical texts.", "completed": false, "prereq_count": 0}, {"dept_code": "SPAN", "id": "1419", "course_title": "DRUGS, MONEY AND VIOLENCE: NARCO-CULTURE IN LATIN AMERICAN FILM", "description": "This course explores the complex, multi-layered, and often contradictory world of transnational narcotics traffic particularly as it is configured in and through contemporary Latin American cinema. Departing from the contention that the relations between drug trafficking networks, governmental responses to the drug trade, drug production and consumption, are not clear and transparent as depicted in dominant discourses exemplified by the narrative of the War on Drugs, this course analyzes narco-culture not as a simplistic response centered merely on the idolization of drug lords or drug culture, but as a dynamic creative current that tries to make sense of the complexity and violence of the world of drugs. Why do official narratives of capitalist enterprise disavow the capitalist foundation of the drug trade? How are discourses of security and protection ironically embodied in violent militarized actions and neo-imperial ventures? How does the criminalization of certain cultural practices and symbols - particular languages, dress codes, music - relate to the racialization and sexualization of certain peoples and bodies? Moreover, how can we understand the (global) commercial success of narco-culture as exemplified by recent mainstream media and popular culture? In this course, we will address these questions by engaging in close reading/viewing of contemporary Latin American films that center on representations and (re)productions of narco-culture. These primary works will be examined in conjunction with secondary readings that discuss topics relevant to our analysis of narco-culture, such as globalization, neoliberal capitalism, immigration, femicides, cultural appropriation, and racial and gender construction.", "completed": false, "prereq_count": 1}, {"dept_code": "SPAN", "id": "1423", "course_title": "SEXUAL DIVERSITY IN LATIN AMERICAN LITERATURE AND CULTURE", "description": "This course covers ways in which sexuality is constructed in Latin American cultural texts (novels, short fiction, poetry, printed media, theater, film and popular culture) from the late nineteenth to early twenty-first century.", "completed": false, "prereq_count": 1}, {"dept_code": "SPAN", "id": "1435", "course_title": "POETICS OF BILINGUALISM", "description": "Concentrating on what is bilingualism, and after reviewing its historical and cultural parameters in Latin America, we will study the violent encounter between the Indigenous languages and the languages brought by the Conquistadores (Spanish, English, French, Portuguese), and its impact on the formation of the nation, class relations, race and language. This will be a non-chronological account of the cultural and linguistic genocides, encounters, shocks and invasions from the times of La Malinche, Sor Juana, and other authors to Latino Writing Today. Theories of Francine Massiello, Doris Sommer, and Juan Flores will be examined, as well as authors such as Sylvia Molloy, Octavio Paz, Esmeralda Santiago, Luis Rafael Sánchez, Guillermo Gómez Peña, Pedro Pietri, Dolores Prida Gloria Anzaldúa, and Lhasa di Sela, among others. We will explore questions regarding bilingualism, language and nation formation, translation studies, border studies, and minority writing. Discussion on the importance of bilingualism in a globalized world, as well as issues conforming publication and expectations on Latino writing will also be addressed.", "completed": false, "prereq_count": 1}, {"dept_code": "SPAN", "id": "1436", "course_title": "NATURE AND THE ENVIRONMENT IN HISPANIC LITERATURE AND CULTURE", "description": "The human imagination has long been captivated by nature and compelled to express it in art. In an age of a global environmental crisis, we turn to our own cultural production to make sense of nature, to wonder whether we can survive it, or whether it can survive us. Literature explores whether humans can achieve harmony with nature, questions what, if any, of our most human, most artificial trappings can coexist with the natural world. Environment has shaped the cultural production-and vice versa- of Latin America and the global reaches of the former Spanish empire. From the aquatic engineering that made the city of México-Tenochtitlán possible and Spanish colonizers' aspirations of earthly paradise to the 21st-century climate migrants of the Dry Corridor of Central America and the hurricanes of the Caribbean and Gulf of Mexico and tsunamis of the Philippines, the persistent tension between humans and nature spans centuries and continents. In this course, we will trace the depiction of nature and the environment as well as environmental issues in global Hispanic literature and cultural production (to include visual art, music, and performance). Using the theoretical framework of ecocriticism, we will analyze these works to ask what they contribute to environmental understanding and action.", "completed": false, "prereq_count": 1}, {"dept_code": "SPAN", "id": "1459", "course_title": "MAPPING THE FEMALE BODY: A CULTURAL APPROACH TO WOMEN'S HEALTH IN THE HISPANIC WORLD", "description": "This course provides an overview of the female body and women's health in Latin America and Spain from a cultural perspective, which addresses related social implications and health rights. Students will analyze women's health issues through critical interpretation of literary texts, poems, movies, documentaries, and photography using media perspectives and theoretical approaches. Students will be exposed to topics across four overarching themes: adolescence, reproduction, illness, and aging, with subtopics such as sexuality, sexual orientation, gender identities in relation to transgender and intersex issues, pregnancy, infertility, breast cancer, menopause, and eating disorders, among others. At the same time, students will be exposed to a broader geographical and historical panorama by examining the relationship between women's health issues to the political and cultural issues of different countries in the Hispanic world. Based on these particular contexts, communities, and identities, we will try to answer the question why these women's issues happened in those regions and within specific communities. Students will be expected to engage in critical discussions, and will be given the opportunity to connect and contrast these issues with their own cultural experience.", "completed": false, "prereq_count": 1}, {"dept_code": "SPAN", "id": "1470", "course_title": "THE INCAS: ANDEAN INDIGENOUS PEOPLES AND SPANISH COLONIAL RULE", "description": "", "completed": false, "prereq_count": 1}], "links": [{"source": "0120", "target": "1315"}, {"source": "0125", "target": "1315"}, {"source": "1250", "target": "1419"}, {"source": "1250", "target": "1423"}, {"source": "1250", "target": "1435"}, {"source": "1250", "target": "1436"}, {"source": "1250", "target": "1459"}, {"source": "1250", "target": "1470"}]}