{"nodes": [{"dept_code": "ASL", "id": "0102", "course_title": "AMERICAN SIGN LANGUAGE 2", "description": "Students will learn more difficult vocabulary (signs) and how to use them in one-to-one, small group, and large group communication. Students will also be exposed to classifier constructions. This course is a continuation of ASL I (LING 0471) and it utilizes a similar curriculum.", "completed": false}, {"dept_code": "ASL", "id": "0104", "course_title": "AMERICAN SIGN LANGUAGE 4", "description": "This advanced course of ASL concentrates on developing more precise skills and competencies by using appropriate variations of ASL (regional, racial/ethnic, stylistic and age related) vocabulary. Students will also be given the opportunity to use ASL by volunteering in the deaf community.", "completed": false}, {"dept_code": "ASL", "id": "1615", "course_title": "DEAF CULTURE", "description": "Many deaf people in the U.S. Are united by a language (ASL) that differs from English and a culture with characteristics that differ from those of the larger hearing society. This culture is known as deaf culture, and students in this course will be introduced to various facets of American deaf culture through readings, videos, and discussions. Students will also explore other deaf cultures throughout the world. Among the course foci are: issues of accessibility, perspectives of deaf versus hearing individuals, and various examples of deaf literature.", "completed": false}, {"dept_code": "ASL", "id": "1625", "course_title": "THE DEAF AND SOCIETY", "description": "The culture of deaf Americans is distinct from that of mainstream American society. The primary focus of this course is to expose students to the culture of the deaf in the United States and around the world. In addition to teaching students how to interact with the deaf in a culturally appropriate way, the course will help them understand deaf culture as part of human diversity. Among the course foci are: issues of accessibility, perspectives of deaf versus hearing individuals, and various examples of deaf literature.", "completed": false}, {"dept_code": "ASL", "id": "1715", "course_title": "STRUCTURE OF ASL AND ENGLISH", "description": "", "completed": false}, {"dept_code": "ASL", "id": "1909", "course_title": "TOPICS IN SIGN LANGUAGE STUDIES", "description": "", "completed": false}], "links": [{"source": "0102", "target": "1615"}]}