{"nodes": [{"dept_code": "STAT", "id": "0200", "course_title": "BASIC APPLIED STATISTICS", "description": "This course teaches methods of descriptive and inferential statistics. Topics include data collection and description, hypothesis testing, correlation and regression the analysis of variance, and contingency tables. Students will learn how to use a statistical computer package.", "completed": false}, {"dept_code": "STAT", "id": "0800", "course_title": "STATISTICS IN THE MODERN WORLD", "description": "The course introduces statistical reasoning to a diverse audience. The main goal is the understanding of some basic statistical principles so that the student can understand research reports involving statistics and applications of statistics reported in the media. Statistical reasoning will be taught through the use of examples. An important part of the course will be a nontechnical discussion of controlled and randomized experiments. The subject matter will emphasize examples from the health and social sciences.", "completed": false}, {"dept_code": "STAT", "id": "1000", "course_title": "APPLIED STATISTICAL METHODS", "description": "This course is an intensive introduction to statistical methods. It is designed for students who want to do data analysis and to study further ideas in applied statistics beyond this course. The topics covered include descriptive statistics, elementary probability, random sampling, controlled experiments, hypothesis testing, regression and the analysis of variance. Emphasis will be placed on the statistical reasoning underlying the methods. Students will also become proficient at the use of a statistical software package.", "completed": false}, {"dept_code": "STAT", "id": "1100", "course_title": "STATISTICS AND PROBABILITY FOR BUSINESS MANAGEMENT", "description": "This is a one-term introduction to statistics and probability. Both modeling and data analysis will be emphasized. Various probability models for discrete and continuous variables will be analyzed. Inferential, descriptive and data analysis techniques will be covered with examples from management. A statistical package will be introduced and used to conduct data analyses.", "completed": false}, {"dept_code": "STAT", "id": "1152", "course_title": "INTRODUCTION TO MATHEMATICAL STATISTICS", "description": "This course is continued from STAT 1151, Introduction to Probability, and brings together the elementary concepts of statistical inference, which are essential for advanced statistical methods. A brief review of probability theory will be provided at the beginning. Topics include functions of random variables; sampling distributions and order statistics; methods of point and interval estimation for variances and differences in two means and proportions; properties of estimators and their applications; theory and applications of hypothesis testing including the Neyman-Pearson lemma, power function of a test, and likelihood ratio tests; regression; and analysis of variance.", "completed": false}, {"dept_code": "STAT", "id": "1221", "course_title": "APPLIED REGRESSION", "description": "This course covers simple linear regression (one variable) and one way analysis of variance followed by more complicated regression models. More complex ANOVA models are treated if time permits. Some computer applications will usually be considered.", "completed": false}, {"dept_code": "STAT", "id": "1223", "course_title": "APPLIED REGRESSION WRITING COMPONENT", "description": "This course satisfies the writing course requirement for statistics majors and must be taken in conjunction with STAT 1221 applied regression.", "completed": false}, {"dept_code": "STAT", "id": "1231", "course_title": "APPLIED EXPERIMENTAL DESIGN", "description": "This course teaches students to design valid statistical experiments and to analyze them. Among the designs considered are completely randomized designs, randomized block designs, Latin lemmas, factorial designs, and complete block designs.", "completed": false}, {"dept_code": "STAT", "id": "1311", "course_title": "APPLIED MULTIVARIATE ANALYSIS", "description": "We start with the basic concepts of regression and correlation. After developing the necessary linear algebra, we will study the multivariate normal and then go on to do one or more of the following: cluster analysis, discriminant analysis, directional data, and factor analysis. We will make use of the Minitab and BMDP computer packages.", "completed": false}, {"dept_code": "STAT", "id": "1361", "course_title": "STATISTICAL LEARNING AND DATA SCIENCE", "description": "This course is designed to provide a broad introduction to the field of data science and to expose students to many of the statistical tools most commonly used by modern data scientists. We will explore a wide variety of models and algorithms in a data-driven fashion. Topics will include modeling", "completed": false}, {"dept_code": "STAT", "id": "1632", "course_title": "INTERMEDIATE MATHEMATICAL STATISTICAL", "description": "This course is the second half of a two term course. Topics to be covered include estimation, inference, linear models, and an introduction to Bayesian estimation.", "completed": false}, {"dept_code": "STAT", "id": "1731", "course_title": "STOCHASTIC PROCESSES", "description": "This course provides an introduction to stochastic processes and its applications. The major topics are Markov chains, Poisson processes, Brownian motion, and branching processes.", "completed": false}], "links": [{"source": "0200", "target": "1221"}, {"source": "0200", "target": "1223"}, {"source": "0200", "target": "1231"}, {"source": "1221", "target": "1311"}, {"source": "1221", "target": "1361"}]}