{"nodes": [{"dept_code": "EM", "id": "1102", "course_title": "EMERGENCY MEDICINE TECHNICIAN", "description": "This course providesÂ learners with the cognitive knowledge and values to develop as an emergency medical professional at the basic life-support level. This course meets allÂ minimum training requirements as established by the U.S. Department of Transportation in the EMT, National Education Standards. This course provides the learner with the opportunity to develop basic life-support psychomotor skills. Successful completion of this course makes the learner eligible to become certified by the National Registry of EMT's and the Pennsylvania Department of Health.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1113", "course_title": "PHARMACOLOGY", "description": "Introduces students to the categories of pharmacological agents and the application of pharmacological concepts to clinical practice. Emphasis will be placed on understanding physiologic medication action. A separate medication lab is offered.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1117", "course_title": "EMS OPERATIONS", "description": "Designed to expose the paramedic student to various field operations procedures. Topics include: medical incident command, rescue awareness and operations, hazardous materials awareness and operations, and crime scene awareness.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1123", "course_title": "CARDIOLOGY LAB", "description": "This lab section, in conjunction with the Assessment-Based Management Lab, provides case-based learning for the students related to general adult emergencies. Students will participate in case-based sessions that allow them to work on a simulated patient that is suffering from a specific illness or injury and allows the students to develop strong patient, resource, and scene management skills that they can take with them into their field practice. This lab helps to promote strong clinical decision-making skills that will allow the students to function as a strong clinical provider in the field.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1124", "course_title": "ADULT MEDICAL EMERGENCIES", "description": "This course focuses on pre-hospital assessment and therapeutic intervention of acute and chronic adult pathophysiology. Students will explore the different processes of patient care for special populations across the life span. Learning strategies include scenario-based case presentations with a focus on critical thinking and decision making. This course is paired with a required lab component.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1125", "course_title": "OB/GYN, NEWBORN, AND PEDIATRIC CARE", "description": "This course covers the specific pathophysiology, assessment, and management of common medical and trauma conditions in pediatric patients. Additional information regarding obstetrics, neonates, and gynecologic patients will be presented.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1126", "course_title": "ASSESSMENT-BASED MANAGEMENT", "description": "This lab section, in conjunction with the Cardiology Lab, provides case-based learning for students related to general adult emergencies. Students will participate in case-based sessions that allow them to work on a simulated patient that is suffering from a specific illness or injury and allows the students to develop strong patient, resource, and scene management skills that they can take with them into their field practice. This lab helps to promote strong clinical decision-making skills that will allow the students to function as a strong clinical provider in the field.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1131", "course_title": "CLINICAL 1", "description": "Designed to accompany the fall semester courses, these clinical rotations focus on the development and documentation of history taking and assessment skills. Additionally, psychomotor skill development in a clinical setting is emphasized.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1132", "course_title": "CLINICAL 2", "description": "Designed to accompany the spring semester courses, these clinical rotations focus on the integration of psychomotor skills with assessment and history taking. In addition to scheduled rotations students will spend the last weeks completing a summative field evaluation. This evaluation consists of 80 field hours with the student functioning as a primary care provider.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1135", "course_title": "CRITICAL CARE CLINICAL EXPERIENCE I", "description": "The sequential critical care courses offered within the EM Program provides a solid foundation for understanding the principles of critical care. Students with only out of hospital clinical practice have little foundation to understand the in hospital critical care environment. The addition of diagnostic testing and hemodynamic monitoring provides for a more tailored and timely response to the patient's clinical needs. Students can gain an appreciation for these interactions while in an observational role through case study and with the support of a critical care preceptor.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1160", "course_title": "PROFESSIONAL ISSUES", "description": "This course will provide the student with the tools necessary to promote the long-term viability of an EMS service. This course has been designed to prepare the student to be a leader of traditional or entrepreneurial EMS opportunities. Guest speakers will be utilized for their expertise in the administration of EMS agencies.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1164", "course_title": "EMS SPECIAL RESPONSE SITUATIONS", "description": "An elective course for seniors introducing students to the various responses they may encounter during specialized events or a disaster. The student will be introduced to the unique EMS systems, hazards and treatment considerations that occur in these often austere environments. This is an introductory course and is not a replacement of specialized courses on the various topics or disciplines.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1166", "course_title": "SENIOR INTERNSHIP", "description": "The senior internship is designed to allow students to gain valuable experience in an educational, clinical, or administrative aspect of health care. Students are asked to find internships in their specific area of health care interest. The internship can take place domestically or internationally.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1168", "course_title": "LEADERSHIP IN HEALTH CARE", "description": "Through reading, review, and discussion of germane reference materials, this class will explore the components of leadership for industry, organizations, and individuals as applicable to U.S. health care in general, and more specifically, to emergency medical services as part of the health care system.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1171", "course_title": "CRITICAL CARE MEDICINE 2", "description": "This course provides a foundational review and focuses on advanced assessment and therapeutic intervention common in the critical care setting for both adult and pediatric patients. Emphasis is placed on continuum of critical care interventions during inter­-facility transport. The course follows elements of the ASTNA core curriculum outline and the PA DoH Pennsylvania Air Ambulance Transport Educational Program guidelines. Topics highlighted include intra-aortic balloon pump management, advanced shock management, and initiation and maintenance of the mechanically ventilated patient. Learning strategies include lectures with case presentations and a focus on critical thinking and decision making. EM 1170 is a prerequisite course.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1176", "course_title": "SENIOR INTERNSHIP - WEB", "description": "The Senior Internship is designed to allow students to gain valuable experience in an educational, clinical, or administrative aspect of health care. Students are asked to find internships in their specific area of health care interest. The internship can take place domestically or internationally.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1177", "course_title": "SENIOR SEMINAR", "description": "Senior Seminar requires students to create a scholarly paper and presentation. Students are permitted to utilize the information gained during their internship if they desire. Students can also develop new materials based upon an approved topic in any health care area of interest to them.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1178", "course_title": "LEADERSHIP IN HEALTH CARE-WEB", "description": "Through reading, review, and discussion of germane reference materials, this class will explore the components of leadership for industry, organizations, and individuals as applicable to US health care in general, and more specifically, to Emergency Medical Services as part of the health care system.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1179", "course_title": "HEALTH CARE MANAGEMENT - WEB", "description": "The purpose of the course is to provide an introduction to the basic concepts of managing in organizations with a particular focus on health care organizations. The concepts will be studied in the context of their practical application.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1181", "course_title": "PROFESSIONAL ISSUES - WEB", "description": "This course will provide the student with the tools necessary to promote the long-term viability of an EMS service. This course has been designed to prepare the student to be a leader of traditional or entrepreneurial EMS opportunities. Guest speakers will be utilized for their expertise in the administration of EMS agencies.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1182", "course_title": "CRITICAL CARE MANAGEMENT - WEB", "description": "This course provides a foundational review and focuses on advanced assessment and therapeutic intervention common in the critical care setting for both adult and pediatric patients. Emphasis is placed on continuum of critical care interventions during inter­-facility transport. The course follows elements of the ASTNA core curriculum outline and the PA DoH Pennsylvania Air Ambulance Transport Educational Program guidelines. Topics highlighted include intra-aortic balloon pump management, hemodynamic monitoring and pharmacology, and initiation and maintenance of the mechanically ventilated patient. Learning strategies include lecture with case presentations and a focus on critical thinking and decision making.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1184", "course_title": "SENIOR SEMINAR - WEB", "description": "Senior Seminar requires students to create a scholarly paper and presentation. Students are permitted to utilize the information gained during their internship if they desire. Students can also develop new materials based upon an approved topic in any health care area of interest to them.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1186", "course_title": "CERTIFIED AMBULANCE CODER - WEB", "description": "This course is designed to provide the student with a comprehensive understanding of the complex rules and requirements related to effective and compliant ambulance billing. The course focuses on a baseline of critical knowledge and commitment to excellence necessary to be a well-informed, conscientious, and compliant ambulance billing professional.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1187", "course_title": "ORGANIZATIONAL THEORY - WEB", "description": "Through didactic and practical sessions, students will have the opportunity to discover organizational theory and to evaluate an EMS agency. Through this course students will learn about the 11 components of an EMS system and how to use them to evaluate an EMS system.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1251", "course_title": "MOBILE INTEGRATED HEALTH CARE", "description": "Part two of the community paramedic introductory course will introduce therapeutic communication techniques that are essential for chronic disease management and the coordination of services needed to avoid the unnecessary utilization of EMS and hospital services. This course will discuss the business models used across the country for community paramedicine programs and the documentation methods used, as well as, how to design a program, and how to effectively become a patient advocate to help navigate the patient through the changing health care system.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1260", "course_title": "COGNITIVE PSYCHOLOGY OF DECISION MAKING", "description": "Health care providers make dozens of clinical decisions every day. Errors in cognitive processes have been determined to be one of the most common causes of preventable death and disability in this country. The goal of this class is to examine the current science of decision making and the barriers to optimal decision making. Students will learn to recognize System I and System II thinking and the benefits and limitations of each. Unconscious cognitive biases and heuristics that are commonly relied upon in everyday thinking, as well as professional decisions, will be analyzed. The class will be taught in seminar fashion with active learning and discussion.", "completed": false, "prereq_count": 0}, {"dept_code": "EM", "id": "1271", "course_title": "MOBILE INTEGRATED HEALTH CARE - WEB", "description": "Part two of the community paramedic introductory course will introduce therapeutic communication techniques that are essential for chronic disease management and the coordination of services needed to avoid the unnecessary utilization of EMS and hospital services. This course will discuss the business models used across the country for community paramedicine programs and the documentation methods used, as well as, how to design a program, and how to effectively become a patient advocate to help navigate the patient through the changing health care system.", "completed": false, "prereq_count": 0}], "links": []}