{"nodes": [{"dept_code": "AFROTC", "id": "0002", "course_title": "HERITAGE AND VALUE OF US AIR FORCE 2", "description": "This course is the second of a two semester sequence dealing with the U.S. Air force in the contemporary world. The sequence focuses on the basic characteristics of air doctrine; strategic offensive and defense, general purpose, and aerospace support forces; and officer ship.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "0004", "course_title": "TEAM AND LEADERSHIP 2", "description": "This course is the second of a two semester sequence which surveys the history of air power from balloons and dirigibles through the jet age. It focuses on factors contributing to change in the nature of military conflict; the development of air power and the evolution of air power doctrine and concepts; and the role of technology in the growth of air power.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "0005", "course_title": "FRESHMAN LEADERSHIP LAB", "description": "The as100 and as200 leadership laboratory courses (LLABS) include a study of air force customs and courtesies, drills and ceremonies, and military commands. The LLAB also includes studying the environment of an air force officer and learning about areas of opportunity available to commissioned officers.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "0006", "course_title": "SOPHOMORE LEADERSHIP LAB", "description": "The as100 and as200 leadership laboratory courses (LLAB) include a study of air force customs and courtesies, drill and ceremonies, and military commands. The LLAB also includes studying the environment of an air force officer and learning about areas of opportunity available to commissioned officers.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "1005", "course_title": "JUNIOR LEADERSHIP LAB", "description": "The as300 and as400 LLABS consist of activities classified as leadership and management experiences. They involve the planning and controlling of military activities of the cadet corps, and the preparation of briefings and other oral and written communications. LLABS also include interviews, guidance, and information which will increase the understanding, motivation, and performance of other cadets.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "1006", "course_title": "SENIOR LEADERSHIP LAB", "description": "The as300 and as400 LLABS consist of activities classified as leadership and management experiences. They involve the planning and controlling of military activities of the cadet corps, and the preparation of briefings and other oral and written communications. LLABS also include interviews, guidance, and information which will increase the understanding, motivation, and performance of other cadets.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "1014", "course_title": "LEADING AND COMMUNICATIONS 2", "description": "This is the second of a two-semester integrated management course emphasizing the concepts and skills required by the successful manager and leader. It also includes instruction on communication skills and military ethics. The curriculum encompasses individual motivational and behavioral processes, leadership, communication, and group dynamics within the context of a military organization.", "completed": false, "prereq_count": 0}, {"dept_code": "AFROTC", "id": "1016", "course_title": "NATIONAL SECURITY FORCES", "description": "This course is the second of two semester sequence surveying key issues of U.S. National security. The second semester focuses on the soviet union and major regional issues of importance to U.S. National interests. It also includes instruction on the military as a profession, Officership, and the military justice system.", "completed": false, "prereq_count": 0}], "links": []}