{"nodes": [{"dept_code": "GER", "id": "0101", "course_title": "BEGINNING GERMAN 1", "description": "This is the first part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will be working towards the A1-level of the Common European Framework of Reference. Students should plan to take German 0102 during the following semester.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0102", "course_title": "BEGINNING GERMAN 2", "description": "This is the second part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will be working towards the A2-level of the Common European Framework of Reference. Students should plan to take either German 0103 or German 0203 during the following semester.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0103", "course_title": "BEGINNING GERMAN 3", "description": "This is the third part of our elementary language course sequence. In these proficiency-oriented courses students begin to learn how to communicate in German. The course emphasizes all four skills - speaking, listening, reading, and writing - and introduces students to the culture of the German-speaking countries. Students will continue to work towards the A2-level of the Common European Framework of Reference. Students should plan to take German 201 during the following semester", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0201", "course_title": "INTERMEDIATE GERMAN 1", "description": "This is the first part of our intermediate language course sequence. These courses will provide students with opportunities to further develop their listening, speaking, reading and writing skills, to strengthen their grammatical knowledge and expand their vocabulary. Students will begin to work towards the B1-level of the Common European Framework of Reference. Students should plan to take German 202 during the following semester", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "0202", "course_title": "INTERMEDIATE GERMAN 2", "description": "This is the second part of our intermediate language course sequence. These courses will provide students with opportunities to further develop their listening, speaking, reading and writing skills, to strengthen their grammatical knowledge and expand their vocabulary. Students will continue to work towards the B1-level of the Common European Framework of Reference.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1001", "course_title": "GERMAN WRITING", "description": "This course is designed to strengthen the student's composition skills through constant practice in writing, revising, and editing. The goal is to be able to express thoughts effectively in correct and well-structured German prose, including business correspondence. Strong emphasis is put on problems of stylistics, including punctuation, sentence structure, word usage, and figures of speech.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1005", "course_title": "GERMAN MEDIA", "description": "In this course, students will strengthen their knowledge of existing grammatical structures and will examine the specific aspects of daily life in Germany via contemporary electronic and print genres. The latter will include online articles and hard copy news sources and a range of daily and weekly news sources. Class discussions, debates, oral reports, and short written assignments will also be based on topics derived from current podcasts, social networking sites, television advertisements and online series, and from new documentary and feature films.", "completed": false, "prereq_count": 1}, {"dept_code": "GER", "id": "1010", "course_title": "COFFEE AND THE NEWS: ADVANCED GERMAN CONVERSATION", "description": "This is a 1-credit conversation class for post-intermediate students of German who would like to practice their German and familiarize themselves with current events in German-speaking lands. You will practice advanced conversational German while discussing current issues in German-speaking Europe. You will meet with an instructor one hour each week and discuss issues from a variety of media (newspapers, magazines, podcasts, etc.). Prerequisites: GER 0202, GER 0205, or equivalent. Please speak with the Director of Undergraduate Studies in German if you have not taken either of these courses.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1108", "course_title": "GREEN GERMANY", "description": "A course for advanced intermediate students of German (B1+ level according to", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1228", "course_title": "LITERATURE AND CULTURE 1830-1890", "description": "Major literary and cultural documents from between about 1830 and 1890 are analyzed both formally and thematically in order to understand them in their social and historical contexts. Primary readings are in German.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1500", "course_title": "GERMANIC MYTHS, LEGENDS AND SAGAS", "description": "This course presents a survey of Northern European cultural values from about 500 B.C. To about 1500 A.D. Sources include archaeological finds, sagas, ballads, legends, customs, superstitions, place names, and language expressions. Topics include social organization, distribution of labor and wealth, the position of women and children in family and society, and the uses of supernatural beliefs to achieve worldly goals. Where appropriate, parallels will be drawn between modern Northern European values and their formative myths from the distant past.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1502", "course_title": "INDO-EUROPEAN FOLKTALES", "description": "German 1502 is a study of the esthetic, psychological, and social values reflected in a variety of European folklore genres, including magic tales, legends, proverbs, superstitions, and jests. The Grimms' pioneering collections constitute the course's nucleus, but it draws numerous supporting examples from other European countries as well.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1506", "course_title": "THEORIES & PRACTICES OF WORK IN GLOBAL PERSPECTIVE", "description": "Whether positively connoted as an ennobling activity engendering human self-consciousness and liberty (Hegel) or as toil and drudgery, work/labor is central to individual and collective human existence. We need to expend our physical and mental capacities to sustain our own lives as well as the lives of others. Work, therefore, has profound significance for the constitution of the individual self as well as for the organization of our society. Hence, work has been the human activity and site of struggle for freedom and equality from the beginning of human history to today's demand for Social Justice. This course combines social philosophy and case studies of working conditions across the globe for engaging with the following questions. What is the justification for past and existing hierarchies of labor typically expressed in different pay and the lack thereof? What are the practical and ethical consequences of such labor hierarchies? What is the relationship between work and human dignity? What is the responsibility of the individual for working conditions domestically and globally? The course allows students to investigate the structures of the economy and choices we make as individuals has profound repercussions on our fellow human beings, in other words, we will recognize the interconnectedness of our world as a fundamental aspect of the human condition today. Theoretical readings range from Kant, Hegel, Marx and Arendt to current social theorists like Michael Hardt (Affective Labor), Maurizio Lazzarato (Immaterial Labor), Oskar Negt to Teju Cole and others. In addition, we will discuss documentaries and case studies on working conditions in our global economy. All materials and language of instruction are in English.", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1545", "course_title": "NAZI CULTURE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "GER", "id": "1550", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}], "links": [{"source": "0202", "target": "1005"}]}