{"nodes": [{"dept_code": "GSWS", "id": "0100", "course_title": "INTRODUCTION TO GENDER, SEXUALITY, AND WOMEN'S STUDIES", "description": "What is sex? What is gender? What is sexuality? How are these concepts related to culture? To nature? To help you answer these important questions, this course will introduce you to the exciting field of gender and sexuality studies. We will use a range of interdisciplinary concepts, tools, and methods to understand and analyze sex, gender, femininity, masculinity, and sexuality. Through readings, multimedia, and class discussion, we will study how gender and sexuality are socially and culturally constructed. In addition, we will consider how gender intersects with other identity categories such as race, class, ethnicity, nation, age, ability, and sexuality. Because we all have a gender and a sexuality, this course is crucial for any profession and for understanding the world around us. Taught in discussion-based sections, it is also a great opportunity for you to develop your written and oral skills. Also, you will learn to apply the critical vocabulary used in gender studies to other fields of study. The course is open to all students regardless of background and has no pre-requisite. As a prerequisite for more advanced courses in the GSWS program and as the intro course for current or future students in the GSWS major and minor, this course will prepare you for more advanced coursework. Check the individual section to determine whether the section is a 'W' section.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0150", "course_title": "GENDER IN THE PROFESSIONS", "description": "How are the goals and concerns of feminism relevant in a variety of workplaces? Why haven't women achieved equal pay for equal work, compared to men? What is unpaid labor, and why does it matter? Why should my organization create policies that support individuals regardless of gender identity, gender expression, and sexuality (and what do those terms mean, anyway?)? To help you answer these important questions, this course will take an introductory, intersectional approach to gender in the professions. We will use a range of interdisciplinary concepts, tools, and methods to understand and analyze sex, gender, and sexuality as they relate to the world of work. Through readings, multimedia activities, and class discussion, students will develop tools to critically analyze the ways in which social and cultural forces shape us as gendered individuals and influence our career aspirations, professional interactions, and service experiences. In addition, we will consider how gender and sexuality intersect with other identity categories such as race, class, ethnicity, nationality, age, and ability. Because we all have a gender and a sexuality, this course is crucial for any profession and for understanding the world around us.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0200", "course_title": "SEX, RACE, AND POPULAR CULTURE", "description": "Popular culture is often defined as a collection of ideas, images, beliefs and practices that have become an essential component of peoples' daily lives. While popular culture is dismissed by some as merely a mass consumer culture, others acknowledge that contemporary popular cultural forms may, in keeping with a history of once contemporary popular art, culture, and literature (e.g. Dickens, Warhol, etc.) Come to be understood as essential, canonical and elite. Ultimately, these materials may be read as a texts that inform our understanding of culture and social life and prompt such questions as: how does popular culture (re)construct our sense of \"ordinary\" life as something extraordinary? Why are some cultural forms dismissed and others more readily accepted? What social processes bring cultural forms into the public domain? This course will examine popular culture in a variety of forms such as: music, art, television, collectibles, internet, and social media. Students will consider examples from Western, non-Western, and \"global\" culture, but will use sex and sexuality, gender, and ideas of race to understand the relationship between popular culture, material culture, representation, and consumerism, and power and resistance. It will also address these phenomenon over time. This course will make especially strong use of contemporary and popular media such as video clips, internet media and images, and music.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0230", "course_title": "INTRODUCTION TO LGBTQ STUDIES", "description": "This course is an introduction to Lesbian, Gay, Bisexual, Trans and Queer (LGBTQ) Studies. Course readings will explore LGBTQ Studies from an interdisciplinary and intersectional perspective with a focus on how sexual orientation and gender shape human experience and access to privilege. Our work will foster a critical understanding of a range of issues in LGBTQ Studies, including LGBTQ as it relates to questions of sexual diversity, the legal history of LGBTQ lives, LGBTQ social movement, LGBTQ health, LGBTQ literature/art, LGBTQ history, global approaches to LGBTQ Studies, and theories and methods in LGBTQ studies. Students will choose a research topic in LGBTQ Studies and will develop a final paper that explores this topic using key concepts, theories, and methods in LGBTQ Studies. Final papers will also reflect on LGBTQ contributions to our understanding of human variation and diversity.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0400", "course_title": "GENDER AND SCIENCE", "description": "This course focuses on the interaction of gender and sexuality with science, medicine, and technology. The goal of this course is to assist students in developing an understanding of the ways in which science has constructed our understanding of gender and sexuality since the nineteenth century, as well as the lived experiences of people within the scientific community who shape and navigate these concepts. To accomplish this goal, we will apply feminist theory, including feminist critiques of the history of medicine, psychology, and science, and gender theory, to an investigation of the evolution of scientific knowledge regarding gender and sexuality, as well as race, disability, and health. We will also explore the ways in which people, especially women, people of color, and transpeople have interacted with technology, shaped scientific discourse. In each course lecture and discussion, we will focus on a broad range of scientific fields, discourses, and narratives to construct a comprehensive understanding of the scientific knowledge and identity in the modern world. While the readings focus largely on American and Western examples and experiences, class discussions and presentations will expand the scope of this class considerably, allowing students to understand the global relationship of gender and science.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0500", "course_title": "INTRODUCTION TO FEMINIST THEORY", "description": "This course is an interdisciplinary introduction to the feminist ideas and debates concerning gender, women and men, and their political, social and economic positions over the last two hundred years. While we will focus on the United States, there will be some engagement with global feminist perspectives on gender, race, class, and sexuality. In keeping with the activist nature of feminist theory, this course will approach 'theory' as attempts to answer fundamental questions about the power relations that structure our everyday lives and consciousness. Theory in this sense is a tool for thinking systematically about how the world works, and for constructing arguments about how it should work. Consequently, we will pay particular attention to the (de)construction of power in both public and private relations as we critically analyze texts, discuss and present ideas in class, and complete written analyses. Students will have opportunities to apply feminist theories to their work in their home disciplines.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "0550", "course_title": "SEX AND SEXUALITIES", "description": "How and why did sex and sexuality become subjects of study? How are our experiences of sex and sexuality shaped by a history of 'scientific' explorations of desire? Why has sexuality become so central to our understandings of identity? What was sex like before 'sexuality' was invented? This seminar explores these questions by approaching sex and sexuality as socially, historically, and culturally contingent concepts. We will consider sex and sexuality as they are related to other categories of identity, including race, class, ethnicity, nation, and ability. Our theoretical and historical investigations will create the groundwork for understanding and rethinking how sexuality is understood in culture today.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "1130", "course_title": "GENDERED BODIES", "description": "For centuries, the biological sciences have embraced the human body as a product of nature in need of study, measurement, and treatment. Much of this knowledge has contributed to discourses of \"normal\" and \"healthy\" bodies. However, contemporary social science and feminist perspectives offer alternative readings of the human body as a social construction based upon cultural conventions and perceptions of gender, race, class, and sexuality. As Lorber and others have argued, \"the result is a gendered body, produced for a gendered social world.\" This class will examine a wide variety of gendered social constructions of the human body at work, in sports, and in media images that reflect standards and ideals of \"beauty,\" \"health\" and \"deviance.\" We will also consider the meaning of gendered bodies in light of contemporary technologies - such as plastic surgery, steroids, infertility treatments - that help to reveal the ways in which males, females, and \"others\" become \"men\" and \"women.\"", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "1140", "course_title": "SPECIAL TOPICS", "description": "This upper-level course addresses a current topic in gender, sexuality, or women's studies. Topic varies by instructor.", "completed": false, "prereq_count": 1}, {"dept_code": "GSWS", "id": "1692", "course_title": "LGBTQ IN THE USA", "description": "With growing contemporary interest in LGBTQIA issues and student activism surrounding gender identity and sexuality, this course provides necessary historical context for understanding such political and cultural phenomena in 20th-century U.S. history. It charts the trajectory of different identities and sexualities (too often classified as transgressive or deviant) from the beginning of the century through post-World War II efforts to seek greater freedom and inclusion in American society.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "1715", "course_title": "FEEDING THE SOUL: FOOD, GENDER AND RELIGION", "description": "Food is sustenance and absolutely essential to life. But food is never simply about nutrition. Because it is fundamental to the human experience, food is also a medium for the expression of culture and social identity. Moreover, food relays complex social messages about gender, sexuality, and family. This course will examine and reflect upon these aspects of culture by exploring the particular relationship between religion, gender, and food in cross-cultural perspective as we investigate the role of feasting, fasting, food taboos, diets, etc. and their relationship to notions of spirituality. We will pay particular attention to regions of Asia, the Middle-East, Latin America, the Caribbean, and indigenous and marginalized peoples.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "1900", "course_title": "INTERNSHIP", "description": "An opportunity to extend academic training to a practical work experience in an area where the student has gained some expertise.", "completed": false, "prereq_count": 0}, {"dept_code": "GSWS", "id": "1910", "course_title": "CAPSTONE", "description": "Designed as a capstone, this course is a seminar that allows students to explore feminist theory and methodology in greater depth. We will pay particular attention to the current state of feminist theory as we consider future directions and challenges, and address the ways in which feminist theories and methodologies can inform research in other disciplines. Students will respond to a series of intense readings that focus on the intersections of feminist theory with other theoretical approaches, such as queer theory, environmental ethics, and critical race theory, among others. Using this theoretical foundation, students will construct a research project of their own design that will apply academic work to a \"real world\" setting and prepare students for careers and/or graduate study.", "completed": false, "prereq_count": 1}], "links": [{"source": "0100", "target": "1140"}, {"source": "0100", "target": "1910"}]}