{"nodes": [{"dept_code": "PHIL", "id": "0010", "course_title": "CONCEPTS OF HUMAN NATURE", "description": "An introduction to some ways in which ethical and social thought has been influenced by different views of human nature. Readings are from such authors as Plato, Hobbes, Rousseau, Marx, and Freud.", "completed": false}, {"dept_code": "PHIL", "id": "0012", "course_title": "CONCEPTS HUMAN NATURE/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"Concepts of Human Nature\".", "completed": false}, {"dept_code": "PHIL", "id": "0080", "course_title": "INTRODUCTION TO PHILOSOPHICAL PROBLEMS", "description": "An introduction to some classical problems of philosophy. Topics vary, but might include skepticism, free will, the existence of god, and the justification of ethical beliefs.", "completed": false}, {"dept_code": "PHIL", "id": "0210", "course_title": "HISTORY OF MODERN PHILOSOPHY", "description": "An introduction to the philosophical period from Descartes through Kant. Special attention is given to at least one rationalist, one empiricist, and Kant.", "completed": false}, {"dept_code": "PHIL", "id": "0212", "course_title": "HISTORY OF MODERN PHIOSOPHYL/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"History of Modern Philosophy\".", "completed": false}, {"dept_code": "PHIL", "id": "0300", "course_title": "INTRODUCTION TO ETHICS", "description": "This is an introductory course considering the question of one fundamental moral principle - right and wrong. The results are applied to moral problems of serious interest today.", "completed": false}, {"dept_code": "PHIL", "id": "0302", "course_title": "INTRODUCTION TO ETHICS/WRITING PRACTICUM", "description": "This practicum is the special writing recitation for the lecture course \"Introduction to Ethics\".", "completed": false}, {"dept_code": "PHIL", "id": "0450", "course_title": "THEORIES OF KNOWLEDGE & REALITY", "description": "This course gives a broad introduction to classic and contemporary work on central questions in metaphysics and epistemology. Central topics of concern will be the nature of reality and the possibility of knowledge. Along the way we will discuss skeptical arguments to the effect that knowledge of certain aspects of reality is impossible and classic and contemporary responses to them. We will also discuss a number of topics in metaphysics, which may include the nature of the self, time, the relationship between mind and body, the existence of god, and debates between materialists and idealists.", "completed": false}, {"dept_code": "PHIL", "id": "0460", "course_title": "INTRODUCTION TO PHILOSOPHY OF MIND", "description": "This course gives a broad introduction to contemporary work on the philosophy of mind. It will primarily focus on the nature of consciousness, the mind-body problem, and may include how we know the minds of other human beings, the nature of personal identity over time, as well as discussion of the theory of action.", "completed": false}, {"dept_code": "PHIL", "id": "0462", "course_title": "INTRODUCTION TO PHILOSOPHY OF MIND / WRIT LABORATORY", "description": "This writing laboratory is the special writing recitation for the lecture course \"Introduction to Philosophy of Mind\".", "completed": false}, {"dept_code": "PHIL", "id": "0500", "course_title": "INTRODUCTION TO LOGIC", "description": "An introduction to the concepts and methods of modern deductive logic. Propositional logic is emphasized, but quantificational logic is touched upon.", "completed": false}, {"dept_code": "PHIL", "id": "0610", "course_title": "PHILOSOPHY AND SCIENCE", "description": "An introductory course in philosophy of science.", "completed": false}, {"dept_code": "PHIL", "id": "0831", "course_title": "RELIGION AND RATIONALITY", "description": "Does--and should--religion have a role in the secular sphere? How does culture shape religion? Is faith compatible with reason? This course critically examines how both religious and nonreligious thinkers have navigated the question of the relation between faith and reason throughout the history of Western thought. Special attention will be paid to evaluating how the relationship between religion and philosophy developed within Christianity, Judaism, and Islam. A further emphasis will be given to how the relationship between religion and philosophy shapes the our approach to myth, race, gender, and science.", "completed": false}, {"dept_code": "PHIL", "id": "0840", "course_title": "SCIENCE AND RELIGION", "description": "Are science and religion at odds or harmonizable? Do they coincide or represent completely separate discourses? This course examines the relationship between science, rationality, faith, and religion. Special attention will be given to ancient creation narratives and their interpretation, historical dialogues regarding faith and reason in the Western monotheist faiths (Christianity, Judaism, Islam), the scientific revolution, and various approaches to evolutionary theory. We will also consider practical, contemporary issues such as neuroscience and religious practice, ecology and faith, and scientific views toward gender and race.", "completed": false}, {"dept_code": "PHIL", "id": "1040", "course_title": "ARISTOTLE", "description": "This is an advanced undergraduate course examining the basic concepts of Aristotle's metaphysics, physics, ethics and logic.", "completed": false}, {"dept_code": "PHIL", "id": "1075", "course_title": "PHILOSOPHY AND ANCIENT SCIENCE", "description": "An examination of philosophical issues arising in the development of ancient science.", "completed": false}, {"dept_code": "PHIL", "id": "1078", "course_title": "ISLAMIC PHILOSOPHY", "description": "An examination of the great philosophers of the classical period of Islam.", "completed": false}, {"dept_code": "PHIL", "id": "1183", "course_title": "MARX", "description": "An examination of the philosophy of Marx and his place in the history of philosophy.", "completed": false}, {"dept_code": "PHIL", "id": "1240", "course_title": "AMERICAN PRAGMATISM", "description": "This is an advanced undergraduate course in the \"classical\" American pragmatists, especially Pierce, James, Dewey, and Mead.", "completed": false}, {"dept_code": "PHIL", "id": "1290", "course_title": "TOPICS IN HISTORY OF PHILOSOPHY", "description": "Epistemology is the study of knowledge and its foundations. What is knowledge, and how are claims to knowledge justified? How much can we know, and how do we come to know anything? Empiricism is the view that sensory experience is the source of all our knowledge. Everything we know comes to us through the senses and everything we know requires sensory evidence in order to be justified. In short, all knowledge is empirical knowledge, according to empiricism. This view was at the heart of analytic philosophy as it emerged in the 20 th century. This course follows the historical development of empiricism from British Empiricism, through the logical positivism of Ayer, Schlick and Carnap. Additionally, we will explore some major challenges that have been posed to this theory.", "completed": false}, {"dept_code": "PHIL", "id": "1300", "course_title": "ETHICAL THEORY", "description": "An advanced undergraduate examination of various topics in ethical theory, such as ethical relativism, subjective and objective value, the relation of reason and ethics, ethical realism, utilitarianism and contractarianism, and virtues and vices.", "completed": false}, {"dept_code": "PHIL", "id": "1319", "course_title": "ETHICS AND SPORT", "description": "An examination of the ethical and social issues that arise in connection with sport.", "completed": false}, {"dept_code": "PHIL", "id": "1360", "course_title": "BIOMEDICAL ETHICS", "description": "This advanced undergraduate course examines a selection of ethical problems arising in medicine, such as euthanasia, abortion, and the allocation of resources, and/or ethical issues relating to other species, such as vegetarianism, animal rights, and possible interplanetary morality. The selection will vary from one offering of the course to the next.", "completed": false}, {"dept_code": "PHIL", "id": "1375", "course_title": "PHILOSOPHY AND LITERATURE", "description": "An examination of philosophical issues relating to literature and/or the literary character of philosophy.", "completed": false}, {"dept_code": "PHIL", "id": "1390", "course_title": "PHILOSOPHY OF LAW", "description": "This advanced undergraduate course examines a selection of philosophical questions that arise in connection with the theory and practice of law, including constitutional, criminal, and tort law. Topics might include such issues as the comparative role of judges and legislators in making law, the nature of justice, and the relation of law to morality.", "completed": false}, {"dept_code": "PHIL", "id": "1422", "course_title": "INTRODUCTION TO SEMANTIC THEORY", "description": "This course is designed to introduce students who have been exposed to linguistics and logic to contemporary work in the theory of meaning.", "completed": false}, {"dept_code": "PHIL", "id": "1555", "course_title": "RATIONALITY", "description": "This course will focus on an influential analysis of rationality: the game-theoretic notion, which has agents attempting to maximize their expected utility. We will consider the foundations of this approach, criticisms of it, and applications of it to several areas of philosophy (including political philosophy, philosophy of language, and philosophy of science).", "completed": false}, {"dept_code": "PHIL", "id": "1941", "course_title": "HONORS THESIS 2/MAJORS", "description": "This is the second term of course 1940.", "completed": false}, {"dept_code": "PHIL", "id": "1942", "course_title": "HONORS THESIS 3/MAJORS", "description": "This is a special directed study for senior philosophy majors who wish to write an honors thesis in one term.", "completed": false}], "links": [{"source": "0300", "target": "1300"}, {"source": "0500", "target": "1422"}]}