{"nodes": [{"dept_code": "MEMS", "id": "0031", "course_title": "ELECTRICAL CIRCUITS", "description": "Fundamental laws, principles, and analysis techniques for DC and AC linear circuits whose elements consist of passive and active components used in modern engineering practice, including the determination of steady-state and transient responses.", "completed": false}, {"dept_code": "MEMS", "id": "0040", "course_title": "MATERIALS AND MANUFACTURING", "description": "Manufacturing and processing of ceramics, metals, polymers and composites covering refining and synthesis, shaping methods, control of properties and process selection.", "completed": false}, {"dept_code": "MEMS", "id": "0048", "course_title": "THERMODYNAMICS OF MATERIALS", "description": "This course teaches the essentials of thermodynamics of materials, which concerns the basic concepts and principles of thermodynamics, and the application of thermodynamic principles to the analysis of multitude phenomena related to the behavior of materials. The course covers topics on the laws of thermodynamics, relation between work, heat and energy, entropy, free energy, phase equilibrium in one-component system, chemical reactions involving gases, and chemical reactions involving both solids and gases.", "completed": false}, {"dept_code": "MEMS", "id": "0051", "course_title": "INTRODUCTION TO THERMODYNAMICS", "description": "Basic concepts and interlinking relationships of thermodynamics, fluid mechanics and heat transfer; fluid statics; system and control volumes; thermodynamic properties; work and heat; first law of thermodynamics for control mass and control volume; integral forms of conservation of mass and momentum.", "completed": false}, {"dept_code": "MEMS", "id": "0071", "course_title": "INTRODUCTION TO FLUID MECHANICS", "description": "Fundamentals of fluid mechanics, with emphasis on inviscid and linearly viscous, incompressible fluids. Basic physical phenomena of fluid mechanics. Fluid kinematics. Governing equations (both integral and local forms). Exact solutions. Internal flows. Dimensional analysis and modeling.", "completed": false}, {"dept_code": "MEMS", "id": "1011", "course_title": "STRUCTURE AND PROPERTIES LAB", "description": "Experimental demonstrations of important structure-property relationships for metals, ceramics and polymers.", "completed": false}, {"dept_code": "MEMS", "id": "1014", "course_title": "DYNAMIC SYSTEMS", "description": "Modeling and analysis of physical systems. Time- and frequency-domain analyses; transient and steady state system response to various excitations; transfer function and state space model representations; Laplace and Fourier transforms.", "completed": false}, {"dept_code": "MEMS", "id": "1015", "course_title": "RIGID-BODY DYNAMICS", "description": "Dynamics of particles, systems of particles, and rigid bodies including energy and momentum methods, problems of varying forces and constraints, and relationship of motion to different reference frames.", "completed": false}, {"dept_code": "MEMS", "id": "1020", "course_title": "MECHANICAL VIBRATIONS", "description": "Review of free and forced vibrations of single-degree-of-freedom systems with and without damping, multi-degree of freedom systems, vibration isolation, nonlinear vibrations, LaGrange's equations, and vibration of continuous systems.", "completed": false}, {"dept_code": "MEMS", "id": "1028", "course_title": "MECHANICAL DESIGN I", "description": "Stress and deflection analysis; survey of mechanical design criteria; selection and applications of working stresses for ductile and brittle materials; static, fatigue, and impact loading and combination of stresses.", "completed": false}, {"dept_code": "MEMS", "id": "1029", "course_title": "MECHANICAL DESIGN II", "description": "Analysis and design of machine elements, components, and mechanical systems. Machine elements include shafts, keys, bearings, gears, belts, chains, springs, screws, and motors.", "completed": false}, {"dept_code": "MEMS", "id": "1033", "course_title": "FRACTURE MECHANICS FOR PRODUCT DESIGN AND MANUFACTURING", "description": "An introduction to the principles of fracture mechanics; the essential concepts underlying appropriate materials selection including the effects of shape selection for maximum performance; and the strengths and weaknesses inherent in the choice of, say, metals versus ceramics versus polymers, etc.", "completed": false}, {"dept_code": "MEMS", "id": "1038", "course_title": "FUNDAMENTALS OF ENGINEERING PROJECTS", "description": "This course will focus on the development of professional skills required for successful engineering projects. The central objective will be to prepare foundation skills relevant to the senior design course. Course topics will include: project management tools, professional standards and codes, prototype development, design for manufacturing, GD&T, oral presentation skills and presentation of engineering data.", "completed": false}, {"dept_code": "MEMS", "id": "1041", "course_title": "MECHANICAL MEASUREMENTS 1", "description": "Fundamentals of mechanical measurements including steady-state and dynamic signals, detector-transducer elements, signal conditioning and readout systems, standards, instrument calibration, statistical treatment of data, error analysis, and technical report writing.", "completed": false}, {"dept_code": "MEMS", "id": "1042", "course_title": "MECHANICAL MEASUREMENTS 2", "description": "Builds on the foundation of mechanical measurements provided in MEMS 1041 to provide students with the ability to properly design and perform an experiment on a complex mechanical system in order to determine specific characteristics or performance of that system. Specific material includes extended knowledge of statistics and error analysis, computer-based data acquisition, and technical communications.", "completed": false}, {"dept_code": "MEMS", "id": "1043", "course_title": "SENIOR DESIGN PROJECT", "description": "A major project involving literature search, planning, design, fabrication, experimentation, analysis, technical report, poster presentation, and presentation at a technical symposium is performed by a small team of students under the direction of a faculty advisor and corporate advisor on a project presented by the corporate advisor.", "completed": false}, {"dept_code": "MEMS", "id": "1049", "course_title": "MECHATRONICS", "description": "An introduction to mechatronics, or the interfacing of mechanical and electrical systems. Focus is on embedded controllers (Motorola 68hc11 and pic 16f84) and their programming, power and interfacing electronics, actuators, sensors, and integration of these components to create a complete functional mechatronic system.", "completed": false}, {"dept_code": "MEMS", "id": "1060", "course_title": "NUMERICAL METHODS", "description": "Introduction to numerical techniques for the solution of linear and nonlinear equations, numerical integration and differentiation, interpolation, ordinary and partial differential equations, and eigenvalue problems.", "completed": false}, {"dept_code": "MEMS", "id": "1063", "course_title": "PHASE TRANSFORMATION AND MICROSTRUCTURE EVOLUTION", "description": "Phase equilibria; binary and ternary system; phase rule; thermodynamics and phase diagrams; diffusion in materials; phase transformations; nucleation and growth kinetics; precipitation reactions; solidification; glass-forming systems; phase separation; displacive or martensitic transformations; microstructural development in metallic and non-metallic systems; electron theory of solids; zone theory; electrical and magnetic properties of materials.", "completed": false}, {"dept_code": "MEMS", "id": "1065", "course_title": "THERMAL SYSTEMS DESIGN", "description": "Design, analysis, and optimization of thermal systems. Systems analysis applied to heat exchanger, power conversion, air conditioning, refrigeration, and heat recovery systems. Economics, equation fitting, and thermal property evaluation is integrated into the simulation and optimization of thermal system designs.", "completed": false}, {"dept_code": "MEMS", "id": "1070", "course_title": "MECHANICAL BEHAVIOR OF MATERIALS", "description": "Theory of elasticity, stress, strain, constitutive equations, isotropic and anisotropic elasticity, wave propagation in brittle solids, time dependent deformation, viscoelasticity, vibrations, damping, anelasticity, creep, design of creep resistant microstructures, deformation of polymers, physics of fracture, fracture mechanisms, brittle fracture, ductile fracture, design of fracture-resistant microstructures.", "completed": false}, {"dept_code": "MEMS", "id": "1079", "course_title": "SENIOR MATERIALS RESEARCH PROJECT", "description": "A major project involving literature search, planning, experimentation, analysis, an oral presentation, and a final technical report. The project is either sponsored by the department or a local company and is conducted by an individual or a small team of students with a faculty adviser.", "completed": false}, {"dept_code": "MEMS", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "Seminars are designed to acquaint the student with aspects of engineering not normally encountered in classes and include a wide range of topics such as the significance of engineering as a profession and the relation of engineering to current social problems.", "completed": false}, {"dept_code": "MEMS", "id": "1086", "course_title": "MSE SEMINAR", "description": "Seminars are designed to acquaint the student with aspects of engineering not normally encountered in classes and include a wide range of topics such as the significance of engineering as a profession and the relation of engineering to current social problems.", "completed": false}, {"dept_code": "MEMS", "id": "1101", "course_title": "FERROUS PHYSICAL METALLURGY", "description": "This course will introduce the student to the thermomechanical processing of austenite in plain carbon, high strength low alloy steels, high formability sheet steels and high alloy and special steels. The course will also present the use of hot rolling as a thermomechanical treatment. The importance of thermomechanical treatment, microstructural control and mechanical properties will be presented.", "completed": false}, {"dept_code": "MEMS", "id": "1103", "course_title": "PRINCIPLES AND APPLICATIONS OF STEEL PROCESSING AND DESIGN", "description": "This course will present case studies of actual components used in commercial applications in the automotive, construction, oil and gas, and nuclear industries. This course will guide the student from the alloy selection, microstructural processing, and mechanical properties to the final fabrication steps.", "completed": false}, {"dept_code": "MEMS", "id": "1120", "course_title": "APPLIED ENGINEERING SIMULATION IN DESIGN", "description": "This course will focus on the development of critical thinking skills tailored to engineering simulation in mechanical design. Commonly used computational simulation tools including finite element analysis and computational fluid dynamics will be highlighted. Students will examine the role of simulation in product design and learn to recognize opportunities to integrate simulation-based analysis into traditional engineering analysis and design workflows. A term-long project will offer exposure to simulation tools and provide students the context to practice their skills in a complex design environment. Students are required to take the one-credit course MEMS 1121 Simulation Workshop concurrently.", "completed": false}, {"dept_code": "MEMS", "id": "1121", "course_title": "APPLIED ENGINEERING SIMULATION IN DESIGN", "description": "Provide an environment for hands-on learning of simulation software an an opportunity to interact with the simulation student community. Provide a mechanism for the discussion of special topics and for guest speakers. Develop practical simulation software skills.", "completed": false}, {"dept_code": "MEMS", "id": "1130", "course_title": "INTRODUCTION TO ADDITIVE MANUFACTURING OF MATERIALS", "description": "This class is targeted toward students who want to learn more about additive manufacturing in general, different additive manufacturing techniques, and how they can be used to produce parts out of a large variety of materials. We will cover the general difference between subtractive and additive manufacturing, introduce and detail the advantages and disadvantages of energy beam based and non-beam based additive manufacturing methods, and discuss which materials can be additive manufactured. We will also describe as-printed microstructures and properties and their improvement through post-processing. Furthermore, elements of characterization, testing and qualification will be introduced. If circumstances permit, students will be able to tour the Additive Manufacturing Research Laboratory at the Swanson School of Engineering and potentially compare different AM methods in hands-on demonstrations.", "completed": false}, {"dept_code": "MEMS", "id": "1163", "course_title": "CERAMIC MATERIALS", "description": "Structure of ceramics and glasses. Microstructures and their development. Properties, processing, and applications.", "completed": false}], "links": [{"source": "0031", "target": "1014"}, {"source": "0031", "target": "1041"}, {"source": "0031", "target": "1049"}, {"source": "0040", "target": "1130"}, {"source": "0048", "target": "1101"}, {"source": "0051", "target": "1065"}, {"source": "0051", "target": "1101"}, {"source": "0051", "target": "1120"}, {"source": "0051", "target": "1121"}, {"source": "1014", "target": "1020"}, {"source": "1014", "target": "1049"}, {"source": "1028", "target": "1029"}, {"source": "1028", "target": "1033"}, {"source": "1041", "target": "1042"}]}