{"nodes": [{"dept_code": "ARABIC", "id": "0102", "course_title": "MODERN STANDARD ARABIC 2/EGYPTIAN 2", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "0104", "course_title": "MODERN STANDARD ARABIC 4/EGYPTIAN 4", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "0106", "course_title": "MODERN STANDARD ARABIC 6/EGYPTIAN 6", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "0122", "course_title": "MODERN STANDARD ARABIC 2/LEVANTINE 2", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "0124", "course_title": "MODERN STANDARD ARABIC 4/LEVANTINE 4", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "1115", "course_title": "READINGS IN ARABIC", "description": "This course improves the proficiency of students of Arabic at the high intermediate level and above through reading and discussion of authentic Arabic texts. These texts will include both fiction (e.g. Excerpts from novels, short stories, etc.) And non-fiction (e.g. Newspaper articles, essays, political speeches, etc.) And will cover major areas of interest in Arabic writing, be they political, social or literary, and reflect the opinions of major Arabic authors on these issues.", "completed": false}, {"dept_code": "ARABIC", "id": "1615", "course_title": "ARABIC LIFE AND THOUGHT", "description": "The primary objective of the course is to introduce students to the cultures of the Arab world in order for them to understand the Arab character apart from stereotypes. The course will also examine the wide variety of ethnicities that are summarily defined as Arab. The main foci of the course will be the understanding of the contemporary Arab mind, the experiences that shaped it, and how Arabs convey it.", "completed": false}, {"dept_code": "ARABIC", "id": "1635", "course_title": "INTRODUCTION TO MODERN ARABIC LITERATURE", "description": "", "completed": false}, {"dept_code": "ARABIC", "id": "1645", "course_title": "GLOBAL ISSUES IN LITERATURE", "description": "This course is a great way to explore different cultures and understand modern global issues through reading the literature produced by different nations. This course traces topics of global impact in the fiction of countries around the world. The authors we will be discussing come from African, European and Asian cultures. The focus of the course will change from semester to semester.", "completed": false}], "links": []}