{"nodes": [{"dept_code": "ENGCMP", "id": "0150", "course_title": "WORKSHOP IN COMPOSITION", "description": "This course is designed to give students who have had limited experience with writing an opportunity to increase their control of written language and their confidence in performing academic inquiry, analysis and argument. Students write in response to weekly assignments, and instruction focuses on helping students to extend, revise, and edit their work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0151", "course_title": "WORKSHOP TUTORIAL", "description": "This course provides support for students who are taking ENGCMP 0150 workshop in composition. Students meet weekly with a writing center consultant to work on understanding and addressing writing assignments. Students can also expect to learn how to strengthen their writing at the sentence- and paragraph-levels. Students work one-on-one with a consultant, using the papers they produce in ENGCMP 0150 as materials for discussion.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGCMP", "id": "0152", "course_title": "ESL: WORKSHOP IN COMPOSITION", "description": "This course is designed to give students learning English as a foreign language an opportunity to develop their ability to write in English and their confidence in performing academic inquiry, analysis and argument. Students write in response to weekly assignments, and instruction focuses on helping students to extend, revise, and edit their work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0200", "course_title": "SEMINAR IN COMPOSITION", "description": "This introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. Specific reading and writing assignments may vary from section to section, but student writing will be the primary focus in all sections. The course is designed to help students become more engaged, imaginative, and disciplined composers.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0201", "course_title": "COMPOSITION TUTORIAL", "description": "This course is a series of tutorial sessions designed to help students with their writing at the sentence and paragraph levels. Students work one-on-one with a consultant in the writing center, using the papers they produce in ENGCMP 0200 as materials for discussion.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGCMP", "id": "0203", "course_title": "SEMINAR IN COMPOSITION: GENDER STUDIES", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include readings and writing activities that comment on gender difference and consider the ways in which language and culture construct socially acceptable gender and sexual norms.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0205", "course_title": "SEMINAR IN COMPOSITION: FILM", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include a series of films, along with discussions that focus on how films and other media shape the ways we view and understand the world.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0207", "course_title": "SEMINAR IN COMPOSITION: EDUCATION", "description": "Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This particular seminar will include readings that consider issues of teaching and learning in American education and may be of interest to those who plan to become teachers.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0208", "course_title": "SEMINAR IN COMPOSITION: SERVICE-LEARNING", "description": "Students will engage in service-learning, pairing meaningful service in the community with academic work. Discussions will focus on students' experiences and their reflections as guided by critical readings and short essay assignments. Essays will comprise the central course texts, and weekly work will include reading and discussing the essays that students produce for this course.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0212", "course_title": "SEMINAR IN COMPOSITION: TOPICS IN DIVERSITY", "description": "Seminar in Composition is a course taken by almost all undergraduates at the University of Pittsburgh. Its goals are to help you engage in writing as a creative, disciplined form of critical inquiry; compose thoughtfully crafted essays that position your ideas among other views; write with precision, nuance, and awareness of textual conventions; and revise your writing by rethinking the assumptions, aims, and effects of prior drafts. This seminar will include readings and writing activities that explore concepts and practices relating to diversity and its established and emerging definitions. Your section may address, for example, issues like race, gender, sexuality, ethnicity, religious difference, differences in abilities, and economic disparities. You can expect to identify and analyze assumptions about difference, study how texts can generate and perpetuate such assumptions, and explore the consequences of such assumptions. You will also learn how to research and compose with attention to difference. We will read a challenging set of essays to frame our work in the course, but the key texts will be your own writings and those of your classmates. Your focus on student writing will be detailed: you will work closely with the papers that you and your fellow classmates have written, trying to think of ways to make them more precise, interesting, organized, complex, and reflexive. This course is an opportunity to learn how to use reading (published texts, the papers of your classmates, and readers' comments) to help you work on your writing and how to use writing to help you strengthen ways of reading and thinking. Like other seminars in composition, this introductory course offers students opportunities to improve as writers by developing their understanding of how they and others use writing to interpret and share experience, affect behavior, and position themselves in the world. This seminar will include readings and writing activities that explore concepts and practices relating to diversity and its established and emerging definitions. Your section may address, for example, issues like race, gender, sexuality, ethnicity, religious difference, differences in abilities, and economic disparities. You can expect to identify and analyze assumptions about difference, study how texts can generate and perpetuate such assumptions, and explore the consequences of such assumptions. You will also learn how to research and compose with attention to difference.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0213", "course_title": "SEMINAR IN COMPOSITION: DISABILITY STUDIES", "description": "This composition course will engage students in formal and informal writing that fosters critical thinking on the topic of disability. Drawing on theoretical writing in disability studies as well as creative and critical literature by writers with disabilities, the course will introduce students to ways of identifying and questioning certain sociocultural assumptions about ability, sensory experiences of the world, and mental as well as physical health. The nature of the writing assignments and writing processes will vary in order to recognize a diversity of abilities and ways of thinking. In exploring disability as a diversity issue, the course aims at intersectionality, a concept introduced in 1989 by legal scholar Kimberlé Crenshaw. Intersectionality is the recognition that none of us can be said to inhabit a single identity; for example, our racial identity is always complicated by our socioeconomic class, gender and sexuality, as well as by our identities as abled/disabled. Anyone may become disabled at any point in time, and according to the Center for Disease Control, 61 million Americans identify as disabled, so it's safe to say that disability impacts every identity.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0400", "course_title": "WRITTEN PROFESSIONAL COMMUNICATION", "description": "This course explores the methods of inquiry, analysis and composition characteristic of written communication in professional settings. The course will examine such writing's specialized use of language, conventions and formats, premises, motives, and purposes. By preparing letters, resumes, proposals, reports, etc. Students will get a feel not only for what \"professional\" communication is, but also for how and why it does, or can, or should function.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0401", "course_title": "WRITTEN PROFESSIONAL COMMUNICATION: TOPICS IN DIVERSITY", "description": "This course explores the methods of inquiry, analysis and composition characteristic of written communication in professional settings. The course will examine such writing's specialized use of language, conventions and formats, premises, motives, and purposes. By preparing letters, resumes, proposals, reports, etc., students will get a feel not only for what \"professional\" communication is, but also for how and why it does, or can, or should function. This Topics in Diversity section of WPC will invite students to expand and complicate their understanding of the benefits of workplace diversity and of the problems arising from the unequal distribution of power and privilege across positions (including race, gender, sexuality, ethnicity, ability, religion, and class) in the professions. Students will explore the dynamics of power and hierarchy in their chosen field as they observe daily operations and interactions during work-site field visits, and they will consider how these dynamics perpetuate or diminish inequities and marginalization. Among the topics considered are discrimination in hiring and on the job in terms of employment training, responsibilities, pay, and promotions. Students gain practice articulating their individual diversity as job candidates in resumes and cover letters, and in composing professional documents that address a complaint, seek a remedy, and establish new policies to address hypothetical discriminatory issues that they may experience in the future.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0410", "course_title": "WRITING IN THE LEGAL PROFESSIONS", "description": "This course is especially useful for students preparing for classes in the legal professions. Students will be trained to understand the nature of assumptions and assertions, to examine the pertinence of evidence, to judge the appropriateness of tone to subject matter and audience, and to test the validity of an argument through an analysis of its components.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0412", "course_title": "ENGINEERING COMMUNICATION IN A PROFESSIONAL CONTEXT", "description": "ENGCMP 0412 Engineering Communication in a Professional Context, is a required course for all Swanson School of Engineering first-year students enrolled in ENGR 0012. In ENGCMP 0412 students write a significant research paper for the Swanson School of Engineering's Annual Conference on Sustainability, held near the end of the spring term. Students compose this paper in teams of 3; students also compose individual papers reporting and reflecting on their experience with teamwork and with researching, composing, assessing, and presenting written work within a context of maximum personal and professional responsibility and integrity. In ENGCMP 0412 students undertake intensive research into a current engineering innovation/technology. Students expand upon that research as they move through a multi-step process of writing and revising a conference paper that includes considerable technical content as well as intensive analyses of the social value and ethical applications of that technology. Through ENGCMP 0412, students will continue to increase their experience and success with major teamwork projects, will practice best policies and procedures for professional communication and presentation, will continue to learn about and practice communication modes and expectations in engineering, science, and technology, and will continue with an academically and intellectually rigorous process (begun in ENGCMP 0210, Seminar in Composition: Engineering), of understanding and communicating what it means personally, educationally, professionally, socially, and globally to \"be an engineer.\"", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0415", "course_title": "WRITING AND ANXIETY", "description": "This course is designed for students who are interested in learning about ways of navigating anxiety and apprehension about writing and for those who expect to teach or support other writers in business, education, and other nonprofit, public health and service institutions. Writing can be an anxiety-provoking process for many people who nevertheless have to write because of academic or professional responsibilities. The course will explore ways of theorizing the writing process and will identify and share strategies for navigating roadblocks (such as writing apprehension, writing anxiety, and blocking) as they arise. Students can expect to learn essential terms from the rhetorical tradition in order to become more aware of the choices they make as thinkers and writers, and they will analyze the rhetoric of a variety of texts from a disability studies perspective. In addition to learning about writing theory, students can expect to read and write about anxiety and about how the idea of disability functions in our culture.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0420", "course_title": "WRITING FOR THE PUBLIC", "description": "This course explores the theory and practice of writing that serves the public interest, including writing for the nonprofit and the governmental sectors of American society. The course will explore the ethics of writing for the public, the impact of rhetorical contexts on writing, and the ways in which writing and revision can allow us to understand a problem or issue in a new way. Students can expect to read examples of writing for the public, conduct significant research, and write in different genres.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0425", "course_title": "DIGITAL HUMANITY", "description": "This course prepares students to critically examine the intersections between digital devices and human life. Covering topics such as the relationship between computers and humans, surveillance, big data, and interactivity and games, we question what it means to be human in a space of pervasive digitality.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0430", "course_title": "PUBLIC COMMUNICATION OF SCIENCE AND TECHNOLOGY", "description": "This course explores the theory and practice of writing that serves the public interest. We will focus on writing about science, technology, and the environment areas that influence our daily lives in innumerable ways. By composing in a variety of genres, students will gain a deeper understanding of the ethics of writing about science and technology for public audiences, the interaction of communication and rhetorical context, and how writing and revision can facilitate new ways of thinking. Students will study academic articles, professional examples, news coverage, and student work.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0435", "course_title": "THE PUBLIC ATHLETE", "description": "Sport is a ripe avenue for public meaning-making, as athletes have used their platforms to bring awareness to various societal issues throughout history. In US contexts, athletes, like Serena Williams, Muhammad Ali, Simone Biles, Lebron James, Megan Rapinoe, Colin Kaepernick, John Carlos, and Tommie Smith (among many others), have taken public stands against various injustices. The ways in which sports data and narratives-in journalism, on social media, in film, or local communities, for example-are crafted also make meaning for a variety of genres and purposes. Thinking deeply about this subject offers participants ways to construct and deconstruct sport-writing to understand how these messages are made. In this course, we will engage with public writing about sports--both by and about athletes. Participants will not only study histories of sports-writing but will also consider how today's technologies can shape representations of the public athlete. We will read and write in a variety of rhetorical, journalistic, informational, creative, and research-based genres, while thinking carefully about the role of sports and athletes in shaping notions of racial, gender, and class-based identities.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0440", "course_title": "CRITICAL WRITING", "description": "Students in this course will be trained in the responsible development and articulation of written opinions. Material drawn from various media will be used to help students increase their powers of observation and analysis that they may learn the art of making discriminating evaluations of situations, events, issues, controversies, artifacts and objects.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0450", "course_title": "RESEARCH WRITING", "description": "This course trains students in the techniques of responsible library research. Students will learn how to locate and utilize the resources of a library. Students will also learn how to take notes and document, use primary and secondary sources, and write paraphrases, summaries and abstracts. Each student will write a major research paper on a topic of his/her choice, one which may legitimately serve as a term paper for another course.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0515", "course_title": "PERSAUSIVE WRITING IN ADVERTISING", "description": "In this course, students will analyze and create the kinds of persuasive writing used in the fields of fundraising and advertising. Both types of writing attempt to influence the decisions people make about the money they spend, the attitudes they have, and the issues that shape our society.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0520", "course_title": "INTEGRATING WRITING AND DESIGN", "description": "This course allows students to explore the rhetorical implications of design and invites students to consider design and writing as an integral process. The class will alternate lecture/discussion sessions with studio sessions, so that students can learn how to use Adobe InDesign to create both single- and multi-paged documents for particular rhetorical contexts. Student will create a number of designed pieces of writing, including a longer multi-page document for a specific audience.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0530", "course_title": "WRITING FOR THE SCIENCES", "description": "This course invites students to explore the purposes and conventions of writing within the sciences. Students will read and analyze examples of professional scientific documents' including abstracts, literature reviews, research proposals, graduate school papers, journal articles, and correspondence. They will learn to craft scientific research into engaging written material, using information drawn from publicly available studies or their own research. They will consider their audience's needs and tailor their writing for both expert and general readers in different rhetorical contexts. Students will also learn strategies for document design, including how to effectively use visuals to represent data and findings. Throughout the course, students will learn how to write clear, powerful sentences and paragraphs. Finally, to develop their professional collaboration skills, students will practice providing each other with effective feedback on works-in-progress.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0535", "course_title": "WRITING IN THE HEALTH SCIENCE PROFESSIONS", "description": "This course is designed for students who are interested in learning about the kinds of writing typically done by clinicians, researchers, and others working in health science contexts. The course focuses on developing the skills needed to write and communicate effectively in health and medical contexts, from writing essays for graduate and professional program applications and documenting research to communicating with patients and staff, writing professional reports and correspondence, and giving conference presentations. Students will gain familiarity with the formal requirements of biomedical abstracts, literature reviews, and research papers, and they will learn effective strategies for conducting secondary research using health science databases and search engines. The course will also introduce techniques for improving documents, structure and style, so that readers can easily grasp, follow, and absorb the significance of the information presented. Students will be introduced to expectations and challenges they are likely to encounter in other common writing scenarios, such as explaining complex information to patients, writing reports for administrators or regulatory agencies, and communication policies or procedures to staff. Different approaches to writing graduate and professional school personal statements will be discussed, and students will draft and revise either personal statements for applications or mission statements articulating their professional visions within a larger ethical framework. Through the course of the term students will work towards completion of a final paper on a medical communication issue, and they will present their findings in a conference-style format, at the end of the semester.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0540", "course_title": "INTRODUCTION TO DISABILITY STUDIES", "description": "This course provides students with a foundation for using writing to understand, apply, and critically engage with key concepts and histories that have been crucial to the experiences of people with disabilities, and perceptions and treatment of those with disabilities. Students can expect to explore and write theoretical pieces, first-person accounts, and representations of people with disabilities. They will learn various models of understanding and discussing disability (including the social, medical, individual model, and identity models) and the histories that have shaped the lives, experiences, and perceptions of people with disabilities. Students in the course will have the opportunity to compose rhetorical analyses of popular, public, and professional representations of disability. Historically, disability has been viewed as a deficiency or defect through the lens of religious and, most prominently, medical discourses, locating disability within an individual's body and mind. Seeing disability as a problem to be solved has resulted in significant barriers to access and representation for people with disabilities within all areas of the public sphere. Students will develop their own written critical inquiries into concepts such as normalcy, disability, and barriers to access (including physical, social, attitudinal, legal barriers). This course will not only offer critical interrogations of disability as a construct, but also center the lives and experiences of those with disabilities, viewing disability as a locus of identity and culture. To that end, students will watch documentaries and television media, and read memoir, personal essays, and poetry that present the pride, struggles, and everyday experiences of people with disabilities. Students will also study the Disability Rights Movement and inquiries into identity politics as related to disability as an identity category. The course will invite students to use composition to increase accessibility for those with disabilities and to consider the potentials and limitations of universal design.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0560", "course_title": "WRITING ARGUMENTS", "description": "This course has two goals: to help students become more adept at understanding and critically analyzing arguments, and to help students become better arguers themselves. Students in \"Writing Arguments\" will practice composing arguments across a variety of forms, genres, and technologies (written, visual, oral, digital) in order to develop and hone their persuasive language skills. As part of this practice, students will have the opportunity to design and participate in written and oral debates on topics of present interest and to compose their own examples of public persuasive communication. Writing Arguments would be especially appropriate for students headed to law or graduate school.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0565", "course_title": "WRITING PLACES", "description": "A. Can place make meaning? What roles do spaces, ecologies, or geographies play in shaping how we experience people, rooms, buildings, communities, regions, or the world? How do others, based on our placings, see us within these multiple frames? Writing Places introduces participants to cultural and rhetorical exchanges with places, and to constructions of place and community by thinking and moving through them. We'll consider what it means to construct, to be responsible for, to be culturally aware of, and to live place in local ecologies and/or digital/virtual environments. Unpacking current social in/justice issues and the communities they affect, participants may explore issues of racism, environmental and otherwise, land-based social in/justice, environmental sustainability, disability in/justice, im/migration, community-based activisms, and more. Through this process, we may be challenged to reorient our place/identity/orientation through various genres of writing places.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0600", "course_title": "INTRODUCTION TO TECHNICAL WRITING", "description": "This introductory course is for students in various technical fields. Representative technical reports will be studied, as well as abstracts, the presentation of visuals and oral communication. Writing assignments will emerge from case studies reflecting on-the-job challenges.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0610", "course_title": "COMPOSING DIGITAL MEDIA", "description": "This course requires students to compose digital media while exploring the rhetorical, poetic, and political implications of multiple writing platforms. Students will learn how to compose a range of critical media objects using web-authoring languages, text, sound, images, and video in proprietary and open-source software. Classes will focus on theories of writing, composing, design, critique, delivery, and networked distributions; critique and analysis of digital media produced by professional and amateur digital media practitioners; and analysis and revisions of digital media composed by the students themselves.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "0641", "course_title": "WRITING FOR CHANGE", "description": "This course is an opportunity for students to examine and produce writing that engages in advocacy, solidarity, social critique, and/or social justice. Students will explore theories of persuasive writing for public audiences, as well as argumentative strategies more broadly. Students will define the subject of a core project for the term, and move beyond understanding an issue to understanding various discourse communities that generate writing on that topic, how those organizations represent themselves, and how they define an audience. Our theoretical discussion will be balanced by a more pragmatic look at the language of social change, and how various writing forms, produced by nonprofits, activist groups, international organizations and coalitions, as well as socially engaged journalism, inform, persuade, and engage the public. Students in Writing for Change can expect to compose traditional essays as well as public writing in print, digital, visual, and a variety of other forms of persuasive communication.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1101", "course_title": "LANGUAGE OF SCIENCE AND TECHNOLOGY", "description": "This course analyzes the rhetorical character of scientific writing and examines the role of writing and the use of language in the scientific process. The course permits students to assess professionally prepared texts as well as texts produced by other students, to write and re-write their own text and to develop a critical awareness of the resources of language employed in science and technology.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1102", "course_title": "LANGUAGE OF MEDICINE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1103", "course_title": "PUBLIC RELATIONS WRITING", "description": "This course studies the ways an organization communicates with its public through news releases, speeches, brochures, feature stories, annual reports, etc. The course examines the stylistic choices each writer makes and develops a critical language to describe how meaning is created through the way information is arranged. Issues of the media, ethics, propaganda and the uses of ambiguity will also be addressed.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1104", "course_title": "CORPORATE STORYTELLING", "description": "Corporate writers play key roles in defining and developing the communications landscape for organizations and their audiences. But what exactly is corporate writing? How do we, as writers, ensure we are effectively advancing the goals of our companies and clients? In this course, students will explore the conventions of content marketing, search engine optimization, writing for the web, and the other forms of business writing in order to craft inventive and accessible messages. We will also examine corporate storytelling as a tool used to construct and maintain strong company personas. Assignments will incorporate written, visual, and oral components as students launch their own companies to simulate real world projects and dynamics. This course will help you strengthen and flex your creative communication skills to engage and influence readers in a variety of channels within the corporate setting.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1112", "course_title": "PROFESSIONAL USES OF SOCIAL MEDIA", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1151", "course_title": "PROFESSIONAL EDITING IN CONTEXT", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1220", "course_title": "THE ART OF THE ESSAY", "description": "This course offers students who have fulfilled the introductory composition requirement an opportunity to develop more advanced strategies as writers and a deeper understanding of how \"effective\" writing gets defined in various contexts. As they work on their own writing, students will read and discuss work by writers whose prose has received acclaim. Weekly writing assignments and exercises will provide the occasion to explore different styles and approaches to an audience.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1400", "course_title": "GRANT WRITING FOR NONPROFITS", "description": "This course allows students to study the practices related to proposing change, requesting funds, and defining projects.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1420", "course_title": "WRITING PROPOSALS FOR BUSINESS", "description": "Successful business proposals have great potential; they can jumpstart businesses, build a strong client base, create change in the workplace, foster professional relationships, and facilitate projects that meet the needs of specific audiences. But what is a business proposal? How does it differ from a grant proposal or a business plan? What should a business proposal look like? How do we make our proposals stand out from the rest? This course will enable students to understand the functions and conventions of business proposals, the types of research that they require, and the processes that generate them and lead to approval. Coursework will help students develop an understanding of business proposal writing from an initial idea through final submission. Students will complete a variety of written pieces leading up to the final proposal, which may be valuable in their employment portfolios. Upon completion of this course, students will have acquired the research and writing skills necessary to write successful proposals for real-world for-profit contexts.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1430", "course_title": "USABILITY TESTING IN TECHNICAL WRITING", "description": "This course prepares students for the creative and technical demands of the professional and technical writing workplace, ensuring each student possess the hard skills of usability testing and the soft skills required to best communicate those results. It introduces students to design theories and principles alongside practical applications on measuring usability and user experiences for products and services. Ethical and practical questions of accessibility and disability necessarily inform our discussion and practice. This course also incorporates aspects of product consulting, providing students with an opportunity to apply their theoretical and practical understanding of usability testing to the benefit of stakeholders.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1551", "course_title": "HISTORY AND POLITICS OF THE ENGLISH LANGUAGE", "description": "This course introduces students to both historical and present use and descriptions of the English language. Students also learn techniques for analyzing and understanding the language.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1552", "course_title": "LANGUAGE, LITERACY, LEARNING", "description": "This course examines how individuals and societies acquire, develop, and make use of literacy. Students engage in questions concerning the social and personal consequences of literacy, and they explore various theories and practices of reading, writing, and schooling. The dual focus on how literacy functions in the development of individuals and societies makes this course especially appropriate for advanced students considering careers in elementary and secondary education.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1900", "course_title": "INTERNSHIP: PUBLIC/PROFESSIONAL WRITING", "description": "This internship is intended for juniors and seniors who are pursuing the public and professional writing certificate. The internship is designed to give students a productive, substantive writing experience where they will learn from and contribute to the sponsoring agency or project. Students will consult with an advisor to arrange for intern ships and to construct the plan of work, writing, and over sight.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1903", "course_title": "SERVICE-LEARNING SEMINAR IN PUBLIC AND PROFESSIONAL WRITING", "description": "This course is open to students who are enrolled in public and professional writing courses. It is taken concurrently with these anchor courses as a voluntary, one-credit add-on. The service-learning seminar pairs meaningful and sustained service activities in a professional non-profit organization with investigation of professional writing.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1906", "course_title": "PROFESSIONAL EXPERIENCE: WRITING, EDITING, OR PR", "description": "This course offers an exciting opportunity for students who have taken at least a couple of PPW or Writing courses: Professional Experience at Sampsonia Way, the literary journal of City of Asylum/Pittsburgh. http://www.sampsoniaway.org The PPW program is teaming up with City of Asylum to produce the magazine. The course is for responsible students who are interested in writing for this journal or running social media to promote the journal. The team will work with a teacher who will serve as managing editor and also faculty member in charge of the project. The group will learn about writing, editing, and PR while producing the online literary magazine. You can also expect to learn more about free speech and social justice while working with writers who are under threat in their home countries. Weekly meetings on campus will focus on learning about the context for the work, learning good practices for professional writing, editing, and PR, reading work by writers in exile, and workshopping your articles for publication. Interviews for articles will be in-person or via Skype. Expect to spend 10-12 hours a week working on this project. You will also need to attend class. A monthly meeting will be held at City of Asylum on the Northside (easily accessible by bus).", "completed": false, "prereq_count": 0}, {"dept_code": "ENGCMP", "id": "1910", "course_title": "BRIDGE SEMINAR", "description": "", "completed": false, "prereq_count": 0}], "links": [{"source": "0150", "target": "0151"}, {"source": "0200", "target": "0201"}]}