{"nodes": [{"dept_code": "NROSCI", "id": "0080", "course_title": "BRAIN AND BEHAVIOR", "description": "This course analyzes the relations between brain function and overt behaviors. Topics include: the control of movement, sensory processing, mechanisms controlling sleep, arousal, and other circadian rhythms, hunger and thirst, learning and memory, the biological bases of neuropsychiatric disorders, and the functioning of the cerebral hemispheres. Many clinical disorders will be discussed including language disorders, amnesia, epilepsy, depression, anxiety, schizophrenia, and Alzheimers disease.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "0081", "course_title": "DRUGS AND BEHAVIOR", "description": "This course provides a general background in the fields of neuroscience and psychopharmacology. The course examines the behavioral effects and biological mechanisms of action of the major groups of psychoactive compounds, including stimulants, depressants, narcotics, and hallucinogens. Drugs used in the treatment of common psychiatric neurological disorders, such as schizophrenia, depression, and Parkinson's disease, will also be discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1000", "course_title": "INTRO TO NEUROSCIENCE", "description": "This course examines the anatomy, physiology, and pharmacology of the central and peripheral divisions of the nervous system. Specific topics covered include neuronal function, synaptic transmission, sensory processing, movement, sleep and wakefulness, hunger, thirst, caloric and body fluid homeostasis, recovery of function after brain damage, and various neurological and psychiatric disorders.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1003", "course_title": "UHC INTRODUCTION TO NEUROSCIENCE", "description": "This honors course examines the anatomy, physiology, and pharmacology of the central and peripheral divisions of the nervous system. Specific topics include neruonal function, synaptic transmission, sensory processing, movement, sleep and wakefulness, hunger, thirst, caloric and body fluid homeostasis, recovery of function after brain damage, and various neurological and psychiatric disorders. Course includes in-depth discussions of original research articles presented in the general lectures.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1011", "course_title": "FUNCTIONAL NEUROANATOMY", "description": "This course deals with human neuroanatomy and covers the basic structure of the central nervous system from spinal cord to cerebral cortex. Emphasis is placed on major systems and subsystems within the brain, and on their functional significance. The basic structure and morphology of nerve cells will be covered.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1012", "course_title": "NEUROPHYSIOLOGY", "description": "This course examines the functioning of neurons and synapses, the basic units responsible for fast communication within the nervous system. The course focuses on the elegant use of electrical mechanisms by the nervous system, and on the powerful quantitative approach to scientific investigation that is fundamental to neurophysiology. Topics include: principles of electric current flow exploited by the nervous system; the basis of the resting potential of neurons; the structure and function of voltage-gated and neurotransmitter-gated ion channels; the generation and propagation of action potentials; the physiology of fast synaptic communication.", "completed": false, "prereq_count": 2}, {"dept_code": "NROSCI", "id": "1014", "course_title": "SPEAKING OF SCIENCE", "description": "Students will learn strategies for giving presentations about science to both a scientific audience and a public audience. Topics covered will include 1) how to engage our audience, 2) the art of breaking down your message, 3) tips to make clear, interesting slides, and 4) pointers on presentation style. All audiences want to learn interesting new scientific information, and have it delivered as a good story in an understandable manner by a personable, easy to approach person. Communication skills, including knowing your audience and why they are interested in the information you are speaking about, how to translate scientific jargon into understandable concepts for the public, and how to keep the audience engaged will be discussed. Pointers will be given on answering questions, being conversational, and conveying the \"big picture\". Students will give a number of presentations in this course and learn to receive and give feedback effectively.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1017", "course_title": "SYNAPTIC TRANSMISSION", "description": "This course examines the mechanisms by which neruotransmitters are synthesized and released and the biochemistry of synaptic responses. Basic physiological, biochemical, and morphological characteristics of neuronal transmission will be discussed. An emphasis will be placed on the experimental approaches used to examine these processes.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1018", "course_title": "UHC NEUROPHYSIOLOGY", "description": "", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1027", "course_title": "NEUROSCIENCE PROSEMINAR", "description": "Program graduate students, postdoctoral fellows, and faculty will present an overview of their respective research topics and discussion of current research articles on that topic. Critical analysis of experiments and research is emphasized.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1028", "course_title": "SIGNALING PATHWAYS IN SYNAPTIC PLASTICITY", "description": "This class focuses on signaling mechanisms, which underlie long-term synaptic plasticity. It will address the molecular pathways, which regulate thresholds for synaptic plasticity, the synaptic machinery for induction and expression of long-term synaptic plasticity and how it is converted to structural changes of the neural network, which might underlie the consolidation of memory. The presentations will be guided by experimental approaches, which have influenced the conceptual framework.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1030", "course_title": "PSYCHTRC DISORDERS AND BRAIN FUNCTION", "description": "This course examines the neurobiological basis of psychiatric disturbances (including schizophrenia, depression, Parkinson's disease, and Huntingtons chorea). The initial portion presents an overview of basic neuropharmacology, with an emphasis on recent findings of relevance to psychiatric disorders. The major portion consists of lectures on the anatomical, physiological, and neurochemical bases for specific psychiatric disturbances, and the mechanism of action of therapeutic drugs used in their treatment. A strong neuroscience background is required.", "completed": false, "prereq_count": 3}, {"dept_code": "NROSCI", "id": "1032", "course_title": "FUNCTIONAL ORGANIZATION OF THE HUMAN NERVOUS SYSTEM", "description": "The intent of this course is to examine the biological basis of neurological dysfunction and to use this information to gain further insight into the functional organization of the human nervous system. A disease oriented approach will be used to illustrate localization of function. Well known clinical cases will define the functional consequences of disease or damage to regions of the brain and current information on the mechanisms underlying the disease process or physical damage will be used to provide further insight into the functional alterations that contribute to the deficit.", "completed": false, "prereq_count": 2}, {"dept_code": "NROSCI", "id": "1034", "course_title": "NEURAL BASIS OF COGNITION", "description": "This advanced elective is designed for students interested in learning about the neural basis of higher order cognitive functions, with an emphasis on cortical mechanisms. Topics will include: occipitotemporal mechanisms of visual perception; parietal mechanisms of spatial attention and vision for action; premotor mechanisms of action planning and movement execution; prefrontal mechanisms of working memory and behavioral control; hippocampal mechanisms of episodic memory; multimodal integration and cognitive effort.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1044", "course_title": "WHY DO NEURONS FIRE? A MATHEMATICAL INTRODUCTION", "description": "This course introduces advanced undergraduates to a selection of key ideas and mathematical models in theoretical neuroscience through an essential question: why do neurons fire action potentials? It aims to give students a foundation for understanding current theoretical methods in the field. It will include discussions of the Hodgkin-Huxley model, the efficient coding hypothesis, and neural network models. Students are not expected to enter the course with an extensive mathematical and programming background, rather the tools needed will be taught through each of the topics. This course is designed to provide the mathematical background for the Introduction to Computational Neuroscience (NROSCI 1046) but it can be taken on its own or afterwards.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1049", "course_title": "RESEARCH TOPICS IN NEUROSCIENCE", "description": "This course is required for all newly declared majors. This course will provide students with an overview of research conducted by neuroscience faculty and familiarize students with potential research topics.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1053", "course_title": "RESTORATIVE NEUROSCIENCE", "description": "Restorative neuroscience investigates and develops the biological principles that repair or regenerate the nervous system. This course will provide an overview of the biological process involved in the endogenous repair response following injury to the peripheral and central nervous system. It will further detail therapeutic approaches, such as growth factors, gene therapy, cell therapy, exosomes, and rehabilitation. The student will learn the scientific background to this topic, as well as how to design experiments to address specific research questions and evaluate therapeutic efficacy.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1070", "course_title": "HUMAN PHYSIOLOGY-UHC", "description": "Lectures and reading on the following: (1) functions of the cardiovascular system; (2) respiration; (3) digestion and absorption in the gut; (4) kidney function and the regulation of body fluids; (5) the regulation of metabolism; and (6) reproduction.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1112", "course_title": "FUNCTIONAL NEUROANATOMY HONORS PRACTICUM", "description": "This honors course supplements the material in the companion lecture course, NROSCI 1011, in two ways. In the initial laboratory portion of the course, human and animal brain tissue will be examined to provide students a first-hand knowledge of the structures that make up the brain and spinal cord. Subsequently, major journal articles that were key in establishing the scientific principles discussed in NROSCI 1011 will be reviewed. This portion of the course will allow students to gain insights into the methods that neuroscientists use to learn about the nervous system. This is a three credit course and will count as an advance elective for majors.", "completed": false, "prereq_count": 1}, {"dept_code": "NROSCI", "id": "1117", "course_title": "UHC SYNAPTIC TRANSMISSION", "description": "This UHC course examines the mechanisms by which neruotransmitters are synthesized and released and the biochemistry of synaptic responses. Basic physiological, biochemical, and morphological characteristics of neuronal transmission will be discussed. An emphasis will be placed on the experimental approaches used to examine these processes.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1250", "course_title": "HUMAN PHYSIOLOGY", "description": "This course begins with a general introduction on cell biology, physiology of nerves and muscle, and intercellular communication. The course will then survey the function of the following systems: cardiovascular, respiratory, renal, and gastrointestinal. Each system discussed will be integrated into the larger function of homeostasis, emphasizing its adaptation during pathology and challenges (e.g., exercise). The formal lectures will be supplemented by a required recitation.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1800", "course_title": "NEUROSCIENCE/WRITING PRACTICUM", "description": "This course is restricted to neuroscience majors & minors and fulfills the writing requirement for the major. It includes extra emphasis on and credit for instruction in proper writing for the discipline of neuroscience using topics from an appropriate co-requisite neuroscience course taken in the same term.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1801", "course_title": "NEUROSCIENCE/WRITING PRACTICUM", "description": "This course is restricted to neuroscience majors & minors and fulfills the writing requirement for the major. It includes extra emphasis on and credit for instruction in proper writing for the discipline of neuroscience using topics from an appropriate co-requisite neuroscience course taken in the same term.", "completed": false, "prereq_count": 0}, {"dept_code": "NROSCI", "id": "1962", "course_title": "THESIS RESEARCH/WRITING", "description": "This course involves writing a thesis based on independent neuroscience research that is supervised by a faculty member of the department of neuroscience or some other department in which neuroscience research is performed.", "completed": false, "prereq_count": 0}], "links": [{"source": "1000", "target": "1011"}, {"source": "1000", "target": "1012"}, {"source": "1000", "target": "1014"}, {"source": "1000", "target": "1017"}, {"source": "1000", "target": "1018"}, {"source": "1000", "target": "1027"}, {"source": "1000", "target": "1030"}, {"source": "1000", "target": "1032"}, {"source": "1000", "target": "1034"}, {"source": "1000", "target": "1049"}, {"source": "1000", "target": "1053"}, {"source": "1000", "target": "1112"}, {"source": "1003", "target": "1012"}, {"source": "1003", "target": "1030"}, {"source": "1011", "target": "1030"}, {"source": "1011", "target": "1032"}]}