{"nodes": [{"dept_code": "LING", "id": "0007", "course_title": "ESL WRITING INTERMEDIATE", "description": "This is an intermediate writing skills course for non-native speakers of English, covering (a) the process and mechanics of writing a research paper (b) composition writing, with a focus on expository writing for college work (c) selected grammar skills.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "0008", "course_title": "ESL SPEAKING AND LISTENING", "description": "This is an advanced conversation course for non-native speakers of English to improve speaking and listening skills while gaining experience in the organization and oral presentation of material for academic work. Pronunciation exercises are done in class, while fluency and comprehensibility are the objectives of the student led discussions and presentations. The student will also learn how to prepare and present speeches and discussions. Note-taking skills are practiced. Some language lab work is required.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "0010", "course_title": "ESL READING AND VOCABULARY", "description": "This is an advanced reading skills course for non-native speakers of English, emphasizing the type of reading required in University-level course work. The course includes intensive reading of passages from the course text, extensive reading of academic or other material selected by the student or instructor, speed improvement and vocabulary development.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1000", "course_title": "INTRODUCTION TO LINGUISTICS", "description": "This course is a survey of general linguistics, emphasizing the theory and methodology of the traditional central areas of the field--phonetics, phonology, morphology, and syntax- with special concentration on phonological and syntactic theories and analytical techniques. The remainder of the course will be devoted to phonetics, morphology, historical linguistics, semantics and pragmatics, sociolinguistics, and psycholinguistics.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1050", "course_title": "COMPUTATIONAL METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing XML-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1267", "course_title": "ASPECTS OF SOCIOLINGUISTICS", "description": "Aims at providing insights into how social relationships influence language, and how language can play a role in shaping social relationships, both in the individual and societal level. Some of the issues we will look at are; attitudes towards languages, dialects and society; social differentiations of language; black English; multilingualism; bilingual education and language planning.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1340", "course_title": "DATA SCIENCE FOR LINGUISTS", "description": "Data science is a fast-growing professional and academic discipline that is highly interdisciplinary in nature. Its practice centers on domain expertise: this course will introduce linguistics majors to core methods and practices in data science as it pertains to linguistic inquiry. Students will first learn the fundamentals of structuring, manipulating and sharing various forms of linguistic data; be given hands-on training on practical aspects of data processing, including handling large quantities of text data ('big data') and creating statistical language models through machine learning; and get acquainted with the emerging field of knowledge engineering and ontology. Additionally, they will be given a chance to apply data-intensive methods to a term project of their choice. Upon successful completion of this course, students will be able to: identify the best methods for representing and analyzing linguistic data for a given purpose; transform and process linguistic data in large volumes; and understand how statistics-driven text analytics and machine learning methods operate.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1470", "course_title": "ENDANGERED LANGUAGES", "description": "In this course, we investigate such questions as: What are the symptoms and underlying causes of language endangerment and language death? Are efforts to revitalize dying languages worthwhile, or is the disappearance of languages inevitable or even beneficial? How are thought, identity, and culture influenced by language, and vice versa -- and what implications does the answer to that question have for language documentation and revitalization?", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1579", "course_title": "PHONOLOGY", "description": "This course introduces the principles of phonological analysis and theory. After a brief survey of the roots of modern phonology in Prague school and American descriptivist ('classical phonemic') theories, the main focus of the course will be on generative phonology. Both in and out of class, students will be expected to solve phonological problems and construct theoretical arguments.", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1682", "course_title": "INTRODUCTION TO SEMANTIC THEORY", "description": "A survey course designed to introduce students who have been exposed to linguistics and logic to contemporary work in the theory of meaning.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1777", "course_title": "SYNTACTIC THEORY", "description": "This course is an introduction, stressing understanding of theoretical concepts, to the transformational generative approach to English sentence structure. This approach uses formal rules to produce sentences, and to explain how they are composed of phrases. The first part of the course concentrates on mechanical manipulation of systems of rules, aiming to acquaint the student with how the rules work. The second part concentrates on how syntacticians use evidence about a language to support or disconfirm their theories.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1800", "course_title": "SPECIAL TOPICS IN LINGUISTICS", "description": "", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1810", "course_title": "STATISTICS FOR RESEARCH IN LINGUISTICS", "description": "The first goal of this course is to familiarize students with the major statistical tests, analysis strategies, and plotting conventions that are currently considered best practices in linguistics. The course accomplish these goals through a combination of reading (both of textbook chapters and empirical articles), in-class demos and hands-on practice, and homework exercises. The second goal is to make students comfortable using the R programming language for statistical computing. Assuming absolutely no prior background in statistics or programming, we will work from the ground up to turn you into a novice but proficient statistical programmer; by the end of this course, you will be able to read in your own data, perform basic data re-formatting and summary calculations, and conduct a wide variety of statistical analyses' all in R! The final goal is to get students thinking about how they can apply their new skills to their own research. In service of this goal, you will be required to write a short research paper that describes a data set you would like to work with, and that explains the statistical analyses you would perform in order to answer a small number of questions that are of interest to you.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1877", "course_title": "ACCELERATED SYNTACTIC THEORY", "description": "This course will familiarize students with theoretical approaches in classic Principles and Parameters theory and the application of these approaches to some of the defining syntactic structures of English. Students will gain: knowledge of syntactic argumentation, how evidence from data is used incrementally to argue for and against theoretical proposals; the ability to apply syntactic theory to structures in languages other than English; and, insight into alternative approaches to syntactic theory.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1879", "course_title": "ACCELERATED PHONOLOGY", "description": "Phonology is the study of how sounds pattern in the languages of the world. Using this definition, students will try to understand what exactly people are doing when they study phonology. The course will be divided up into two main sections: In the first section, students will learn about the main concepts and analysis techniques that have traditionally formed the backbone of phonology. The focus will be on how to perform a formal phonological analysis and make a phonological argument. In the second section of the course, the focus will shift toward understanding how and why the field of phonology has evolved over time, in terms of both its subject matter and its methods. Students will work through some of the seminal texts in phonological theory and try to understand what each theory does well versus poorly. This course will help students to become better, more critical thinkers and writers.", "completed": false, "prereq_count": 1}, {"dept_code": "LING", "id": "1900", "course_title": "LINGUISTICS CONSULTING/INTERNSHIP: CONNECTING LINGUISTICS TO THE COMMUNITY AND INDUSTRY", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "LING", "id": "1930", "course_title": "APPLICATIONS OF LINGUISTICS", "description": "This course is a capstone course for undergraduate majors in linguistics. It should therefore be taken after nearly all other major requirements have been fulfilled. The topics to be covered are the crucial role a knowledge of linguistics plays in language teaching, the law (both interpretation of documents, courtroom discourse, forensic linguistics, and interpreting), communication disorders, archaeology, computational linguistics, and anthropology. Students will develop a portfolio of short papers, some of which are based on their own field research.", "completed": false, "prereq_count": 1}], "links": [{"source": "1000", "target": "1340"}, {"source": "1000", "target": "1682"}, {"source": "1000", "target": "1777"}, {"source": "1000", "target": "1800"}, {"source": "1000", "target": "1810"}, {"source": "1000", "target": "1877"}, {"source": "1000", "target": "1879"}, {"source": "1000", "target": "1930"}]}