{"nodes": [{"dept_code": "GEOL", "id": "0055", "course_title": "GEOLOGY LABORATORY", "description": "The course consists of a laboratory structured to give students an overview as well as hands-on experience with the methodology used by earth scientists to study geologic processes.", "completed": false}, {"dept_code": "GEOL", "id": "0060", "course_title": "HISTORY OF THE EARTH", "description": "This course surveys the evolution of the earth and its inhabitants from its origins to the present. Lectures and lab emphasize the identification and interpretation of rocks, geologic features, and geologic maps. Lab work also includes fossil identification, stratigraphic correlation, and sedimentary facies analysis.", "completed": false}, {"dept_code": "GEOL", "id": "0800", "course_title": "GEOLOGY", "description": "Geology is the study of how the earth works. This class covers the classification and origin of basic rocks and minerals; examines the role of plate tectonics in shaping the earth and producing such hazards as earthquakes and volcanoes; and examines the forces that shape beaches and rivers and sometimes threaten our lives and property. We also survey the evidence for changing climate and the future of such resources as groundwater, fossil fuels, and ores.", "completed": false}, {"dept_code": "GEOL", "id": "0820", "course_title": "NATURAL DISASTERS", "description": "The geologic, hydrologic and atmospheric processes that impact the human environment in catastrophic ways are examined in this course. Natural disasters surveys energy cycles, plate tectonics with an emphasis on how they produce earthquakes, volcanic eruptions, tornadoes, hurricanes, tsunamis, wildfires, flooding, landslides, climate change and mass extinctions. Students will get hands on experience in recitation. This course serves as an introductory course for three majors in geology and planetary science.", "completed": false}, {"dept_code": "GEOL", "id": "0840", "course_title": "ENVIRONMENTAL SCIENCE", "description": "This class is an interdisciplinary introduction to the science underlying environmental issues. Focusing on the principles of geology, biology, and chemistry and in their application to human impacts on the environment, strategies for sustainable management of environment and natural resources, and global change.", "completed": false}, {"dept_code": "GEOL", "id": "1003", "course_title": "IGNEOUS & METAMORPHIC PETROLOGY", "description": "A lecture and laboratory course concerned with a study of the origin, occurrence, identification, and classification of igneous and metamorphic rocks. The primary purpose of the course is to familiarize the student with the physical and chemical processes that control the formation of the main igneous and metamorphic rock types.", "completed": false}, {"dept_code": "GEOL", "id": "1015", "course_title": "GEOLOGY COLLOQUIUM", "description": "Geology colloquium is open to undergraduate students in geology and planetary science. It is a formalization of the seminar series with weekly guest speakers from industry, academia and government. Each seminar will focus on a different research topic in earth sciences describing on-going projects of interest to students. The course may be taken multiple times.", "completed": false}, {"dept_code": "GEOL", "id": "1030", "course_title": "THE ATMOSPHERE, OCEANS AND CLIMATE", "description": "This course will examine the atmospheric and oceanic interactions that determine the nature of the global climate system. Specifically, the course will explore the origin, evolution, and structure of the earth's oceans and atmosphere, the earth's energy balance, atmospheric circulation patterns, and surface and deep ocean currents. The course will also consider records of past climate, evidence for recent warming, climate change projections, and climate change policy.", "completed": false}, {"dept_code": "GEOL", "id": "1045", "course_title": "STATISTICS FOR EARTH SCIENCE", "description": "A statistics course geared toward environmental science and geology majors with an emphasis on applying data analysis and statistical techniques to environmental data. Topics will include: visualizing data, summary statistics, correlation, selected parametric statistics (t-tests, general linear models), selected non-parametric methods, statistical inference, and experimental design.", "completed": false}, {"dept_code": "GEOL", "id": "1051", "course_title": "GROUNDWATER GEOLOGY", "description": "This course focuses on physical and chemical processes controlling water movement and composition in sub-surface environments. The lab focuses on practical field methods for the characterization of groundwater.", "completed": false}, {"dept_code": "GEOL", "id": "1055", "course_title": "ENVIRONMENTAL ETHICS", "description": "This course asks students to evaluate environmental decision-making, land-management, and use of natural resources by investigating the underlying assumptions of discussions with in the fields of science, management, economics, law, religion and public policy on the environment. Throughout the semester, we will discuss our historical and current day evolution toward Land Ethic.", "completed": false}, {"dept_code": "GEOL", "id": "1060", "course_title": "GEOMORPHOLOGY", "description": "This course is a survey of the major landform features found on the earth's surface. Each landform type is first described qualitatively and then examined in terms of the processes, such as stream flow or glacial activity, which cause its development. The purpose of the course is to familiarize students with geomorphic principles.", "completed": false}, {"dept_code": "GEOL", "id": "1100", "course_title": "STRUCTURAL GEOLOGY", "description": "A course devoted to the study of folded, faulted, flowed, sheared, and jointed rocks with the aim of preparing a student to recognize and interpret deformed rocks. The evolution of mountain belts and deformation related to this process are emphasized.", "completed": false}, {"dept_code": "GEOL", "id": "1312", "course_title": "ENVIRONMENTAL LAW AND POLICY", "description": "The survey course will examine the role of law and policy in regulating human impact on the environment. topics include the history and development of U.S. environmental law; theoretical approaches to environmental protection; mechanisms employed in environmental laws and regulation; the roles of the legislative, executive, and judicial branches of government in developing and implementing environmental law and policy; an overview of the principal environmental laws at the federal and state levels; the role of citizens in development and enforcement of environmental law; and constitutional constraints on government authority.", "completed": false}, {"dept_code": "GEOL", "id": "1313", "course_title": "COM ENVIRONMENTAL PROFESSIONALS", "description": "This course serves as a w-course for environmental studies. We will sample various tools and methods (typical \"professional\" tasks such as memos and letters, building into comprehensive assignments such as case studies), all while concentrating on how audience and purpose affect communication.", "completed": false}, {"dept_code": "GEOL", "id": "1330", "course_title": "SUSTAINABILITY FLASH LAB", "description": "Sustainability involves a systems approach. By exploring the inputs and outputs of energy and resources, we will ask broad questions: How do we measure production and consumption? How do geographical and socio-economic environments affect these things? How do we go beyond traditional measurements to quantify more comprehensive impacts and life-cycles? Answering these larger questions begins on a smaller, very specific, and personal scale: Where you live, and how you live. By examining and measuring resource use (including electricity, water and sewage, garbage and recycling, energy use, and transportation), we trace inputs and outputs to their source/destination, and begin to unravel and understand the complex web of production, distribution, delivery, and environmental consequences. We will investigate how these metrics change due to location and societal practices, as well as changes created through conservation and public policy. Eventually, it is the aim of this course to also reflect, at cultural and philosophical levels, on our energy/resource usage and underlying causalities thereof.", "completed": false}, {"dept_code": "GEOL", "id": "1333", "course_title": "SUSTAINABILITY", "description": "Sustainability is a term that has many meanings, depending on who's using it, and we will cover most of them in this class, from green campuses to green-washing. The class features guest speakers from the academic, governmental, nonprofit and business sectors to offer as many perspectives as possible on sustainability topics. The real focus of the class, though, is the development of sustainability projects on campus and in the Pittsburgh community. Students also participate in sustainability-related events and field trips with the opportunity to present their work to a larger audience at the end of the semester.", "completed": false}, {"dept_code": "GEOL", "id": "1342", "course_title": "ENVIRONMENTAL ISSUES", "description": "This course will cover a range of issues in our environment including but not limited to air quality, water quality, mining and gas, and parks and forests. The focus of the class will be on researching, preparing, and revising written assignments on environmental issues. To accomplish this, the class will help students (1) identify environmental issues of interest, (2) organize around a single aspect of the chosen issue, and (3) prepare written assignments that will be reviewed and edited to meet standards of publication (e.g. traditional research paper, a proposal, or long-form journalism).", "completed": false}, {"dept_code": "GEOL", "id": "1445", "course_title": "GIS, GPS, AND COMPUTER METHODS", "description": "The goals of this course are to gain expertise in spatial analysis and geographical information systems.", "completed": false}, {"dept_code": "GEOL", "id": "1446", "course_title": "ADVANCED GEOGRAPHICAL INFORMATION SYSTEM", "description": "Using advanced geographical information systems technologies and geospatial analysis techniques students will extend their knowledge of geographical information systems to include raster, geostatistical, network, model, and 3d/4d based analysis completing complex analysis of real world data sets.", "completed": false}, {"dept_code": "GEOL", "id": "1510", "course_title": "AQUATIC AND SEDIMENTARY GEOCHEMI", "description": "This course will examine the chemistry and geochemistry of modern and ancient aquatic and sedimentary systems, including oceans and fresh waters. Students will gain an understanding of the biogeochemical processes occurring in aquatic systems, and the geochemical signatures they leave in the sedimentary record.", "completed": false}, {"dept_code": "GEOL", "id": "1516", "course_title": "ENVIRONMENTAL GEOCHEMISTRY WITH LAB", "description": "This course explores the complex interactions of Earth's rock, water, air, and life systems that determine the chemical characteristics of our environment. We will examine the distribution, cycling, and transport of chemical compounds in the atmosphere, hydrosphere, and terrestrial environment on local and global scales. Topics will include water chemistry, organic and inorganic pollution and related toxicology, hazardous wastes, acid rain, acid mine drainage, photochemical smog, ozone depletion, and global climate change. We will learn related laboratory and field techniques for geochemical analysis of water and soil in the laboratory section. Lecture (3 hours) and Lab (3 hours).", "completed": false}, {"dept_code": "GEOL", "id": "1701", "course_title": "GEOLOGY OF THE PLANETS", "description": "An introduction to the geological processes and resulting landforms occurring on the surfaces of the planets of our solar system. We will make extensive use of recent spacecraft imagery and data.", "completed": false}, {"dept_code": "GEOL", "id": "1907", "course_title": "EXPERIENCE IN UNDERGRADUATE TEACHING", "description": "", "completed": false}], "links": [{"source": "0055", "target": "0060"}, {"source": "0055", "target": "1051"}, {"source": "0055", "target": "1060"}, {"source": "0055", "target": "1100"}, {"source": "0055", "target": "1510"}, {"source": "0055", "target": "1516"}, {"source": "0055", "target": "1701"}, {"source": "0800", "target": "1510"}, {"source": "1445", "target": "1446"}]}