{"nodes": [{"dept_code": "BUSSPP", "id": "0020", "course_title": "MANAGING COMPLEX ENVIRONMENTS", "description": "This 3-credit course introduces students to managing large firms in complex and rapidly changing environments. Students examine what managers do when faced with incomplete, noisy, and often inconsistent information about competitive forces, given (a) the firm's resources, capabilities, and constraints; (b) the effects of law, regulation, culture, and ethics; (c) the claims of various stakeholder constituencies, (d) industry structure and competition, (e) firm-level governance, and (f) market forces. This requires attention to the basic concepts, vocabulary, tools, and techniques of business and to the complex interrelations among the multiple dimensions of firm performance. The optional project will provide additional opportunity to develop several practical business skills, such as teamwork, the means of acquiring and using standard business and industry data, and fact-based reporting.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSSPP", "id": "1080", "course_title": "STRATEGIC MANAGEMENT", "description": "Focuses on corporate and divisional policy formulation and implementation. Knowledge and techniques learned in earlier courses will be applied in an integrated fashion to the process of strategic decision-making and organizational change. Among topics considered in the course will be relationships of organizations to their environments, hierarchy of organizational objectives, structured as well as informal approaches to strategic planning, integration of business functions, organizational structure, and policy implementation and evaluation. Notable devotion to firms competitive dynamics.", "completed": false, "prereq_count": 0}, {"dept_code": "BUSSPP", "id": "1740", "course_title": "GLOBAL STRATEGY AND COMPETITIVE ADVANTAGE", "description": "This course explores the opportunities and challenges of global business in the 21st century. The discussions and exercises are designed to reveal the nuanced nature of competing globally, emphasizing both the increasing openness of borders and the continuing differences between countries. The course will employ case study analysis and discussion, along with a set of readings that are drawn from both academic and practitioner sources. An individual research project that involves identifying and researching a global business topic of interest to you will be a key part of the course.", "completed": false, "prereq_count": 1}, {"dept_code": "BUSSPP", "id": "1750", "course_title": "COMMERCIALIZING NEW TECHNOLOGY", "description": "This course covers theory, conceptual frameworks, and tools used to formulate strategies for commercializing new technologies. The analytical frameworks cover elements of commercialization strategy that are equally critical to start-ups and to corporate technology ventures. In addition, we discuss some of the key challenges that differ for start-ups versus established firms. The primary deliverable in the course is a professional quality project which evaluates the commercialization alternatives for an emerging technology. Your project team will be paired with a local inventor, unless you prefer to evaluate a technology of special interest to your team. Experienced entrepreneurs and expects in financing new technology ventures will also address the class.", "completed": false, "prereq_count": 0}], "links": [{"source": "1080", "target": "1740"}]}