{"nodes": [{"dept_code": "CEE", "id": "0109", "course_title": "COMPUTER METH IN CIVIL ENGRG 1", "description": "This course emphasizes the mathematics and problem-solving skills necessary to be an intelligent user of a variety of computational tools for engineering analysis. The first portion of the course focuses on linear algebra within the context of engineering problems. Concepts of numerical linear algebra are then introduced, followed by a brief introduction to additional discrete analysis tools such as numerical approximation and signal processing. Lastly, through the introduction of cad software and an individual term project, students are taught how to independently gain familiarity and confidence with engineering software.", "completed": false}, {"dept_code": "CEE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "The departmental seminars are designed to acquaint the student with aspects of the civil engineering profession which are not normally encountered in classes and school activities.", "completed": false}, {"dept_code": "CEE", "id": "1105", "course_title": "MATERIALS OF CONSTRUCTION", "description": "The nature, physical properties, including environmental aspects of civil engineering construction materials are discussed. Experimentation, where applicable, is utilized.", "completed": false}, {"dept_code": "CEE", "id": "1200", "course_title": "CONSTRUCTION MANAGEMENT", "description": "This course introduces undergraduates to the construction management processes including planning, financing, contract administration, and project scheduling and controlling. It is a practical course that provides a broad knowledge of managerial decision-making for young engineers. This is the basic course for all follow-on construction courses.", "completed": false}, {"dept_code": "CEE", "id": "1233", "course_title": "CONSTRUCTION DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and creative aspects of design in managerial decision-making of construction in such areas as estimating, scheduling, methods, risk management, and finance.", "completed": false}, {"dept_code": "CEE", "id": "1323", "course_title": "PRACTICAL DATA SCIENCE AND MACHINE LEARNING", "description": "This course will introduce data science and machine learning concepts to engineering students and professionals with emphasis on practical engineering applications. Key approaches and techniques for working with applied data science and machine learning with many step-by-step engineering examples, illustrations, and exercises will be presented. The course will cover a range of machine learning methods for classification, clustering and regression including k-nearest neighbors, logistic regression, Naive Bayes, support vector machines, decision trees, neural networks, support vector machines, genetic programming, and deep learning.", "completed": false}, {"dept_code": "CEE", "id": "1330", "course_title": "INTRODUCTION TO STRUCTURAL ANALYSIS", "description": "An introduction to linear analysis of statistically determinate, and indeterminate, elastic structural systems.", "completed": false}, {"dept_code": "CEE", "id": "1333", "course_title": "STRUCTURAL DESIGN PROJECT", "description": "Comprehensive (capstone) structural design project for a building or a bridge, emphasizing conceptual design, design of footings and superstructure, and preparation of cad drawings, a final written and a final oral report.", "completed": false}, {"dept_code": "CEE", "id": "1335", "course_title": "DESIGN OF STRUCTURES", "description": "This course will introduce students to the design of building and bridge structures focusing on structural theory, flow of forces, materials selection and selection of structural systems. Structural analysis concepts for a variety of structural types (trusses, frames, plates, membranes and shells) will be introduced or reinforced. Introduction to fundamental structural design in concrete, steel and timber will be affected through design projects.", "completed": false}, {"dept_code": "CEE", "id": "1341", "course_title": "DESIGN OF STEEL STRUCTURES", "description": "A course on the design of steel structures based on the load and resistance factor design (LRFD) philosophy. Fundamental topics related to the design of tension members, columns, beams, beam-columns, floor systems, plate girders and steel connections are treated. Issues in stability, fracture and fatigue are also introduced. Prerequisite: CEE 1335", "completed": false}, {"dept_code": "CEE", "id": "1401", "course_title": "OPEN CHANNEL HYDRAULICS DESIGN", "description": "Review of the basic principles of open channel flow. Design of flood control channels, riprap, gravity sewer, storm water sewer, grass-lined and natural streams are covered. Design of such hydraulic structures as spillways, stilling basins, drop structures and culverts. Other topics include the hydraulic impact from various encroachments such as from bridges, sediment discharge, scour and the utilization of the HEC-RAS computer program.", "completed": false}, {"dept_code": "CEE", "id": "1402", "course_title": "FLUID MECHANICS", "description": "A first course in fluid mechanics discussing basic principles and methods for studying static and dynamic behaviors of fluids. In the laboratory the students conduct experiments on fluid flow in pipes and open channels.", "completed": false}, {"dept_code": "CEE", "id": "1412", "course_title": "INTRODUCTION TO WATER RESOURCES ENGINEERING", "description": "Introduction to the basic concepts of surface water hydrology, meteorology, and fields of water resources engineering. Topics include: hydro-meteorological field measurement and computational methods, historical floods and droughts, flood and drought forecasting, groundwater hydrology, statistical analysis of hydrologic data, urban storm water management, irrigation, urban water supply, operational hydrology, water resources projects, water quality as it relates to hydrology, economic aspects of water resources, and introductions into open channel hydraulics and coastal engineering.", "completed": false}, {"dept_code": "CEE", "id": "1433", "course_title": "WATER RESOURCES DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false}, {"dept_code": "CEE", "id": "1503", "course_title": "INTRO TO ENVIRONMENTAL ENGRNG", "description": "Fundamentals of environmental science and engineering as applied to water and wastewater treatment, air quality control, and solid and hazardous waste management.", "completed": false}, {"dept_code": "CEE", "id": "1504", "course_title": "CHEMISTRY IN ENVIRONMENTAL ENGINEERING", "description": "This course will build on fundamentals introduced in CHEM 0960/0970 (chemistry for engineers), applying chemical concepts in the context of environmental science and engineering. Topics covered include chemical kinetics, thermodynamics, and equilibria, organic chemistry, and biochemistry. These concepts will be explored within the primary environmental media, water, soil and air. Students will be expected to work independently and in groups to tackle problem sets, in-class problems, and a class term project. Further, this course serves as a bridge to advanced courses in the environmental engineering curriculum where the concepts introduced will be further applied to understanding important environmental phenomena in CEE 1520 (mass and energy balances in environmental engineering) and CEE 1522 (fate and transport in environmental engineering), and techniques used to analyze environmental samples in CEE 1523 (environmental engineering laboratory).", "completed": false}, {"dept_code": "CEE", "id": "1513", "course_title": "ENVIRONMENTAL ENGRNG PROCESSES", "description": "Introduction to basic design concepts applied to water and wastewater treatment, air quality control, and solid and hazardous waste management.", "completed": false}, {"dept_code": "CEE", "id": "1520", "course_title": "MATERIAL AND ENERGY BALANCES IN ENVIRONMENTAL ENGINEERING", "description": "Introduces students to engineering calculations involving material and energy balances around environmental and chemical processes.", "completed": false}, {"dept_code": "CEE", "id": "1523", "course_title": "ENVIRONMENTAL ENGINEERING LAB", "description": "Chemical and biological laboratory procedures for environmental assessment and operation and control of environmental quality control systems.", "completed": false}, {"dept_code": "CEE", "id": "1533", "course_title": "ENVRL ENGR DESIGN PROJECT", "description": "Group design of an engineered system for environmental quality control.", "completed": false}, {"dept_code": "CEE", "id": "1610", "course_title": "ENGINEERING AND SUSTAINABLE DEVELOPMENT", "description": "This course is intended as an introductory interdisciplinary engineering course. Topics include principles of sustainable design in engineering, manufacturing, infrastructure, communications, and community development; overview of environmental issues for engineers; design for the environment; models of environmental processes; introduction to the use of life cycle assessment; and case studies examining the relationship of green design and the field of engineering.", "completed": false}, {"dept_code": "CEE", "id": "1703", "course_title": "TRANSPORTATION ENGINEERING", "description": "Introduction to the design, planning, operation, management, and maintenance of transportation systems. Transportation planning inter-modal transportation systems (highway, air, rails, etc.). Transportation planning of highways, airports, and railroads with traffic flow models, capacity analysis, and safety. Concepts for designing facilities and systems area study with life cycle costing procedures and criteria for optimization.", "completed": false}, {"dept_code": "CEE", "id": "1704", "course_title": "LAND DATA ANALYTICS", "description": "An Introduction to Land Surveying and Development for Civil Engineers. Topics include property and construction surveying plus land development and highway engineering. Students will learn how to utilize Surveying and other Land Data for all design disciplines in Civil Engineering.", "completed": false}, {"dept_code": "CEE", "id": "1710", "course_title": "TRAFFIC CONTROL SYSTEMS", "description": "A range of traffic control systems including the analysis and design of traffic signals are discussed along with traffic signal systems. Other topics covered include data collection for traffic control systems, optimization software and models; traffic signal hardware design; traffic signal systems selection (adaptive traffic signal systems versus traditional systems) and design and implementation.", "completed": false}, {"dept_code": "CEE", "id": "1711", "course_title": "ADVANCED TRANSPORTATION MANAGEMENT STRATEGIES", "description": "This is a management-oriented course that covers key aspects of how government transportation agencies operate their transportation systems. Focus is on the strategies that are used to improve public safety and mobility, including traffic incident management, traffic management, traveler information and pricing. Emphasis is also placed on processes, including planning, performance management and systems engineering, that agencies apply in advancing programs and projects. The course concludes with a look at the future, including the effects that automated vehicles and Smart City concepts will have on the future of transportation.", "completed": false}, {"dept_code": "CEE", "id": "1715", "course_title": "PAVEMENT MAINTENANCE AND REHAB", "description": "Engineering concepts and information needed to maintain and rehabilitate pavements. Project evaluation, testing and analysis. Design of rigid and flexible overlays, and other methods of rehabilitation. Selection of rehabilitation alternatives. Analysis of the effects of maintenance activities on pavement performance. Initial and life cycle cost analysis of various rehabilitation alternatives.", "completed": false}, {"dept_code": "CEE", "id": "1730", "course_title": "HIGHWAY ENGINEERING", "description": "Highway administration, classification, planning and programming. Geometric design of highways. Traffic characteristics and capacity analyses. Traffic operations and control. Highway design project.", "completed": false}, {"dept_code": "CEE", "id": "1733", "course_title": "TRANSPORTATION DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false}, {"dept_code": "CEE", "id": "1802", "course_title": "GEOTECHNICAL ANALYSIS", "description": "Fundamentals of the analytical and numerical methods in geotechnical engineering are explored. Emphasis will be placed upon implementation and verification of various formulations into basic programs. Seepage, stress distribution, settlement, consolidation, sheet piling wall, and beams on elastic foundations are some of the topics covered.", "completed": false}, {"dept_code": "CEE", "id": "1809", "course_title": "HYDRAULIC FRACTURING MECHANICS", "description": "This class will prepare students to wisely and critically design hydraulic fracturing treatments as well as make informed recommendations to employers, governments, and communities about the risks and benefits of hydraulic fracturing methods. Upon completion of this course, students will be equipped to use engineering formulae to estimate hydraulic fracture dimensions, evaluate strengths and weaknesses of various modeling approaches, characterize subsurface conditions from wellbore pressure analysis, make sound recommendations for monitoring, and compare and contrast approaches and risks for a range of application domains.", "completed": false}, {"dept_code": "CEE", "id": "1821", "course_title": "FOUNDATION ENGINEERING", "description": "Application of the principles of soil mechanics to the analysis and design of foundations, the stability of slopes and retaining structures.", "completed": false}, {"dept_code": "CEE", "id": "1833", "course_title": "GEOTECHNICAL DESIGN PROJECT", "description": "Consists of comprehensive projects with emphasis on the nature of engineering problem solving and the creative aspects of design.", "completed": false}], "links": [{"source": "1105", "target": "1715"}, {"source": "1200", "target": "1233"}, {"source": "1330", "target": "1335"}, {"source": "1330", "target": "1809"}, {"source": "1330", "target": "1821"}, {"source": "1335", "target": "1341"}, {"source": "1401", "target": "1433"}, {"source": "1402", "target": "1412"}, {"source": "1503", "target": "1513"}, {"source": "1503", "target": "1523"}, {"source": "1703", "target": "1730"}]}