{"nodes": [{"dept_code": "ENGFLM", "id": "0355", "course_title": "VISUAL LITERACY", "description": "This is an online course. Visual literacy is an emerging area of study which deals with the growing importance of visual culture in our contemporary world and how we interpret what is seen. This course will emphasize the process of critically viewing specific media artifacts and provide tools to students that will allow them to comprehend and evaluate information presented by a variety of forms of visual media, including television, video, film, photography, and the internet. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0400", "course_title": "INTRODUCTION TO FILM", "description": "This is a basic course on the visual arts that offers the student abroad introduction to the medium of film. As part of this overview, the class will consider such issues as: the process of contemporary film production and distribution; the nature of basic film forms; selected approaches to film criticism; comparisons between film and the other media.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0401", "course_title": "INTRODUCTION TO VISUAL CULTURE", "description": "This course develops skills to interpret visual culture in contemporary life. Using a wide variety of media, including film, television, advertisements, fashion magazines, museum exhibits, comic books, painting, graffiti, video games, the web, and photography, the course focuses on understanding how conceptions of visuality, gender, race, and politics shape definitions of high and low culture as well as questions of knowledge and being. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0530", "course_title": "FILM ANALYSIS", "description": "This course introduces students to the art of the cinema, and to the techniques for its formal and iconographic analysis. It examines the nature of shot composition and visual framing, the use of color, the role of lighting as a pictorial element, the potentials of camera movement, the modes of editing and the nature of image/sound montage. It also introduces students to dominant cinema forms--narrative, experimental, documentary, etc.--And connects the cinema to visual arts (like painting and sculpture).", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0540", "course_title": "WORLD FILM HISTORY", "description": "This course both introduces students to techniques of film analysis and acquaints them with major works and movements in international cinema. The course pays particular attention to the evolution of film narrative and visual style through landmarks in film development--European avant-garde films, British documentary, Italian neo-realism, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0585", "course_title": "TECHNOLOGIES OF THE BODY", "description": "This course considers how we learn new technologies by looking at the treatment of the body in cinema and television, as well as animation, sports, gaming, and VR. In addition to analyzing media examples, students will experiment with low-tech and high-tech adaptations of optical toys and smart phone cinema to explore how movement and the body have been imagined in science and entertainment. This is a Critical Studies course with Production elements and counts for Category III towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "0812", "course_title": "MEDIA/ECOLOGY", "description": "From the late twentieth century to the present, ecology as a scientific discipline and set of cultural narratives has risen to the forefront of knowledge production as a way to study and understand complex biological systems, their environments, and their internal dynamics. During the same period, media systems have grown exponentially in complexity until they too have begun to exhibit some of the behaviors of ecological systems, including self-organization, feedback, evolution, and emergent properties. The term \"media ecology\" captures both this new, nonlinear systems approach to understanding media itself as well as the intersection between natural ecosystems and the technological assemblages with which they are intertwined. This course will explore both media that interface with natural ecosystems and works that engage contemporary media systems at different scales. The secret life of information, contagious media, and the post-natural ecologies of our present and future will challenge us to conceive of Media and Ecology as a single coupled system: the emblem of our contemporary environment. Students will have the option to produce collaborative media projects that explore the themes of the course. These can take the form of simulations, games, network graphing, film or video projects, local ecosystem analysis and/or visualization, or the mapping and analysis of a media ecosystem that interfaces with the environment. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1390", "course_title": "CONTEMPORARY FILM", "description": "Surveys international film from 1970 to the present and the major film movements of the period. It also demonstrates the stylistic and cultural interrelationships between the international film schools. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1470", "course_title": "FILM DIRECTORS", "description": "This is a course that changes topics every term; please see the Topic title and/or Class Notes for the specific director. This course looks at the mode of production of films and works to understand the interweaving contributions of directors, producers and screenwriters. It will also consider less personal forces--social climate, studio style, genre and audience taste. It examines the films of particular directors for signs of personal style, theme, or personal preoccupation. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1472", "course_title": "HITCHCOCK'S FILMS", "description": "This course will look at the development of Hitchcock's cinema as a way of touching upon issues central to the study of film as a cultural force; the relationship between art and entertainment; the social origins of suspense and fear; the role of the director in creating a film's meaning; the role and function of genre and cross-generic influence. We will closely look at films from all phases of Hitchcock's career and examine what their style, tone, and subject matter reveal about the powers of cinema and Hitchcock's influence on a new generation of directors. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1533", "course_title": "DISABILITY IN FILM AND TELEVISION", "description": "This course explores disability in media through representational tropes and trends as well as how political activism has focused on mainstream media as a site for protest, a site for education, and a site for self expression. We will explore trends in film and television while engaging with the important roles of social media and online communities. This is a Critical Studies course and counts for Category II for the Film and Media Studies major and minor. It (will be) part of the Disability Studies Certificate.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1545", "course_title": "AMERICAN FILM AND TELEVISION HISTORY", "description": "This American Film and Television Industry course is designed to demystify the film and television business, and give students a sense of the process and structures in which films and television shows are made and brought to market. They will explore the roles of the key personnel on a movie or television show from conception to completion including cinematographers, editors, writers, producers and directors. They will also examine the roles of agents, managers, lawyers and executives and learn how decisions are made from greenlight to distribution. Students will learn about the history of the entertainment industry from the studio system to present day and consider the disruptions of the films business today in that context. In order to truly understand this industry, students will read first-hand accounts of life in the industry and watch documentaries and narrative films that shed light on the film business. They will read texts that give overviews of how the industry works, its history, and how it has changed. Students will do their own research on various aspects of entertainment from production to distribution, and work in groups to present this research to the class. They will also be asked about how modes of production inform content. Guest speakers will speak to the class periodically to talk to their own experiences in the business. Ultimately, students will focus an area they are passionate about to complete a mid-term and a final project that will reflect their comprehensive knowledge of various aspects of the American film industry.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1549", "course_title": "INDUSTRIES AND FESTIVALS", "description": "This Film and Media Studies Program topics course serves as an overview of film histories historically and today, and it will explore the crucial ways that film industries have shaped contemporary production, exhibition, and distribution practices. Within the course, there will be a specific emphasis on film festival as a crucial element in global cinema. Film industries, be they free market giants such as Hollywood or national industries funded in part or in whole by the state, are crucial factor in the ways that films are made and shown, influencing aesthetics, politics, and the cultures of filmmaking. Explorations of film industries have shown how distinct market forces, technologies, national politics, and globalization have affected all aspects of cinema. This course will examine these elements, focusing on the Classical Hollywood era, the 1970s New American Cinema, and contemporary transnational film industries. Moreover, the course will focus specifically on the role of film festivals in the film industry. Since the pre-WWII era, film festivals have played a crucial role in a myriad of industries and markets, developing alternatives to Hollywood, promoting national cinemas, legitimizing colonialism, advocating anti-colonialism, and imagining a space for art in the cinematic industry. The course will examine festival history, theory and methods, allowing students to learn about how festivals have impacted industry history and how festivals are produced and executed.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1684", "course_title": "MOCKUMENTARY: PRODUCTION AND CRITICISM", "description": "The mockumentary - a fictional film made to \"look like\" a documentary - became popularized as a term to describe a distinct genre in coverage of Rob Reiner's 1984 film This is Spinal Tap. Since then, the genre has evolved to treat a variety of subjects through a range of styles - including straightforward hoaxes, social parodies, and sharp criticisms of nonfictional form. In addition to readings, lectures and discussions, students in this class will produce short mockumentary projects. Previous production experience is not required. This is a Production course with Critical Studies elements and counts for Category III towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1705", "course_title": "QUEER CINEMAS", "description": "While sexuality in the cinema has been subjected to various ideological and regulatory constraints, the same has also been true of lived sexuality. Likewise, and despite appearances, the history of sexual representation in the media is just as dynamically diverse as the history of sexualities as lived in the twentieth and twenty-first centuries. This course is both a general introduction to queer theory-especially as it relates to visual culture-and an investigation into queer theory's impact on media history, media criticism, and/or film and video production. A portion of the course will be devoted to reevaluating the history of the dominant media's narrative representation and regulation of queer bodies and subjectivities. The course will also serve as a brief survey of contemporary LGBTQ media practices. Course screenings and readings are occasions for pleasure, as well as occasions to think through the implications and problems of different, queer, and deviant representational strategies.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1752", "course_title": "TELEVISION ANALYSIS", "description": "This course studies television as a visual medium, an industry, and as a cultural force by examining the forms television programming takes and the way these structures influence viewer response. We will examine specific television genres from longstanding series types (sitcoms, cop shows, serials, etc.) to the gendered forms of \"quality\" television. This is a Critical Studies course with Production elements and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1760", "course_title": "CINEMA AND VIDEO GAMES", "description": "This course introduces a comparative study of cinema and video games, exploring their historical, cultural, aesthetic, technological and industrial intersections. Combining film screenings with game plays, we will try to understand how cinema and video games inform, influence and converge with each other. We will focus on race, gender, and ethical issues of visual representations in both cinema and video games. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGFLM", "id": "1920", "course_title": "ADVANCED SEMINAR IN FILM STUDIES", "description": "This course is designed for Film and Media Studies majors and can be taken only when all other major requirements are satisfied. It will focus on issues of film history (either as an historical survey or through an examination of particular themes and/or problems that have arisen in the critical literature). The class will be organized as a seminar, and will involve considerable writing and/or class presentation on the part of students. This Category II course is a required capstone in the Critical Studies track of the Film and Media Studies major.", "completed": false, "prereq_count": 0}], "links": []}