{"nodes": [{"dept_code": "IE", "id": "0015", "course_title": "INTRODUCTION TO INFORMATION SYSTEMS ENGINEERING", "description": "In recent years it has become commonplace for organizations to use large amounts of data to make more informed data-driven decisions. This big data revolution has created an increasing need for engineers who can extract and communicate valuable insights from large and unprocessed data. This requires a variety of tools and techniques, from storing and retrieving the data, to processing it, to visualizing and analyzing it, to eventually effectively communicating any findings that are obtained from it. This course teaches these essential tools and techniques, and it prepares the student with the thought process needed to comfortably use these tools and techniques in an industry setting. The course is also a precursor for more advanced data science courses in the curriculum.", "completed": false}, {"dept_code": "IE", "id": "1035", "course_title": "ENGINEERING MANAGEMENT", "description": "This course focuses on management theory applied to engineering and technical organizations. Topics include: the management process and management functions (planning, organizing, leading, and controlling); project management; managing technical people; engineering ethics, globalization, and other contemporary management concepts.", "completed": false}, {"dept_code": "IE", "id": "1040", "course_title": "ENGINEERING ECONOMIC ANALYSIS", "description": "Discusses cost estimation, time value of money, interest rate calculations, economic equivalence concepts, comparison of alternative investments, evaluating economic life and replacement alternatives, depreciation, the impact of taxes on engineering economic decisions, and dealing with uncertainty.", "completed": false}, {"dept_code": "IE", "id": "1045", "course_title": "TRANSPORTATION PLANNING METHOD: OR APPLICATIONS", "description": "This course will focus on modeling and optimization of a wide range of systems in the field of transportation. It will cover quantitative techniques of Operations Research with emphasis on applications in transportation systems analysis and planning: Operations, Management, Transportation technologies and evaluation of passenger and freight transportation systems, Implementation of the Decision Support Systems, Data Envelopment Analysis (DEA) and Heuristic Algorithms.", "completed": false}, {"dept_code": "IE", "id": "1052", "course_title": "MFG PROCESSES AND ANALYSIS", "description": "Introduction to manufacturing principles and their importance in product development. Traditional and emerging processes are covered, including additive manufacturing, micro manufacturing, and nonmanufacturing. The integration of manufacturing, design, and materials is presented as a key to rapid product realization. Unit manufacturing processes are considered in work cell organization, flexible flow lines, and quality control. The course laboratory involves examination of the details of manufactured products, using various manufacturing processes, and learning the importance of material and process selection in product development.", "completed": false}, {"dept_code": "IE", "id": "1054", "course_title": "PRODUCTIVITY ANALYSIS", "description": "Introduction to industrial engineering concepts and thought process mapping, operations analysis, and design, 6s, lean systems, root cause analysis, methods engineering, standards development, predetermined time systems, computerized work measurement, motivation and incentives.", "completed": false}, {"dept_code": "IE", "id": "1055", "course_title": "FACILITY LAYOUT AND MATERIAL HANDLING", "description": "Introduction to facility layout and location topics including activity relationships, space and personnel requirements, layout types, manual and computer algorithms for constructing layouts, single facility location methodologies, and warehouse operations. Material handling methods and equipment including conveyors, lift trucks, carousels, automated guided vehicles, and automated storage and retrieval systems are also discussed.", "completed": false}, {"dept_code": "IE", "id": "1061", "course_title": "HUMAN FACTORS ENGINEERING", "description": "A study of human abilities, characteristics, behavior, and motivation in the design, development and operation of components and systems designed for human use.", "completed": false}, {"dept_code": "IE", "id": "1062", "course_title": "DATA MINING", "description": "This is an introductory data analytics class that requires probability as a prerequisite. The objective is to prepare students to effectively collect and analyze data and to teach data-driven thinking, problem-solving and decision-making. In this class, we will cover various statistics and data mining methodologies and use them to analyze real-world problems.", "completed": false}, {"dept_code": "IE", "id": "1071", "course_title": "STATISTICAL TESTING AND REGRESSION", "description": "Hypotheses testing; multiple regression; empirical model building; analysis of variance and design of experiments; goodness-of-fit tests and contingency tables; introduction to statistical quality control.", "completed": false}, {"dept_code": "IE", "id": "1072", "course_title": "DESIGN OF EXPERIMENTS & QUALITY ASSURANCE", "description": "This elective course serves as a continuation of the second course to provide IE majors with background in designed experiments and quality assurance methods.", "completed": false}, {"dept_code": "IE", "id": "1080", "course_title": "SUPPLY CHAIN ANALYSIS", "description": "An overview of supply chain management with an emphasis on operations and strong quantitative orientation. Supply chain strategies; sourcing decisions; demand forecasting; aggregate planning; managing supply and demand; production and inventory control systems including MRP and JIT; dealing with uncertainty; distribution networks; coordination and integration.", "completed": false}, {"dept_code": "IE", "id": "1081", "course_title": "OPERATIONS RESEARCH", "description": "Introduction to the decision-making process and mathematical modeling; theory and methodology of the simplex algorithm; duality theory, complementary slackness, post-optimality analysis; transportation and assignment problems; introduction to integer programming application to real-life case problems; computer codes.", "completed": false}, {"dept_code": "IE", "id": "1082", "course_title": "PROBLSTC METH IN OPERATNS RES", "description": "Stochastic decision modeling techniques including discrete-time Markov chains, continuous 'time Markov chains and queuing theory.", "completed": false}, {"dept_code": "IE", "id": "1083", "course_title": "SIMULATION MODELING", "description": "Random number generation; distribution functions and random variates; game of chance; applications of discrete event simulation methods of queuing, inventory control, and production planning problems. Introduction to special-purpose simulation languages.", "completed": false}, {"dept_code": "IE", "id": "1085", "course_title": "DEPARTMENTAL SEMINAR", "description": "Departmental seminars present the engineering viewpoint by prominent speakers from industry and government. Also serves as an organizational forum for the university chapter of the institute of industrial engineers.", "completed": false}, {"dept_code": "IE", "id": "1090", "course_title": "SENIOR PROJECTS", "description": "Analytical investigation techniques for total project problems in technical organizations. Involves solving of client problems utilizing industrial engineering capabilities acquired by students during program of study. Provides students with project team experience, report writing and seminar presentation of team results. Students must be enrolled in this course at least one month prior to the start of the semester.", "completed": false}, {"dept_code": "IE", "id": "1102", "course_title": "LEAN SIX SIGMA I (GREEN BELT)", "description": "This course provides an introduction to lean and six sigma principles with an emphasis on the application of statistics to quality control. Topics include value stream mapping, various lean tools, DMAIC methodology, data collection and measurement, and applications of ANOVA and doe. A project is required and the student should be prepared for green belt certification at the end of the course.", "completed": false}, {"dept_code": "IE", "id": "1108", "course_title": "HEALTH SYSTEMS ENGINEERING: QUANTITATIVE ANALYTICS", "description": "This course leads students to apply basic industrial engineering tools to healthcare, with a focus on the financial aspect of healthcare (payers and reimbursement, revenue cycle, and other financial analytics). This course familiarizes students with healthcare financial data, demographic and population health information, quality ratings, and other key data and measures. Students will access data from commercial payers, government healthcare programs and/or hospitals, and utilize data analysis and industrial engineering tools to better understand the financial aspect of healthcare systems in the United States. (This class is designed to be a complement to IE 1106/2106.)", "completed": false}, {"dept_code": "IE", "id": "1202", "course_title": "INTRODUCTION TO MEDICAL PRODUCT DEVELOPMENT", "description": "This is an undergrad/grad level course in medical product development covering fundamentals, regulatory processes, intellectual property management, and commercialization strategies. This course will provide basic knowledge on the development of medical devices including designing, manufacturing and testing medical devices. This course will also provide an overview of the medical product commercialization (i.e., bench to bedside). This course will develop the studentâ\u0080\u0099s ability to select and properly use the biomaterials and manufacturing processes for developing medical devices, instruments, biomedical sensors and artificial organs. Students will also learn how to commercialize the medical products to the market through intellectual property management and regulatory processes.", "completed": false}, {"dept_code": "IE", "id": "1203", "course_title": "WAREHOUSE OPERATIONS", "description": "In both manufacturing and service, transportation and logistics have become increasingly important. A principal component of many logistics systems are warehouses and distribution centers. Companies in the retail sector, healthcare related fields, and manufacturing all have significant distribution networks that utilize warehouses and distribution centers to supply their products. The aim of this course is to study and analyze key factors affecting the productivity of logistics operations and material flows in facilities. In particular, the course focuses on warehouse and distribution center design and operations including material handling equipment and system design, order picking, sortation systems, and cross docking.", "completed": false}, {"dept_code": "IE", "id": "1302", "course_title": "ENGINEERING FOR PROCESS SAFETY", "description": "Engineering for process safety\" provides for a basic understanding of the quantitative and qualitative analysis methods of process safety engineering and process safety management. The course also provides guidance in planning, implementing and managing an overall process safety management program. It includes coverage of such applicable science and engineering principles as risk, human reliability, fault logic, failure modes, incident cost and prediction. The course is presented in an applied format where several different types of industries are discussed such as oil and chemical, pharmaceuticals, defense, nuclear, aerospace, paper, information technology and manufacturing industries. Regulatory influence on process safety is discussed. Quantitative aspects of the course include application of risk analysis, fault tree analysis, hazard and operability analysis, vapor-cloud dispersion modeling, human reliability analysis, failure modes and effects analysis, etc. This course is also intended to provide a background in managing an overall system safety program and its application to several industries, therefore, cost and effectiveness measurement are covered in the material.", "completed": false}], "links": [{"source": "0015", "target": "1062"}, {"source": "1035", "target": "1090"}, {"source": "1040", "target": "1108"}, {"source": "1054", "target": "1102"}, {"source": "1054", "target": "1108"}, {"source": "1055", "target": "1080"}, {"source": "1071", "target": "1072"}, {"source": "1071", "target": "1082"}, {"source": "1071", "target": "1083"}, {"source": "1071", "target": "1102"}]}