{"nodes": [{"dept_code": "BUSMKT", "id": "1040", "course_title": "INTRODUCTION TO MARKETING", "description": "Provides an understanding of the roles of marketing in the economy and the firm, and develops a rationale for a marketing perspective as a guide to organizational and individual actions. Topics covered are the marketing environment, strategic planning, market segmentation, product development, pricing, distribution, promotion, consumer decision-making, control, and marketing management.", "completed": false}, {"dept_code": "BUSMKT", "id": "1041", "course_title": "INTRODUCTION TO MARKETING HONORS + 1", "description": "", "completed": false}, {"dept_code": "BUSMKT", "id": "1411", "course_title": "MARKETING RESEARCH", "description": "Emphasizes the development of methods of decision making for marketing management. Formal tools of decision making are stressed. The collection and analysis of marketing data is viewed in the context of a management information system. Provides a common analytical framework for later courses treating specialized aspects of marketing in depth.", "completed": false}, {"dept_code": "BUSMKT", "id": "1422", "course_title": "PRINCIPLES OF SELLING", "description": "Selling is universal. Everyone uses persuasive communication to \"sell\" products, services, ideas, opinions, or points of view. Examine and practice the techniques and use the tools examined to develop and/or improve your sales skills. Focused on business-to-business sales, the concepts will apply to negotiating mutually beneficial agreements. From customer identification thru gaining agreement and follow-up, learn to identify customer problems and develop solutions that appeal to customers and benefit your organization.", "completed": false}, {"dept_code": "BUSMKT", "id": "1426", "course_title": "ADVERTISING AND SALES PROMOTION", "description": "Provides students with an understanding of advertising and the marketing process within which effective advertising and sales promotions are rooted. It is further designed to teach students to develop effective advertising and promotion plans. Emphasis will be placed on both theoretical and conceptual foundations and their applications to the fields of advertising and sales promotions.", "completed": false}, {"dept_code": "BUSMKT", "id": "1427", "course_title": "PUBLIC RELATIONS MANAGEMENT", "description": "This course will examine how public relations fits into the strategic management of organizations and how it impacts a firm's performance. Students will develop a competence in applying public relations principles to organizational opportunities and problems, with a focus on developing sound public relations writing skills.", "completed": false}, {"dept_code": "BUSMKT", "id": "1428", "course_title": "DIGITAL AND SOCIAL MEDIA MARKETING", "description": "This course covers advertising, marketing, and communications strategies in the new media landscape where traditional and social media co-exist. The course will focus on 1) how social media strategies can be used effectively in marketing programs, 2) when they should/should not be used, 3) how to build them, and 4) how to measure, track, and evaluate their performance and effectiveness. This marketing strategy course will focus on analyzing, developing, implementing, and evaluating media strategies as an integral part of overall marketing strategy.", "completed": false}, {"dept_code": "BUSMKT", "id": "1431", "course_title": "PRODUCT DEVELOPMENT AND MANAGEMENT", "description": "Addresses all stages of the product life cycle beginning with the various phases of new product development, including creativity and new product concept generation, concept testing and evaluation, pricing, demand forecasting and new product marketing strategies. Also deals with special challenges related to marketing mature products/services, improving marketing implementation effectiveness, and marketing the intangible features of products.", "completed": false}, {"dept_code": "BUSMKT", "id": "1435", "course_title": "SERVICES MARKETING", "description": "The focus of this course is to develop the students' skills as marketers-broading tools learned in the intro course to include development of strategies and programs for service firms. Course utilizes problem solving techniques through presentation, discussion, and analysis of contemporary service marketing cases involving examples of consumer and business to business services in both large and small firms. The course is appropriate for 1) any student seeking a follow-up course to the basic marketing class; 2) students who plan marketing careers with service firms.", "completed": false}, {"dept_code": "BUSMKT", "id": "1441", "course_title": "CONSUMER BEHAVIOR", "description": "Focuses on the study of individual consumers through the integration of a wide variety of social science concepts and gaining familiarity with some of the more common techniques of consumer research methodology.", "completed": false}, {"dept_code": "BUSMKT", "id": "1447", "course_title": "MARKETING ANALYTICS FOR CUSTOMER ENGAGEMENT", "description": "This course introduces students to analytical rigor and data-centric techniques used to plan, execute, and measure a variety of marketing and paid media campaigns. It will give them hands-on experience in making quantitative decisions about the customers and prospects they target, the types of advertising and promotional programs they design, and how much they can afford to spend to achieve their financial objectives.", "completed": false}, {"dept_code": "BUSMKT", "id": "1451", "course_title": "RETAIL MANAGEMENT", "description": "Emphasizes the strategic decisions for developing an enduring store image, and the marketing policies to produce customer satisfaction through service quality. Topics covered include store location, layout and atmosphere, logistics and information systems, merchandising, vendor relations and customer services, as well as topics related to non-store retailing.", "completed": false}, {"dept_code": "BUSMKT", "id": "1470", "course_title": "SPORTS MARKETING", "description": "This course will provide a framework for understanding how various marketing strategies are formulated, implemented, and evaluated in sports context. Sports have been one of the major economic activities of our modern society, and knowledge of the role marketing plays in its operation has emerged as a valuable asset to all the parties involved (e.g., firms, governments, consumers, and players).", "completed": false}, {"dept_code": "BUSMKT", "id": "1481", "course_title": "BRAND MANAGEMENT", "description": "Exposes students to a wide range of marketing problems and provides them with the analytic perspectives and strategic marketing decision tools for analyzing and solving those problems.", "completed": false}, {"dept_code": "BUSMKT", "id": "1485", "course_title": "PROJECTS IN MARKETING", "description": "BUSMKT 1485 connects undergraduate marketing students with prominent commercial/government clients to develop/implement specific marketing strategies. Students receive hands-on exposure to planning, strategy, research, advertising, public relations, event planning, and budgeting. Students demonstrate oral/written presentation skills via formal presentations to representatives from the client organizations.", "completed": false}, {"dept_code": "BUSMKT", "id": "1490", "course_title": "MARKETING INTERNSHIP", "description": "The marketing internship provides business credits for project assignments that augment a professional marketing work experience.", "completed": false}], "links": [{"source": "1040", "target": "1411"}, {"source": "1040", "target": "1422"}, {"source": "1040", "target": "1426"}, {"source": "1040", "target": "1427"}, {"source": "1040", "target": "1428"}, {"source": "1040", "target": "1431"}, {"source": "1040", "target": "1435"}, {"source": "1040", "target": "1441"}, {"source": "1040", "target": "1451"}, {"source": "1040", "target": "1481"}, {"source": "1040", "target": "1485"}]}