{"nodes": [{"dept_code": "FMST", "id": "0120", "course_title": "INTRODUCTION TO FILM", "description": "This is an entry-level course on the visual arts that offers the student a broad introduction to the medium of film. As part of this overview, the class will consider such issues as: the process of contemporary film production and distribution; the nature of basic film forms; selected approaches to film criticism; comparisons between film and the other media. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0130", "course_title": "INTRODUCTION TO VISUAL CULTURE", "description": "This course develops skills to interpret visual culture in contemporary life. Using a wide variety of media, including film, television, advertisements, fashion magazines, museum exhibits, comic books, painting, graffiti, video games, the web, and photography, the course focuses on understanding how conceptions of visuality, gender, race, and politics shape definitions of high and low culture as well as questions of knowledge and being. This is a Critical Studies course and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0150", "course_title": "FILM ANALYSIS", "description": "This course introduces students to the art of the cinema, and to the techniques for its formal analysis. It examines the nature of shot composition and visual framing, the use of color, the role of lighting as a pictorial element, the potentials of camera movement, the modes of editing and the nature of image/sound montage. It also introduces students to dominant cinema forms--narrative, experimental, documentary, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0170", "course_title": "WORLD FILM HISTORY", "description": "This course both introduces students to techniques of film analysis and acquaints them with major works and movements in international cinema. The course pays particular attention to the evolution of film narrative and visual style through landmarks in film development--European avant-garde films, British documentary, Italian neo-realism, etc. This is a Critical Studies course and is a required course for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0280", "course_title": "HISTORY OF FRENCH CINEMA", "description": "This course will introduce students to the history of cinema in France from the beginnings of cinema to the present day. We will examine films from all periods and consider a diversity of forms and genres, including mainstream narrative films, art films, avant-garde experiments, blockbusters, and documentaries. No previous course experience with cinema is presumed as we will learn the basics of how to watch, discuss, and write about films and the film industry. The course will be taught in English; readings will be available in English; and all films with have English subtitles. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0321", "course_title": "RUSSIAN FILM STALIN TO PUTIN", "description": "The course traces the history of Russo-Soviet cinema from the death of Stalin to the present. Particular attention is paid to the four major periods in Russo-Soviet history since the death of Stalin.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0700", "course_title": "SCREENWRITING AND NARRATIVE", "description": "This course will explore developing character-based stories in the screenplay form. Students will be exposed to a variety of readings including original screenplays, related prose, and texts which reinforce basic tenets of good story telling. Students will write rigorously building from idea to outline with great attention to structure and character development. Students will develop writing abilities, critical facilities in approaching work, and an understanding of principles of storytelling common in narrative forms.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0780", "course_title": "INTRODUCTION TO AUDIO STORYTELLING", "description": "Created for cross-listing with ENGWRT 710. Podcasts are growing as an industry and an art form. There has never been a better time to tell stories in sound. In this introductory production course, we'll explore the craft of narrative audio across genres, including live storytelling, profiles, and flash fiction. Through a series of short creative projects, you'll learn the foundations of interviewing, field recording, scripting, structure, and sound design, while gaining basic technical competency in professional audio editing software. Class sessions will include a blend of discussions, workshops, and hands-on production, preparing you for more advanced work in the medium. This is a writing- and production-intensive course. You should expect to invest significant time and energy planning, scripting, recording, and editing your projects outside of class-and significant time in class discussing your peers' work through both written and oral critiques. This course welcomes writers from all backgrounds and genres. No previous experience with audio production is expected or required.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0790", "course_title": "TECHNOLOGIES OF THE BODY", "description": "This course considers how we learn new technologies by looking at the treatment of the body in cinema and television, as well as animation, sports, gaming, and VR. In addition to analyzing media examples, students will experiment with low-tech and high-tech adaptations of optical toys and smart phone cinema to explore how movement and the body have been imagined in science and entertainment. This is a Critical Studies course with Production elements and counts for Category III towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0800", "course_title": "FILMMAKING 1: FUNDAMENTALS", "description": "Filmmaking is a creative process that combines art, science, craft, and collaboration. This course is a hands-on introduction to the process, starting with the building blocks of motion pictures: light and cameras, composition, editing, and visual storytelling. You will complete two short videos over the course of the semester, shooting video with DSLR cameras and editing using Adobe Premiere Pro. In-class exercises will provide a deeper understanding of making moving images.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0827", "course_title": "ADVANCED EDITING", "description": "\"Advanced Editing\" offers students engaged in film and media production the unique opportunity to focus and expand their editing skills through the process of appropriating and repurposing pre-existing audiovisual materials. Students will work with materials from a range of sources, including popular Hollywood movies, digitally archived \"orphan\" films, television commercials, and propaganda films. The act of transforming already existing creative works into newly created short film projects will allow three key learning objectives to be met: (i) students will further hone their awareness of the ideological and formal functions of their source media as they decontextualize and recontextualize it for alternative purposes; (ii) students will develop a better awareness of their own critical and creative orientations as they are required to position their own projects in relation to others; (iii) students will develop their competence with multiple professional NLEs like Avid Media Composer, Adobe Premiere and DaVinci Resolve. By focusing on nonfiction and experimental editing practices, where the meaning and purpose of available footage is open for interpretation, students enrolled in the course will experience the transformative power of editing to shape and understand media.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0835", "course_title": "ELEMENTS OF AUDIO PRODUCTION", "description": "This course explores sound as a fundamental element of human experience and media. Audio production techniques are the primary focus of the class. Hands-on training prepares students to record broadcast-quality audio across a range of contexts; including interviews, narration, field recordings, and live events, and to edit and mix those recordings for various media using industry standard software. Class discussions cover how various microphones work and how to use them, as well as the physics, history, and theory of sound recording. This course welcomes students looking to deepen their understanding of audio production, as well curious beginners. This course fulfills a Technical Elective requirement in the Film and Media Studies Production Track.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "0845", "course_title": "FILMMAKING 2: SIGHT AND SOUND", "description": "In this hands-on course, you will continue to acquire the skills required to design, shoot and edit HD video. Demonstrations and in-class exercises introduce more professional camera operation, lighting, sound, special effects, and editing workflows. You will apply this new knowledge and facility to several out-of-class assignments of increasing sophistication over the course of the semester.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1195", "course_title": "DIVERSITY IN BRITISH CINEMA: RACE, GENDER AND CLASS", "description": "This course considers race, gender and class in close dialogue with the underlying cultural phenomena that shape the British cinematic landscape. The course is designed to introduce students to British cinema whilst engaging in theory, practice and analysis. It intertwines historical accounts with film screenings and lectures as well as discussions with filmmakers and curators. This is a Category I course in the FMST major and minor for the Pittsburgh London Film Program study abroad.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1215", "course_title": "ADAPTED FOR THE SCREEN: CHINESE LITERATURE AND FILM", "description": "Adapted for the Screen: Chinese Literature and Film", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1240", "course_title": "INTRODUCTION TO KOREA THROUGH FILMS", "description": "Introduces Korean cinema to students in broader (and at times narrow) cultural, social, and aesthetic contexts to investigate transnational media production and circulation, globalization, consumer culture, commercialization, and construction of national, ethnic and gender identities. Through this course, students will learn more about specific issues pertaining to Korea and its people, as well as gain familiarity with some prominent film directors of Korea's. They will develop a critical and historical consciousness of Korean visual culture, assessing the worth and content of the films.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1275", "course_title": "CONTEMPORARY FILM", "description": "Surveys international film from 1970 to the present and the major film movements of the period. It also demonstrates the stylistic and cultural interrelationships between the international film schools. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1292", "course_title": "NAZI CULTURE", "description": "In an era of Alt-Right and growing neo-Nazi movements, this course takes us to the past to understand our present. We will rely on the films and other primary sources of the Third Reich to understand the conditions in Germany and what motivated the Germans to make the choices they did. We will examine anti-Semitism, racism, gender and sexuality, mass culture, the cult of the leader, propaganda, and more.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1350", "course_title": "FILM DIRECTORS", "description": "This is a course that changes topics every term; please see the Topic title and/or Class Notes for the specific director. This course looks at the mode of production of films and works to understand the interweaving contributions of directors, producers and screenwriters. It will also consider less personal forces--social climate, studio style, genre and audience taste. It examines the films of particular directors for signs of personal style, theme, or personal preoccupation. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1355", "course_title": "HITCHCOCK'S FILMS", "description": "This course will look at the development of Hitchcock's cinema as a way of touching upon issues central to the study of film as a cultural force; the relationship between art and entertainment; the social origins of suspense and fear; the role of the director in creating a film's meaning; the role and function of genre and cross-generic influence. We will closely look at films from all phases of Hitchcock's career and examine what their style, tone, and subject matter reveal about the powers of cinema and Hitchcock's influence on a new generation of directors. This is a Critical Studies course and counts for Category I towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1508", "course_title": "TELEVISION ANALYSIS", "description": "This course studies television as a visual medium, an industry, and as a cultural force by examining the forms television programming takes and the way these structures influence viewer response. We will examine specific television genres from longstanding series types (sitcoms, cop shows, serials, etc.) to the gendered forms of \"quality\" television. This is a Critical Studies course with Production elements and counts for Category II towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1533", "course_title": "DISABILITY IN FILM AND TELEVISION", "description": "This course explores disability in media through representational tropes and trends as well as how political activism has focused on mainstream media as a site for protest, a site for education, and a site for self expression. We will explore trends in film and television while engaging with the important roles of social media and online communities. This is a Critical Studies course and counts for Category II for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1545", "course_title": "THE AMERICAN FILM AND TELEVISION INDUSTRY", "description": "The American Film and Television Industry is a critical studies Film and Media Studies course is designed to give students an extensive view of the various roles involved in the making of film and television and a sense of how these roles have changed over as the entertainment business itself have changed. In addition to learning about the history of the industries as well as the responsibilities of different jobs above and below the line, students will do their own research towards two major projects for the course. This is a Category II critical studies course.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1549", "course_title": "INDUSTRIES AND FESTIVALS: FILM AND MEDIA", "description": "This course explores how film industries have shaped contemporary production, exhibition, and distribution practices with focus on the role of film festivals in the film industry. We will examine festival history, theory, and methods to learn how festivals have impacted industry history and how festivals are produced and executed. This is a Critical Studies course and counts for Category II for the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1699", "course_title": "ADVANCED SEMINAR IN FILM STUDIES", "description": "This course is designed for Film and Media Studies majors and can be taken only when all other major requirements are satisfied. It will focus on issues of film history (either as an historical survey or through an examination of particular themes and/or problems that have arisen in the critical literature). The class will be organized as a seminar, and will involve considerable writing and/or class presentation on the part of students. This Category II course is a required capstone in the Critical Studies track of the Film and Media Studies major.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1715", "course_title": "MOCKUMENTARY: PRODUCTION AND CRITICISM", "description": "The mockumentary - a fictional film made to \"look like\" a documentary - became popularized as a term to describe a distinct genre in coverage of Rob Reiner's 1984 film This is Spinal Tap. Since then, the genre has evolved to treat a variety of subjects through a range of styles - including straightforward hoaxes, social parodies, and sharp criticisms of nonfictional form. In addition to readings, lectures and discussions, students in this class will produce short mockumentary projects. Previous production experience is not required. This is a Production course with Critical Studies elements and counts for Category III towards the Film and Media Studies major and minor.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1765", "course_title": "VIRTUAL REALITY", "description": "Can there be more than one reality? Is there even one? What relationship do the senses and the mind bear to the physical environment? From the dawn of human society, no topic has been more fiercely debated than the nature of reality. In narrative, philosophy, and media, virtual reality has always been with us. This course dives deep into the rabbit hole of the real and the virtual, an adventure that includes philosophy, literature, film, and, of course, VR headsets aplenty! In addition to exploring the history of the real and the virtual, we will consider the relationship of virtual reality to the body, to space, to human gesture and communication, and to code. We will also explore the role of the imagination and creativity in the generation of new worlds. You will learn to think historically, theoretically, and critically about VR. You will have the option of either writing critical papers or creating your own virtual environment or game as your final project. This course assumes no prior experience with VR or coding, but those skills can optionally be put to use in final projects. Come prepared to question your reality!", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1775", "course_title": "DIGITAL STUDIO: VIDEO", "description": "This is an advanced studio designed for students to intensely experiment and explore the moving digital image in an art context. Students will explore the concepts and skills involved in working with digital video, from pre to post-production. Each student will propose and undertake a final, self-designed project during the final four weeks of the term. Major effort, time, research, imagination, productivity, and involvement are expected throughout the term.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1860", "course_title": "ELEMENTS OF SCREENWRITING", "description": "This course will explore developing character-based stories in the screenplay form. Students will be exposed to a variety of readings, including original screenplays, related prose, and texts which reinforce basic tenets of good story telling. Students will write a completed 1st Act for a 3 to 5 part screenplay, building from idea to outline with particular attention to structure and character development.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1883", "course_title": "EXPERIMENTAL CAMERA", "description": "This will be a workshop course dealing with a variety of techniques utilizing the camera as a tool for visual information outside of its normal use and function. The course will look at the history of cameras and the many image making devices that were invented to date.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1885", "course_title": "BROADCASTING", "description": "Broadcasting introduces students to television production through academic and hands-on experience, utilizing the University of Pittsburgh's new state-of-the-art television studios and equipment. In addition to students learning how to produce a live broadcast event for collegiate teams and a news broadcast, guest lecturers will talk about the industrial realities of the profession. Students will understand how to format and make a show rundown, apply graphics, utilize replay, work a television camera, comprehend audio application and mixing, produce and direct live events and news broadcast, as well as gain experience in front of the camera as news anchors, reporters and on-air talent for live events.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1886", "course_title": "BROADCASTING 2", "description": "The unique and dynamic Broadcasting 2 course will utilize every aspect of the state-of-the-art Pitt Studios, offering students a challenging and stimulating curriculum. Students will produce a Live Event Show Open (incorporating all pre-production elements), a Newscast, and a Podcast, incorporating video and animation marketing support. Students' projects will be crewed by classmates.", "completed": false, "prereq_count": 1}, {"dept_code": "FMST", "id": "1898", "course_title": "TELEVISION NEWS PRACTICUM: PITT TO THE POINT", "description": "Television News Practicum: Pitt to the Point is a hands-on course practicum that produces one live hour-long, television news/magazine program per week, incorporating every facet of broadcast television. The course incorporates news writing, feature writing, research, formatting, pre-production, live production, as well as public speaking and direct interaction with broadcast industry professionals. The course covers news, sports, entertainment and politics across the University of Pittsburgh campuses, as well as the city of Pittsburgh. This is a production course and counts for a Category III for the Film and Media Studies major and minor. It is part of the Television and Broadcast Arts Certificate and the Media and Creative Industries certificate.", "completed": false, "prereq_count": 0}, {"dept_code": "FMST", "id": "1921", "course_title": "FILMMAKING 4: CAPSTONE", "description": "This is a capstone course in motion picture production. Each student will have the option to create an individual project of their choice, which can be any genre of narrative, documentary, or experimental. Students who choose to work on their own personal project should be prepared to pitch the project to the class and the instructor during the first class session. Through script workshops, preproduction reviews, and critique of rough cuts, the instructor will mentor you through the filmmaking process. Depending on class size, students may have the option to instead work together on a collaborative project, with different students filling the roles of producer, writer, director, and editor, and taking on multiple roles in the production crew. This course is a requirement for Film and Media Studies students taking the Production Track.", "completed": false, "prereq_count": 2}], "links": [{"source": "0700", "target": "1921"}, {"source": "0800", "target": "0845"}, {"source": "1860", "target": "1921"}, {"source": "1885", "target": "1886"}]}