{"nodes": [{"dept_code": "SA", "id": "0110", "course_title": "VISUAL THINKING", "description": "Visual Thinking offers an introduction and insight into the process and practice of creating visual art. The subject is explored by making images supported by lectures, discussions, and critiques. Students are introduced to the dynamics of composition, relationships of form and content, principles of color, visual analysis, and creative problem-solving. The course also seeks to provide some experience with a variety of media, develop skills in observation and technique, and encourage personal engagement in solving visual problems.", "completed": false}, {"dept_code": "SA", "id": "0120", "course_title": "PAINTING STUDIO 1", "description": "This course is an introduction to oil painting that emphasizes color mixing, painting techniques, and composition. The purpose of the course is to promote sensitivity to color interaction, advance technical and compositional skills, and provide a basis for creative growth and expression.", "completed": false}, {"dept_code": "SA", "id": "0130", "course_title": "DRAWING STUDIO 1", "description": "This course provides a comprehensive introduction to observational drawing. The coursework follows a sequence of exercises in various media that introduce basic drawing skills, techniques, and composition through observation and analysis of natural and manufactured forms. The course culminates with an introduction to the human figure.", "completed": false}, {"dept_code": "SA", "id": "0140", "course_title": "SCULPTURE STUDIO 1", "description": "This hands-on course is an introduction to the practice of sculpture in contemporary and historical context. Using clay, plaster, wire, and cardboard, projects address material and technical processes as well as expressive, conceptual, and critical concerns.", "completed": false}, {"dept_code": "SA", "id": "0180", "course_title": "DIGITAL STUDIO: PHOTOGRAPHY 1", "description": "Digital Studio:Photography introduces students to the technical, conceptual, and expressive potential of digital photography as an art form. Emphasis will be placed on creative use of digital cameras and software to conceptualize and translate ideas into meaningful images. Projects will be assigned in order to advance technical skills and develop new insights and approaches to image making. Students will begin to develop an individual voice as an artist by exploring and questioning the use of photography in their work; giving special attention to its conceptual and historical underpinnings, and its material form.", "completed": false}, {"dept_code": "SA", "id": "1220", "course_title": "PAINTING STUDIO 2", "description": "This course is a comprehensive exploration of painting techniques and concepts designed to expand awareness of the craft of painting and expose students to issues relevant to contemporary painting. Students have the option to work with either oil or acrylic paints. The course concludes with the development of a self-directed painting project.", "completed": false}, {"dept_code": "SA", "id": "1230", "course_title": "DRAWING STUDIO 2", "description": "Drawing Studio 2 builds on the knowledge, skills and ideas practiced in Drawing Studio 1 while introducing more advanced approaches to developing content and style in drawing. The coursework therefore is roughly divided between continued practice and development of essential aspects of drawing - such as mark, tone structure, light, space, form, composition and perspective - and assignments designed to spark student explorations of the conceptual and communicative possibilities of drawing. Students will continue to develop observational drawing skills including figure drawing during class meetings; projects will be concerned with technical and formal aspects of drawing while emphasizing ideas and expression. The class will include a diverse range of examples of drawing from art historical through contemporary practices.", "completed": false}, {"dept_code": "SA", "id": "1240", "course_title": "SCULPTURE STUDIO 2", "description": "A continuation of SA 0140, this course explores in greater depth the relationship between material, technique, process, and content in sculpture. Through expanded projects in plaster, wood, and metal, students deepen their experience and develop new skills, while interpreting assignments independently.", "completed": false}, {"dept_code": "SA", "id": "1260", "course_title": "PRINT STUDIO: INTAGLIO", "description": "Intaglio printmaking is a diverse process, offering artists a variety of approaches to create marks, experiment and communicate. This course focuses on making intaglio prints from copper plates. Basic intaglio printmaking techniques are explored through the use of dry point, hard ground line etching, and aquatint. Advanced techniques are explored as the semester progresses. Experimentation is encouraged while developing techniques as well as researching printmaking as a tool to challenge studio practice and content.", "completed": false}, {"dept_code": "SA", "id": "1270", "course_title": "DIGITAL STUDIO: IMAGING", "description": "Digital Studio: Imaging is a studio designed to immerse students in the investigation of digital art practices. Emphasis will be on the history and aesthetics of art and digital technology, including screen-based imaging practices, creative coding, and digital fabrication. Throughout the course, you will acquire and enhance technical skills, but the emphasis will be on the use of the computer as an art-making tool for your creative expression. Thoughtfulness, experimentation and curiosity is encouraged.", "completed": false}, {"dept_code": "SA", "id": "1330", "course_title": "DRAWING STUDIO: PROJECTS", "description": "Drawing Studio: Projects is the third level drawing class for studio arts majors. The course builds on and expands on the foundation of drawing as an expressive and conceptual practice explored in Drawing Studio 2. The emphasis is on individual student drawing-based projects. The first part of the semester includes project assignments where students respond to open-ended prompts. During the second part of the semester students develop an ambitious body of work that involves drawing as a broadly defined discipline as it is situated in contemporary practice. Student work may take many forms which might include, but are not limited to: drawings on paper; installation or drawing in space; mapping; digitally produced drawing; comics or other narrative series; or time-based works such as artist books.", "completed": false}, {"dept_code": "SA", "id": "1380", "course_title": "DIGITAL STUDIO: VIDEO", "description": "This is an advanced studio designed for students to intensely experiment and explore the moving digital image in an art context. Students will explore the concepts and skills involved in working with digital video, from pre to post-production. Each student will propose and undertake a final, self-designed project during the final four weeks of the term. Major effort, time, research, imagination, productivity, and involvement are expected throughout the term.", "completed": false}, {"dept_code": "SA", "id": "1450", "course_title": "PAINTING STUDIO: FIGURE", "description": "The purpose of this course is to develop skills in the representation of the human form using a variety of painting strategies. The figure will be examined using direct observation of live models and also by employing other sources such as: photography, film, and digital images. Through lecture and critique the class will study and apply concepts that focus on a variety of roles the figure plays in personal, social, and art historical contexts.", "completed": false}, {"dept_code": "SA", "id": "1504", "course_title": "DIRECTED STUDY: STUDIO", "description": "Directed study is a course for art majors to promote concentrated individual development in students who have demonstrated exceptional ability in studio courses.", "completed": false}, {"dept_code": "SA", "id": "1604", "course_title": "SENIOR EXHIBITION", "description": "", "completed": false}], "links": [{"source": "0110", "target": "1230"}, {"source": "0110", "target": "1240"}, {"source": "0110", "target": "1260"}, {"source": "0110", "target": "1270"}, {"source": "0110", "target": "1380"}, {"source": "0120", "target": "1220"}, {"source": "0120", "target": "1450"}, {"source": "1230", "target": "1330"}]}