{"nodes": [{"dept_code": "QUECH", "id": "0102", "course_title": "QUECHUA 2", "description": "At the end of the second term of the first year of study the student should be able to produce all the significant sound patterns of the language, to recognize and use the major grammatical structures within a limited core vocabulary. The student should be able a) to engage in simple conversations with native speakers about a limited number of everyday situations and b) to read and write simple material related to the situations presented.", "completed": false}, {"dept_code": "QUECH", "id": "0104", "course_title": "QUECHUA 4", "description": "At the end of the second term of the second year the student should be able to converse comfortably with a native speaker on a variety of non-specialized subjects. The student will be offered an opportunity to experience and more fully understand the culture of the people who use the language through readings of various types. More complex writing tasks will be expected at this level.", "completed": false}, {"dept_code": "QUECH", "id": "0106", "course_title": "QUECHUA 6", "description": "With around 10 million speakers, Quechua is the most commonly spoken of the indigenous languages in South America. In this class, you will learn intermediate Language skills in order to further your communication in Quechua. You will also continue to learn about Quechua culture and Andean realities, building off of two previous years of Quechua study as well as any experiences you have had in Quechua speaking communities. In addition to focusing on Quechua language and culture, we will dedicate time to Quechua linguistics. You will participate in the structure of the class, as this is a tailored course. The main goal of this intermediate course is for you to continue to develop the skills necessary to communicate in Quechua. These skills include listening, reading, speaking, and writing. Equally important for communication, you will also deepen your understanding of the various cultural, historical, and political contexts in which Quechua is situated. We will continue our exploration of the multiple Quechua varieties. You will develop your knowledge of Quechua linguistics to complement your language skills.", "completed": false}, {"dept_code": "QUECH", "id": "1909", "course_title": "SPECIAL TOPICS IN QUECHUA", "description": "", "completed": false}], "links": []}