{"nodes": [{"dept_code": "HPS", "id": "0410", "course_title": "EINSTEIN: MODERN SCIENCE AND SURPRISES", "description": "Do astronauts age more slowly? Can a finite universe have no edge? Is time travel possible? Can time have a beginning? Does the moon change because a mouse looks at it? Surprisingly, modern science answers yes to all these questions. This course provides simple-to-understand explanations of these and other related questions, their broader philosophical significance and their histories. The course is suitable for students with no science background but with an interest in the world of modern science.", "completed": false}, {"dept_code": "HPS", "id": "0412", "course_title": "THE NEWTONIAN REVOLUTION", "description": "In this class we will investigate the transformation of scientific concepts by studying the historical,philosophical, and scientific issues raised by Newton's work in optics and mechanics. We will adopt the methods of integrated history and philosophy of science, whereby understanding is improved through a sustained dialogue between historical investigation and philosophical critical reflection upon the processes and products of a scientific enterprise. We will begin with looking at the traditional notion of a revolution in philosophy of science, and explore the applicability of this notion to the scientific context of sixteenth and seventeenth century England. We will then look closely at the stages in which Newton developed the theory of universal gravitation. This will provide the groundwork for studying the pivotal transformation of the concepts of force, attraction, and inertia, together with the invention of the concept of mass and the cultural reorientation surrounding the nature of the cosmos as a whole. We will then compare and contrast Newton's work in constructing the theory of universal gravitation with his experimental methods in optics. We will then explore the legacy of Newton's work in the subsequent experimental tests of Newtonian gravitation, the codification of modern scientific methodologies, and in the development of central topics in the philosophy of science.", "completed": false}, {"dept_code": "HPS", "id": "0427", "course_title": "MYTH AND SCIENCE", "description": "The Greeks in the sixth to fourth century B.C. Initiated forms of thinking we have from then on called \"scientific\" and \"philosophical\". This course examines the question of how science is distinguished from \"non-science\" by studying the role of myth and science in ancient Greece. The aim is to understand what distinguishes the ideas of the first scientists and philosophers from those earlier beliefs called myth.", "completed": false}, {"dept_code": "HPS", "id": "0611", "course_title": "PRINCIPLES OF SCIENTIFIC REASONING", "description": "This course will provide students with the skills to understand and assess scientific claims that confront them in daily life. Special attention will be given to reasoning based on samples, evaluating hypotheses and causal claims, as well as common mistakes in scientific reasoning.", "completed": false}, {"dept_code": "HPS", "id": "0612", "course_title": "MIND AND MEDICINE", "description": "Mind and medicine deals with fundamental problems and questions that arise in considering the nature of mental health, mental illness, and branches of medicine that aim to promote mental health and treat mental illness. We will begin by considering the concepts of 'health', 'disease' and 'illness' in general, and several different models of medicine. From there we will move on to a consideration of the nature of explanation in medicine generally. We will examine some explanatory successes in the domain of physical health and disease, and consider how those successes were achieved. In the second half of the course we will look at controversies over the question of whether there is such a thing as mental illness, and if so, how one is to define, diagnose and treat it. In order to better understand what is at stake, we will explore these controversies by focusing on a specific mental illness, schizophrenia. Looking at recent research on schizophrenia will allow us to see the extent to which the kind of understanding we have achieved in physical medicine is or is not to be expected with serious mental illness. Students who successfully complete this course will be able to identify and analyze different philosophical approaches to selected issues in medicine and psychiatry; have gained insight into how to read and critically interpret philosophical arguments; and have developed skills that will enable them to think clearly about foundational questions as future or current health care providers, policy makers, and consumers. This course is also part of a core sequence leading to certification in the Conceptual Foundations of Medicine Certificate Program, and is a companion course to HPS 0613 (Morality and Medicine) but may be taken independently. The course is of particular interest to pre-medical and pre-health care students.", "completed": false}, {"dept_code": "HPS", "id": "0613", "course_title": "MORALITY AND MEDICINE", "description": "Ethical dilemmas in the practice of health care continue to proliferate and receive increasing attention from members of the health care profession, ethicists, policy makers, and the general public as health care consumers. In this course we will examine a number of ethical issues that arise in the context of contemporary medical practice and research by analyzing articles and decision scenarios. Topics to be covered typically include the physician-patient relationship; informed consent; medical experimentation; termination of treatment; genetics; reproductive technologies; euthanasia; resource allocation; and health care reform. Students who successfully complete this course will be able to identify and analyze different philosophical approaches to selected issues in medical ethics; have gained insight into how to read and critically interpret philosophical arguments; and have developed skills that will enable them to think clearly about ethical questions as future or current health care providers, policy makers, and consumers. This course is part of a core sequence leading to Certification in the Conceptual Foundations of Medicine Certificate Program, and is a companion course to HPS 0612 (Mind and Medicine) but may be taken independently. The course is of particular interest to pre-medical and pre-health care students.", "completed": false}, {"dept_code": "HPS", "id": "0616", "course_title": "ARTIFICIAL INTELLIGENCE AND PHILOSOPHY OF SCIENCE", "description": "Artificial intelligence has been and still is one of the core disciplines of contemporary cognitive science. It raises fascinating questions: can robots think? Is artificial intelligence really intelligence? Could artifacts be conscious? What can we learn about the human mind from building robots? How should intelligent robots be built? We will survey the main controversies that artificial intelligence has provoked.", "completed": false}, {"dept_code": "HPS", "id": "0618", "course_title": "SCIENTIFIC CONTROVERSIES", "description": "", "completed": false}, {"dept_code": "HPS", "id": "0620", "course_title": "SCIENCE AND RELIGION", "description": "Are science and religion at odds or harmonizable? Do they coincide or represent completely separate discourses? This course examines the relationship between science, rationality, faith, and religion. Special attention will be given to ancient creation narratives and their interpretation, historical dialogues regarding faith and reason in the Western monotheist faiths (Christianity, Judaism, Islam), the scientific revolution, and various approaches to evolutionary theory. We will also consider practical, contemporary issues such as neuroscience and religious practice, ecology and faith, and scientific views toward gender and race.", "completed": false}, {"dept_code": "HPS", "id": "1508", "course_title": "CLASSICS IN HISTORY OF SCIENCE", "description": "In this class we will study the ten most dangerous, controversial, and mind shattering ideas that shaped modern science and the world we live in, their origin in classical historical and philosophical contexts, and their potential for future science. They are: 1) Cosmos. 2) Matter. 3) Life. 4) Species. 5) Organism. 6) Nature. 7) Calculus. 8) Unconscious. 9) Beauty. 10) God. Disturbing questions will be explored such as: Are these ideas natural or supernatural? Are they within or without the human mind? Are they ecologically sustainable? Are they racist? And of course, we will meet the heretics who revolutionized our understanding of these classical ideas. There are no prerequisites, no quizzes, and no exams.", "completed": false}, {"dept_code": "HPS", "id": "1612", "course_title": "PHIL OF 20TH CENTURY PHYSICS", "description": "An examination of the fascinating philosophical problems to which modern physical theories have given rise. No previous formal training in physics or mathematics will be presupposed, since the basic physical ideas needed will be introduced largely qualitatively with an emphasis on concepts rather than equations. Topics will vary from year to year with instructor, but center around classical mechanics, quantum mechanics, and relativity theory.", "completed": false}, {"dept_code": "HPS", "id": "1621", "course_title": "SCIENCE IN THE FIELD", "description": "Laboratories are commonly understood to be the locations of scientific research. Indeed, laboratory experimentation is one of the hallmarks of twentieth century science. However, for many sciences, the field has been and is the primary site of research. For sciences from anthropology to geology, fieldwork is an essential component of scientific practice. In this course, we will consider the differences between laboratory and field sciences. We will focus on the circumstances and contingencies that make fieldwork challenging and the research opportunities that it creates, which make it irreplaceable.", "completed": false}, {"dept_code": "HPS", "id": "1623", "course_title": "DEATH AND HEALTHCARE PROFESSIONS", "description": "The American culture of the 20th and 21st centuries has been called, not death-defying, but death-denying. It is often said that America is the only place in the world that treats death as optional. Once upon a time, we couldn't have open, public conversations about breast cancer, because the word could not be uttered aloud. In many places, it is just as hard today to have an open, public conversation about death and dying. This phenomenon is not just a social more; it affects the practice of many professions and entire segments of our economy and society. This course will explore our individual and cultural reactions to mortality, the ways in which dying in today's America is different from dying throughout history or elsewhere in the world, and the responses of a variety of professions, both within the field of healthcare and beyond, to their encounters with people in the various stages of dying. Students will be asked, at turns, to be scientific, philosophical, clinical, analytical, and emotional in encountering the concepts and material presented here. This should be a true interdisciplinary experience.", "completed": false}, {"dept_code": "HPS", "id": "1702", "course_title": "JR/SR SEMINAR FOR HPS MAJORS", "description": "The goal of this seminar (HPS 1702) will be to introduce you to the cutting-edge research in history and philosophy of science. The seminar is designed to complement the knowledge you have acquired about the classic debates in history and philosophy of science. We will focus on the recent debates in contemporary philosophy of science and on some debates in the history of science that are relevant for philosophy. We will read articles that have been published in the last ten years in the major philosophy of science and history of science journals. We will also read some classic papers that provide a background for the current debates.", "completed": false}, {"dept_code": "HPS", "id": "1703", "course_title": "WRITING WORKSHOP FOR HPS MAJORS", "description": "This writing workshop is designed to introduce HPS majors to the methods and standards of good scholarly writing in history and philosophy of science. It will be offered to HPS majors only in conjunction with HPS 1702, Jr./Sr. seminar. Evaluation will be based on two short papers that will be rewritten on the basis of the instructor's comments. Must be an HPS major in junior or senior year.", "completed": false}], "links": [{"source": "0427", "target": "1702"}, {"source": "0427", "target": "1703"}, {"source": "0611", "target": "1702"}, {"source": "0611", "target": "1703"}, {"source": "1702", "target": "1703"}]}