{"nodes": [{"dept_code": "RELGST", "id": "0083", "course_title": "MYTHOLOGY IN THE ANCIENT WORLD", "description": "This course examines in cultural context the traditional stories--myth, legend, and folktale--of the ancient Greeks and Romans. Theories drawn from various disciplines are critically evaluated. Attention to connections with ritual practice and to expression in daily life, art, architecture, etc.", "completed": false}, {"dept_code": "RELGST", "id": "0105", "course_title": "RELIGIONS OF THE WEST", "description": "This course is a historical introduction to the religious traditions that developed in ancient Near East and the Mediterranean. Our major emphasis is on the history of the religious traditions that emerged in late antiquity which continue to as the major monotheistic religions: Judaism, Christianity and Islam. We focus on key concepts, historical developments, and contemporary issues. Throughout the course, we also examine interactions among these religious traditions and will make use of documentary film and sacred art to illustrate. In the final segment of the course we examine the issue of secularization and the rise of the category of the non-believer, or \"none.\" The course also serves as an introduction to the academic study of religion and provides a foundation for further coursework in Judaism, Christianity, and Islam. No prior knowledge of any of the religions studied is expected or assumed.", "completed": false}, {"dept_code": "RELGST", "id": "0455", "course_title": "INTRODUCTION TO ISLAMIC CIVILIZATION", "description": "This course aims to introduce students to Islamic and Middle Eastern History from the time of the Prophet (ca. 600 C.E.) to the Iranian Revolution in 1979. We will proceed chronologically, focusing mainly on political events. However, a special emphasis will be given to the formation of the Islamic tradition, its evolution across different regions and cultures in time, and its interaction with other traditions. In the modern era, we will particularly explore the Islamic societies' political, cultural, and military encounter with the rising power of the West in the Middle East. In addition to the several historical processes and developments such as modernization, nation-building, Islamic fundamentalism and globalization, which have shaped the history of the Middle East in the last two centuries, our class discussions will also touch on the main theoretical perspectives that have stamped the studies of Islam and the Middle East. Here, concepts such as orientalism, defensive development, and modernity will constitute our main focus.", "completed": false}, {"dept_code": "RELGST", "id": "0505", "course_title": "RELIGION IN ASIA", "description": "This course serves as an introduction to the major religious traditions of South and East Asia. During the course of the semester, we encounter Hinduism and Jainism; the native Confucian, Daoist (Taoist), and popular traditions of China; and the Shinto, folk and new religions of Japan. Buddhism, which originated in India but later spread to East Asia, is examined in its relation to the history of both Chinese and Japanese religions. We approach these traditions through lectures and discussion based on Chinese classical and popular literature, secondary scholarship, and films, which inform us about cultural and historical context, beliefs, practices, and personal experience. In the process we expect to learn something about the ways in which non-Western religious traditions see themselves and their world on their own terms, and to see how/if they can complement our own worldviews.", "completed": false}, {"dept_code": "RELGST", "id": "0525", "course_title": "RELIGION AND CULTURE IN EAST ASIA", "description": "Words have consequences. How a society defines \"religion\" and \"culture\" have much to say about how they balance individual freedom and collective responsibility. This course focuses on how religion has been and is practiced in East Asia in modern and contemporary times. We begin with an overview of the major religions in the region (e.g., Confucianism, Daoism, Buddhism, Shinto, folk traditions), and examine various themes to help us learn how religion influences the lives of individuals and the wider societies in which they live. Themes dealt with include the relationship between religion and politics and law; nationalism, terrorism, and secularization; gender, sexuality, and the family; healing, the environment, and ethical behavior; and the life cycle and ritual calendar year. By looking at how these issues unfold in modern China and Japan and at their global significance enable us to better understand how religion shapes our world.", "completed": false}, {"dept_code": "RELGST", "id": "0760", "course_title": "RELIGION AND RATIONALITY", "description": "Does--and should--religion have a role in the secular sphere? How does culture shape religion? Is faith compatible with reason? This course critically examines how both religious and nonreligious thinkers have navigated the question of the relation between faith and reason throughout the history of Western thought. Special attention will be paid to evaluating how the relationship between religion and philosophy developed within Christianity, Judaism, and Islam. A further emphasis will be given to how the relationship between religion and philosophy shapes the our approach to myth, race, gender, and science.", "completed": false}, {"dept_code": "RELGST", "id": "0770", "course_title": "SCIENCE AND RELIGION", "description": "Are science and religion at odds or harmonizable? Do they coincide or represent completely separate discourses? This course examines the relationship between science, rationality, faith, and religion. Special attention will be given to ancient creation narratives and their interpretation, historical dialogues regarding faith and reason in the Western monotheist faiths (Christianity, Judaism, Islam), the scientific revolution, and various approaches to evolutionary theory. We will also consider practical, contemporary issues such as neuroscience and religious practice, ecology and faith, and scientific views toward gender and race.", "completed": false}, {"dept_code": "RELGST", "id": "1100", "course_title": "ISRAEL IN THE BIBLICAL AGE", "description": "This course explores the history and development of the people of Israel in ancient times. What do we know about the Israelites and how do we know it? Using biblical texts and archaeological remains, students will learn about everyday life in ancient Israel, the role of class and gender, life-cycle events, religious festivals, political institutions, systems of belief, and famous personages in history and lore. The trajectory of the course will begin with the Near Eastern origins of the people, continue through the rise of the Israelite and Judahite monarchies, and end with the Second Temple commonwealth of Judea in the Persian and Hellenistic periods.", "completed": false}, {"dept_code": "RELGST", "id": "1102", "course_title": "THE HISTORY OF GOD", "description": "God has a history. In the earliest days of that history, God was worshipped as one of a plethora of deities controlling various spheres of cosmic activity or the human world. Students in this course will learn about this ancient pantheon - how gods functioned in society and how their presence was experienced by those devoted to them. They will then trace the evolution of the God of Israel from a mountaintop deity of the southern Levant in the late second millennium BCE to a supreme deity worshiped by a small group of absolute monotheists based in Jerusalem in the mid-first millennium BCE. Students will become more sophisticated readers of biblical texts in the process. The sources of the Hebrew Bible reflect not a homogeneous monotheism, but rather a diverse set of belief systems tending toward henotheism or even polytheism. By appropriating and reinterpreting the religious myths of their neighbors, the Israelites arrived at a character of the divine that has proven problematic to many contemporary theologians, particularly on issues of LGBT rights, women's rights, and the environment.", "completed": false}, {"dept_code": "RELGST", "id": "1130", "course_title": "VARIETIES OF EARLY CHRISTIANITY", "description": "This course will examine the many different and often competing forms of Christianity that existed during the first five centuries of our common era. We will include an historical survey of Mediterranean culture and society in the historical Roman Empire to help us understand the ways in which Christianity developed in relation to the philosophical, sociological, theological, and political environment of this period. We will also focus on the contribution of the early varieties of Christianity to modern Western views of the relationship between the individual body and society. The literature of this period represents a broad variety of beliefs and practices ranging from philosophical views of god and matter (and the nature of each), to notions of life-long celibacy.", "completed": false}, {"dept_code": "RELGST", "id": "1135", "course_title": "ORTHODOX CHRISTIANITY", "description": "This course is designed as an overview of the history, teachings and rituals of Orthodox Christianity in its multinational context. Geographically, this context refers primarily to southeastern Europe (aka the Balkans), Russia and the coastal areas of the eastern Mediterranean. The course examines specific historical experiences of Orthodox Christians, starting with Byzantine empire, through major historical shift in the life of the Christians under Ottoman rule and, finally, to the diverse experiences of various autocephalous churches under communism. Through lectures, readings, discussions, films, and a field trip to a local Orthodox church, students will gain an insight into and broaden their awareness of the multifaceted world of Orthodox Christianity, its spiritual practices, rich artistic, musical and ritual expressions.", "completed": false}, {"dept_code": "RELGST", "id": "1144", "course_title": "CLASSICAL MYTHOLOGY AND LITERATURE", "description": "This course examines how authors of classical antiquity used the traditional figures and stories of their culture's mythology as material for works of literature.", "completed": false}, {"dept_code": "RELGST", "id": "1330", "course_title": "MEDIEVAL HISTORY 2", "description": "Survey course in the social, political, economic and religious history of Europe from the year 1000 to the black death. Special attention to interpreting the primary documents and to integrating various areas of activity (e.g. economic and religious). Focus on France, England, Germany, and Italy.", "completed": false}, {"dept_code": "RELGST", "id": "1402", "course_title": "HEALTH AND RELIGION", "description": "What is health, an absence of illness or something more? What is healing, a physical process or something that is not limited to the physical? In order to answer these seemingly basic questions, a host of assumptions about the body, its ideal state, and the kinds of changes to which it can or should be subjected are often implicit. Religious attitudes toward the body and the natural world have a tremendous impact on these assumptions. In this course, you will gain a better understanding of this impact by exploring the relationships between religion and health and seeing these relationships as part of a much larger web of human concerns such as nationalism, resistance to colonization, and gender politics. In order to facilitate cross-cultural comparison and understanding, this course is not organized around geography or history, but rather around the structure human body. After two introductory weeks, each three-week unit will consider a particular aspect of human health through cases drawn from a wide variety of religious contexts. This process is aimed at decentering Western narratives about health, healing, and the body while fostering a more global perspective.", "completed": false}, {"dept_code": "RELGST", "id": "1420", "course_title": "RELIGION AND RACE", "description": "This course examines the intersections of religion, race, and racism. Recently, scholars of religion have demonstrated that religious identities are often racialized as well. In this course, we will discover that religion and race are both modern categories rooted in post-enlightenment ideas about what it means to be human. We will see how the establishment of these religious and racial categories led to new hierarchies and inequalities. We will discuss how post-enlightenment thinkers linked religion and race, and how their ideas played a role in european imperialism. We will also investigate how the discipline of religious studies has developed its analytical tools with a racialized understanding of religion. The course will examine case studies in which religion has been racialized, and consider the political ramifications of these examples. In particular, we will think about the impact of white supremacy on black religion in the united states, the complicated relationship between antisemitism and islamophobia, and contemporary islamophobia in the us. Finally, we will explore the possibilities of anti-racism through faith-based scholarship and activism.", "completed": false}, {"dept_code": "RELGST", "id": "1500", "course_title": "RELIGION IN INDIA", "description": "Few countries can boast such an extensive and diverse religious heritage as can India. It is the birthplace of Hinduism, Buddhism, Jainism, and Sikhism, home to a large Muslim community, as well as to small, but ancient, communities of Syrian Christians, Parsis, and Jews. The course gives a brief historical overview of these religious traditions, introduces students to basic concepts related to each of them, and illustrates their rich practices through primary and secondary readings, films, art, and music.", "completed": false}, {"dept_code": "RELGST", "id": "1558", "course_title": "BUDDHISM AND PSYCHOLOGY", "description": "This course is divided into four thematic parts. The first part introduces basic knowledge on Buddhism. It then shows how the encounter between Buddhism and psychology has occurred in the wider context of Buddhist modernism, which has involved attempts by Buddhist reformers, psychologists, and neuroscientists to demythologize Buddhism to show how it can be understood as complementing modern empirical science. Part two offers concrete examples of Buddhist modernism by illustrating how Buddhist contemplative practices and doctrines such as sati have been reinterpreted and reformulated in modern psychology. Part three examines how a Japanese Zen practitioner's presentation of Zen compares with psychotherapeutic perspectives on it. Finally, in part four, a Buddhist-inspired psychotherapy widely used in Japan is examined to show how the reformulation of Buddhism to achieve psychotherapeutic goals has occurred in modern times in East Asia, albeit in a way that is distinctive from Buddhist-inspired psychotherapeutic practices in the west.", "completed": false}, {"dept_code": "RELGST", "id": "1575", "course_title": "LAW AND MEDICINE IN ASIAN RELIGIONS", "description": "This course introduces the intersections between law, religion, and medicine in East Asia. It will start with a theoretical orientation on the interaction between law and religion. In order to engage in these discussions in a global context, we will examine the manifestation of legal orientalism in China, Buddhist jurisdiction in Sri Lanka and Burma, religious governance in Tibet, as well as clerical immunity and sanctuary in medieval Europe. Next, students will learn to analyze cases illustrating the roles law has played in regulating religious and medical practices in East Asia. The cases we will examine span a long historical period ranging from the medieval to modern and the contemporary. For medicine and medical practices, the topics we will cover range from acupuncture, the use of wild animal in traditional medicine, the commercialization and regulation of caterpillar fungus, and the social, economic, and religious implications of the circulation of generic drug. To understand how law has shaped religious practices in East Asia, we will examine the infrastructure of legal practices and their applications in dealing with religious offenders. In particular, we will discuss underground jurisdiction, the history of forensic practices, criminal procedures, capital punishment, as well as prosecution of religious practitioners in the imperial and contemporary times. By the end of this course, students are expected to become competent in critically analyzing complex issues on law, medicine, and religion in East Asia for a more balanced understanding of these issues in the global context for personal and professional growth.", "completed": false}, {"dept_code": "RELGST", "id": "1600", "course_title": "ASIAN-AMERICAN RELIGIONS", "description": "Asian Americans have had a substantial impact on the cultural landscape of the United States despite facing distinctive forms of marginalization. Religious institutions have served important roles for Asian American communities, providing a respite from outside prejudices, an opportunity to build community, and a platform for social and political action. Nevertheless, Asian American religious spaces can be marked by a number of tensions, including intergenerational conflict and changing gender hierarchies. Drawing primarily on ethnographic literature, this course examines these issues in contemporary South, East, and Southeast Asian American religious communities. As a culminating project, students will explore local Asian American religious communities through an ethnographic project of their own.", "completed": false}, {"dept_code": "RELGST", "id": "1610", "course_title": "MYTH, SYMBOL AND RITUAL", "description": "Are myths only a thing of the past, or are there contemporary 'myths' that we live by? To what extent are football games and shopping trips \"rituals\"? How do plants and animals, the cosmos and the human body, or things we associate with bad luck or good health, function as symbols? This course offers a look at how myths, symbols and rituals, in their traditional and contemporary garb, constantly renew themselves as a way for different cultures to give significance to human life. By understanding these three basic forms of human expression we can gain understanding of a wide range of social and religious phenomena. We start with comparative exploration of myths on the origin of the world, humanity, and the gods, and with such rituals as rites of passage, festivals, and pilgrimages, as well as the theories of these expressions and their significance. The course then moves to observations of and reflections on the role of myth, symbol, and ritual in contemporary life, and their relation to such forms of human expression as literature, art, film and our own dreams.", "completed": false}, {"dept_code": "RELGST", "id": "1710", "course_title": "PERSPECTIVES ON RELIGION", "description": "A serious introduction to the study of religion is undertaken by reviewing the efforts and insights of the principal scholars in the field in the modern period.", "completed": false}, {"dept_code": "RELGST", "id": "1715", "course_title": "FEEDING THE SOUL: FOOD, GENDER AND RELIGION", "description": "Food is sustenance and absolutely essential to life. But food is never simply about nutrition. Because it is fundamental to the human experience, food is also a medium for the expression of culture and social identity. Moreover, food relays complex social messages about gender, sexuality, and family. Consequently, food is also a means for expressing the social and symbolic use of power and control in which social inequalities are expressed in culinary forms. This course will examine food from the vantage point of gendered and religious systems of production, distribution, and consumption as we consider: How does your food come to your table (or not) and what are the political implications of personal tastes?", "completed": false}, {"dept_code": "RELGST", "id": "1722", "course_title": "HEALING, SHAMANISM, AND SPIRITUAL POSSESSION", "description": "Anthropological approaches to the study of religion have classically defined shamanism as a spiritual practice opposed to spirit possession. While shamanism is centered on the claims of individuals to exit their bodies and venture into other realms of consciousness and reality, spirit possession would chart the opposite movement, where other spiritual beings take over or are invited into a human host. Both of these activities however, involve fusing or blurring the normal states and boundaries of body, personhood and consciousness, in interaction with other supernatural beings. Both are also routine religious experiences and practices in many parts of the world, past and present. Notwithstanding, these phenomena have been mistakenly associated with mental disorder by sociocultural anthropologists and psychologists in the past. At this point, however, the argument that shamanism and spiritual possession are not a function of mental illness has prevailed. Today, there is no doubt that the impact of these practices in the social life of its practitioners is multiple and complex. Despite that fact, this course will focus on the therapeutic aspects of these traditions. Far from being \"primitive\" or purely \"exotic\" phenomena, we will explore how these living practices relate to great civilizations, as part of regional, national, and global ideologies of religion and culture. More precisely, we will examine the role of traditional medicine based on cross-cultural ethnographies. We will explore, for example, how indigenous groups throughout the Americas diagnose and treat folk illness and Western defined diseases with variety of methods. Culturally defined illness such as soul loss, evil eye, witchcraft and other psychosomatic afflictions will be explored through lecture, readings and films. We will examine the use of art, music and ritual as well as psychotropic plants as part of the very heart of many indigenous cultural traditions. That said, this course will also provide an opportunity to understand why these practices have been reawakened not only by modern anthropological inquiry, but also by multidisciplinary interest in states of consciousness and mechanisms of therapy, and by popular interest in alternative forms of spirituality.", "completed": false}, {"dept_code": "RELGST", "id": "1725", "course_title": "DEATH AND HEALTHCARE PROFESSIONS", "description": "The American culture of the 20th and 21st centuries has been called, not death-defying, but death-denying. It is often said that America is the only place in the world that treats death as optional. Once upon a time, we couldn't have open, public conversations about breast cancer, because the word could not be uttered aloud. In many places, it is just as hard today to have an open, public conversation about death and dying. This phenomenon is not just a social more; it affects the practice of many professions and entire segments of our economy and society. This course will explore our individual and cultural reactions to mortality, the ways in which dying in today's America is different from dying throughout history or elsewhere in the world, and the responses of a variety of professions, both within the field of healthcare and beyond, to their encounters with people in the various stages of dying. Students will be asked, at turns, to be scientific, philosophical, clinical, analytical, and emotional in encountering the concepts and material presented here. This should be a true interdisciplinary experience.", "completed": false}, {"dept_code": "RELGST", "id": "1780", "course_title": "COMPUTATIONAL METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing xml-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false}], "links": []}