{"nodes": [{"dept_code": "URBNST", "id": "0010", "course_title": "INTRODUCTION TO URBAN STUDIES", "description": "This course serves as the required introduction into the Urban Studies major or as a general course in the social sciences for the non-major. The course explores the problems and potentials of cities by combining the various disciplinary perspectives--economics, Africana studies, history, political science, sociology, and anthropology. As the course is providing the students with the necessary concepts and information to understand cities, the students will be developing their own skills through field trips, debates, group presentations and journal writing.", "completed": false}, {"dept_code": "URBNST", "id": "0030", "course_title": "INTRODUCTION TO GIS", "description": "Geospatial data are digital representations of our physical world. As such, many public policy programs are critically informed by applications of geospatial data. This course will teach students how to acquire, manage, analyze, and visualize spatial data using ArcGIS Desktop. Students will also be introduced to applied data analysis using R. R is powerful, free, and flexible software used in many \"big data\" application. Assignments, applications, and course discussion will emphasize contemporary issues in public policy. Upon completing this course, students should expect to be proficient in basic GIS analysis and prepared for more advanced statistical coursework.", "completed": false}, {"dept_code": "URBNST", "id": "0050", "course_title": "INTRODUCTION TO URBAN RESEARCH", "description": "In this course students will learn and apply a set of basic research and communication skills relevant to work in urban settings. After active participation in the course, students will be able to locate data, analyze in thorough and theory based fashion, and present clearly and persuasively. Skills include defining a research question, questionnaire design and interviewing, finding and interpreting secondary data, using pc based spreadsheet, database and presentation software and participating on a team. Coursework is organized around real world problems.", "completed": false}, {"dept_code": "URBNST", "id": "0070", "course_title": "INTRODUCTION TO URBAN THEORY", "description": "This course introduces the practice of close and critical reading of theories about urban social theory. During the course you will encounter different theories that characterize significant evolutions in the way we think about urban form. By learning how to evaluate the strengths and weaknesses of these theories you will be prepared to engage with the conceptual foundations of urban studies.", "completed": false}, {"dept_code": "URBNST", "id": "0114", "course_title": "URBAN SUSTAINABILITY", "description": "This course provides a critical introduction to the concept of sustainability in relation to cities in the United States and internationally. We will investigate how the fuzzy concept of sustainability has developed, and look at how principles of urban sustainability are put into practice. In particular, we will look at the Pittsburgh city-region, and draw on examples from Singapore, Auckland (New Zealand), and Tianjin (China). In particular, the class will concentrate on how sustainability is embedded in planning urban structures, organizing for sustainable communities, and mitigating environmental risks and vulnerability. Students will hear from a variety of professionals engaged in sustainable urbanism, and learn about specific tools used to assess sustainability at different geographic scales.", "completed": false}, {"dept_code": "URBNST", "id": "0130", "course_title": "APPLIED GIS", "description": "This course provides an introduction to core methods for analyzing geo-spatial data, questions and applications with an emphasis on spatial and cluster analysis of point data using ArcGIS desktop. It will focus on teaching students the principles of GIS through computer-based exercises. Classroom projects will train students in acquiring, constructing, and managing geo-spatial data in order to solve spatially explicit problems. Exercises and projects will be geared toward equipping students with the set of quantitative tools that are relevant to courses taught in the urban studies program, especially courses taken by students in the planning and politics concentrations. This will provide students with the background for pursuing advanced work in urban economic geography, public administration, economic and community development, and regional analysis. However, the core methods presented in this course form the foundation for quantitative work in political science, sociology, and economics as well. This is a self-contained course. Students who have taken courses in Introduction to GIS or Introductory Statistics will find such courses useful, but they are not essential.", "completed": false}, {"dept_code": "URBNST", "id": "0160", "course_title": "DATA VISUALIZATION", "description": "This course is all about data visualization, the art and science of turning data into readable graphics. The course explores how to design and create data visualizations, including graphs, Story Maps and maps. Students will also learn to evaluate the effectiveness of visualization designs, and think critically about each design decision, such as choice of color and choice of visual encoding. Students will create their own data visualizations and learn to use Open Source data visualization tools and software like Excel and Tableau. Students will also read papers from the current and past visualization literature and complete a short individual project.", "completed": false}, {"dept_code": "URBNST", "id": "0300", "course_title": "REMAKING CITIES THROUGH POLICY AND PRACTICE", "description": "Who holds political power in cities across the United States, and how do they use it to remake cities? \"Remaking Cities through Policy and Practice\" lets you explore the political and community development dynamics of US cities, and builds a practical toolkit that you will use to evaluate the capacity for community change in the post-pandemic era. During the semester you will meet regional leaders and conduct practical research on the way that Pittsburgh neighborhoods are using comprehensive plans and other policy tools to generate economic growth. Key skill-building includes evaluation analysis, participatory research, and action research.", "completed": false}, {"dept_code": "URBNST", "id": "0360", "course_title": "INTERNATIONAL URBANISM SEMINAR", "description": "It is undeniable that the world has become integrated through the globalization of social, political, cultural and economic activity. Cities worldwide have been markedly affected by globalization, but in turn have played a role in the process. By utilizing published material, films, slides and the internet, this course will compare the economic, social, political, historical and cultural differences between different global cities as they struggle to survive in the twenty-first century.", "completed": false}, {"dept_code": "URBNST", "id": "0440", "course_title": "AMAZONIAN CITIES: ENVIRONMENTAL CHALLENGES AND SUSTAINABILITY", "description": "This course introduces environmental and social issues related to Latin America's Amazon cities, with a deeper focus on Brazil, exploring issues and controversies related to transformations, impacts and sustainability development in the Amazon. The Amazon region occupies 9 countries in Latin America. In Brazil alone, more than 20 million people live in the Amazon; almost 80% live in urban areas. The immediate international attention focuses on the role of forests in climate regulation and the conditions of pressure and degradation of the natural and social resources. However, the region is undergoing permanent transformations, mainly associated with a growing urbanization process, with major environmental and social consequences, which affect the region's sustainable development.", "completed": false}, {"dept_code": "URBNST", "id": "0900", "course_title": "URBAN RESEARCH SEMINAR", "description": "The Urban Research Seminar focuses the knowledge and skills, which the student has gained through the program, on a particular topic. The specific topic varies from term to term and faculty member to faculty member, but it always concerns an issue of relevance to the immediate Pittsburgh environment. Examples include riverfront development, the impact of Reagan's cutbacks, the redevelopment of East Liberty, etc. To investigate the topic students will review secondary sources as well as collect and analyze their own information through interviews, field trips, surveys, etc.", "completed": false}], "links": [{"source": "0030", "target": "0130"}]}