{"nodes": [{"dept_code": "MATH", "id": "0025", "course_title": "APPLIED COLLEGE ALGEBRA", "description": "This course is designed for non-math majors or non-science majors. This course will parallel the topics in MATH 0031, but will stress real life data, problem solving and the use of technology to aid in mathematical understanding.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0031", "course_title": "ALGEBRA", "description": "The course covers basic algebra skills. Linear, polynomial, rational, exponential, and logarithmic functions are included. Systems of linear equations are also covered.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0120", "course_title": "BUSINESS CALCULUS", "description": "This course introduces the basic concepts of limits, continuity, differentiation, integration, maximization and minimization. Applications to the social sciences, especially business and economics, are stressed.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0126", "course_title": "CALCULUS FOR BUSINESS 2", "description": "This is the second half of the two sequence course (0125 0126). It provides an introduction to calculus for students in business, economics and other social sciences.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0200", "course_title": "PREP FOR SCIENTIFIC CALCULUS", "description": "A variety of topics are studied: functions, rational functions, logarithmic and exponential functions, graphs, asymptotes, inverse, conic sections, translation and rotation of axes, trigonometric identities and equations, and possibly vectors.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0220", "course_title": "ANALYTIC GEOMETRY AND CALCULUS 1", "description": "This is the first of a sequence of three basic calculus courses. It covers the derivative and integral of functions of one variable and their applications.", "completed": false, "prereq_count": 3}, {"dept_code": "MATH", "id": "0230", "course_title": "ANALYTIC GEOMETRY AND CALCULUS 2", "description": "This is the second of a sequence of three basic calculus courses. It covers the calculus of transcendental functions, techniques of integration, series of numbers and functions, polar coordinates, and conic sections.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0240", "course_title": "ANALYTIC GEOMETRY AND CALCULUS 3", "description": "This is the third of a sequence of three basic calculus courses. It covers vectors and surfaces in space and the calculus of functions of several variables including partial derivatives and multiple integrals, stokes theorem, and first order differential equations.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0280", "course_title": "INTRO TO MATRICES & LINEAR ALG", "description": "The principal topics which this course will cover include vectors, matrices, determinants, linear transformations, eigenvalues and eigenvectors, and selected applications.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0290", "course_title": "DIFFERENTIAL EQUATIONS", "description": "This course presents an introduction to the theory of differential equations from an applied perspective. Topics include linear and nonlinear ordinary differential equations, Laplace transform, and introduction to partial differential equations.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0400", "course_title": "FINITE MATHEMATICS", "description": "The course covers the basic concepts of set theory, logic, combinatorics, Boolean algebra, and graph theory with an orientation towards applications.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0413", "course_title": "INTRO THEORETICAL MATHEMATICS", "description": "This course is an introduction to the theoretical treatment of sets, functions, relations, numbers, sequences, and limits. Classwork and homework concentrate reading and writing of proofs of theorems centered on these topics.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0420", "course_title": "INTRO THEORY 1-VARIABLE CALCULUS", "description": "The course provides a careful treatment of the theoretical concepts of limit, continuity, derivative and integral, including the fundamental theorem of calculus.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0430", "course_title": "INTRO ABSTRACT ALGEBRAIC SYSTEMS", "description": "This course introduces the student to abstract algebraic concepts, rings, integral domains, fields, integers, rational, real and complex numbers, and polynomials. Many examples will be presented during class and in the homework. The students are expected to enhance their proof writing techniques.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0450", "course_title": "INTRODUCTION TO ANALYSIS", "description": "This course is intended as a first course in mathematical analysis for highly motivated students. Topics will include sets and functions, number systems, topology of Euclidean spaces, limits, continuity, and the main theorems of elementary calculus.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "0480", "course_title": "APPLIED DISCRETE MATHEMATICS", "description": "The purpose of this course is to introduce first or second year students to important discrete structures that appear in both pure and applied math as well as computer science, computer engineering, computer security and information systems. Math 0480 will be an excellent preparation for classes in Combinatorics, Graph Theory, Algebra and Number Theory. Topics include sets, functions, sequences, algorithms, growth of functions, complexity of algorithms, induction, counting, discrete probability, graphs and trees, discrete geometry, network flows, the Traveling Salesperson Problem and discrete optimization.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "0500", "course_title": "PROFESSIONAL DEVELOPMENT", "description": "The Professional Development course is a 1-credit course required of all Mathematics majors. It will assist students to progress through the major and toward their career goals, and to attain skills in technical writing and programming.", "completed": false, "prereq_count": 2}, {"dept_code": "MATH", "id": "1080", "course_title": "NUMERICAL MATH: LINEAR ALGEBRA", "description": "This course is an introduction to numerical linear algebra which addresses numerical methods for solving linear algebraic systems and matrix Eigen problems and applications to partial differential equations. Although the course will stress a computational viewpoint, analysis of the convergences and stability of the algorithms will be investigated.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "1103", "course_title": "MATHEMATICAL PROBLEMS IN BUSINESS, INDUSTRY, AND GOVERNMENT", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "1121", "course_title": "ACTUARIAL MATHEMATICS 2", "description": "This course will cover the material listed in the syllabus for exam m (3) (mathematics of life contingencies and financial economics) of the society of actuaries. Specifically it will present the relevant topics in life insurance and life annuities, including multiple decrement models as well as the black and Scholes pricing of derivative securities and risk analysis. The material will be presented in the traditional academic format of lectures and help sessions along with optional sessions directed specifically at preparing students for the SOA exam.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "1127", "course_title": "PREDICTIVE ANALYTICS 2", "description": "This 3-credit course is a continuation of Math 1126, \"Predictive Analytics 1\". It will cover the fundamental knowledge about data science with applications to insurance and business. Students will be introduced to Basic R, data acquisition, data cleanup, data exploration and visualization, predictive modeling, and professional reporting. It also prepares students for the SOA Exam PA. Upon completion of this course, students will have developed skills in predictive analytics that allow them to: (1) articulate the types of problems that can be addressed by predictive modeling, identify the business problem and how the available data relates to possible analyses, use the information to propose models such as Generalized Linear Model (GLM), Decision Trees, Cluster and Principal Components Analysis; (2) develop expertise in the use of R for predictive analytics and be able to create effective graphs in RStudio, work with various data types, understand principles of data design, and construct a variety of common visualizations for exploring data; (3) evaluate data quality, resolve data issues, and identify regulatory and ethical issues; (4) effectively communicate the results of applying predictive analytics to solve a business problem.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "1129", "course_title": "ACTUARIAL MATHEMATICS 6", "description": "This 3-credit course will cover the topics in \"Short-Term Actuarial Mathematics 2\" (STAM 2) which builds on topics in STAM 1 as well as prepare students for the SOA STAM Exam. Students will be introduced to credibility theory: prior distribution, posterior distribution, predictive distribution, Bayesian premium, Buhlmann model, Buhlmann-Straub models, credibility premium, credibility factor and empirical Bayes methods. At the end of the course, students will be able to: 1) understand and estimate losses using credibility procedures; 2) understand the fundamental principles of pricing and reserving of some of the more common short-term insurance and reinsurance coverages: auto, homeowners, liability, health, disability, and dental. Students will be introduced to some of the methods and the underlying statistical models used for estimating losses incurred from short-term insurance and reinsurance coverages.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "1180", "course_title": "LINEAR ALGEBRA 1", "description": "This course stresses the theoretical and rigorous development of linear algebra. Major topics include the theory of vector spaces, linear transformations, matrices, characteristic polynomials, bases and canonical forms. Other topics may be covered as time permits.", "completed": false, "prereq_count": 2}, {"dept_code": "MATH", "id": "1250", "course_title": "ABSTRACT ALGEBRA", "description": "In this course the basic algebraic systems, groups and rings are studied in some detail. Topics include: subgroups, permutation groups, homomorphism's, subrings, ideals and quotient rings. The emphasis is on theory with examples.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "1270", "course_title": "ORDINARY DIFFERENTL EQUATIONS 1", "description": "This course covers methods of solving ordinary differential equations which are frequently encountered in applications. General methods will be taught for single n-th order equations, and systems of first order nonlinear equations. This will include phase plane methods and stability analysis. Computer experimentation will be used to illustrate the behavior of solutions of various equations.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "1280", "course_title": "ORDINARY DIFFERNTL EQUATIONS 2", "description": "This is a course in stability and qualitative methods for analyzing ordinary differential equations which arise in realistic models. Phase plane techniques, perturbation methods, and bifurcation theory are studied.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "1310", "course_title": "GRAPH THEORY", "description": "The concept of a graph and the study of its theoretical properties and applications form the core of this course. Topics include paths, circuits, trees, planar graphs, coloring problems, digraphs, matching theory, and network flows.", "completed": false, "prereq_count": 2}, {"dept_code": "MATH", "id": "1380", "course_title": "MATH BIOLOGY", "description": "This course will provide a broad introduction to mathematical methods typically applied to problems in biology. Models using calculus, ordinary differential equations, partial differential equations, discrete dynamical systems, stochastic dynamics, or a cellular automata framework will be presented and principal methods for their analysis will be described. Computational methods will also be covered, including computing platforms such as XPPAUT. Throughout the course, students will have extensive opportunities to practice the development and analysis of mathematical biology models.", "completed": false, "prereq_count": 2}, {"dept_code": "MATH", "id": "1510", "course_title": "MATHEMATICAL THEORY OF PROBABILITY", "description": "This course is an introduction to the mathematical theory of probability. Major topics include random variables, expecation, characteristic functions, conditional probability, and an introduction to Martingales and Markov chains.", "completed": false, "prereq_count": 2}, {"dept_code": "MATH", "id": "1540", "course_title": "ADVANCED CALCULUS 2", "description": "This course, a continuation of MATH 1530, covers the theory of limits, differentiation, and integration of functions of several variables.", "completed": false, "prereq_count": 0}, {"dept_code": "MATH", "id": "1560", "course_title": "COMPLEX VARIABLES & APPLICATIONS", "description": "This course covers the following topics: elementary operations with complex numbers, derivatives, integrals, Cauchy's theorem and consequences such as the integral formula, power series, residue theorem, applications to real integrals and series.", "completed": false, "prereq_count": 1}, {"dept_code": "MATH", "id": "1800", "course_title": "ADVANCED TOPICS IN MATHEMATICS", "description": "This is a one-semester introductory course in quantum information theory. The goal is to give an introduction to quantum computing paradigms and the mathematics behind quantum algorithms. We will see that in many cases they are much more efficient compared to their classical counterparts. We start with a brief introduction to quantum mechanics, and then discuss the basics of quantum computation. We will then go over some well-known quantum algorithms such as Shor¿s algorithm for prime factorization. We will also discuss possible effects that the emergence of a quantum computer would have on the standards of modern cryptography. The needed background for the course is linear algebra. Familiarity with quantum mechanics is useful but not a requirement.", "completed": false, "prereq_count": 1}], "links": [{"source": "0200", "target": "0220"}, {"source": "0220", "target": "0220"}, {"source": "0220", "target": "0220"}, {"source": "0220", "target": "0230"}, {"source": "0220", "target": "0280"}, {"source": "0220", "target": "0480"}, {"source": "0230", "target": "0240"}, {"source": "0230", "target": "0290"}, {"source": "0230", "target": "0413"}, {"source": "0240", "target": "1080"}, {"source": "0240", "target": "1280"}, {"source": "0240", "target": "1380"}, {"source": "0240", "target": "1560"}, {"source": "0280", "target": "1270"}, {"source": "0280", "target": "1310"}, {"source": "0280", "target": "1510"}, {"source": "0280", "target": "1800"}, {"source": "0290", "target": "1380"}, {"source": "0413", "target": "0420"}, {"source": "0413", "target": "0430"}, {"source": "0413", "target": "0500"}, {"source": "0413", "target": "1180"}, {"source": "0413", "target": "1310"}, {"source": "0420", "target": "1510"}, {"source": "0430", "target": "1250"}, {"source": "0450", "target": "0500"}, {"source": "0450", "target": "1180"}]}