{"nodes": [{"dept_code": "DENHYG", "id": "1110", "course_title": "BIOLOGICAL SCIENCES 1", "description": "This introductory level course is the first of 3 sequential courses in the biological sciences, each of which represents an interdepartmental integration of gross and neuroanatomy, histology and physiology. Through lectures and assigned readings, students will gain insight into structure-function relationships of cells, tissues, organs, and organ systems of the body. This course deals with the cell, epithelium, connective tissue, the skeletal system, myology, blood, the lymphatic system, neural histology, and introductory neural physiology.", "completed": false}, {"dept_code": "DENHYG", "id": "1112", "course_title": "INTRODUCTION TO DENTAL HYGIENE", "description": "This course is designed to introduce dental hygiene students to the techniques and information necessary for comprehensive patient care.", "completed": false}, {"dept_code": "DENHYG", "id": "1114", "course_title": "DENTAL ANATOMY", "description": "This course is designed to help students identify the normal structures with the oral cavity. The use of correct terminology is stressed in order to effectively communicate with members of the dental profession. The student will be able to differentiate normal formation of teeth from abnormalities.", "completed": false}, {"dept_code": "DENHYG", "id": "1241", "course_title": "PRINCIPLES OF MICROBIOLOGY", "description": "An introductory course in microbiology for dental hygiene students with no previous background in microbiology. Major areas included are microorganisms, immune mechanisms of the host and the interaction of the host and the microorganisms in disease and homeostatis. Major emphasis is placed on diseases with oral manifestations and infection control in dental medicine. The laboratory component is devoted to microbiological methods, infection control and oral ecology.", "completed": false}, {"dept_code": "DENHYG", "id": "1242", "course_title": "BIOLOGICAL SCIENCES 2", "description": "This introductory level course is the second of three sequential courses in the biological sciences. Through lectures and assigned readings, students will gain insight into structure-function relationships of cells, tissues, organs, and organ systems of the body. This course deals with the gross anatomy, neuroanatomy and physiology of the nervous system, including the eye and ear, the cardiovascular system, and the oral cavity with emphasis on the formation and structure of the teeth.", "completed": false}, {"dept_code": "DENHYG", "id": "1244", "course_title": "COMMUNICATIONS", "description": "This course is designed to increase the student's proficiency as a public speaker, through learning organization of material, delivery and criticism of speeches.", "completed": false}, {"dept_code": "DENHYG", "id": "1245", "course_title": "DENTAL HYGIENE RADIOLOGY 1", "description": "This course provides the student with the theoretical knowledge required to achieve a working knowledge of the radiologic sciences as they apply to dental hygiene. Also included will be concepts of radiation safety and radiation biology. An introduction to normal radiographic anatomy and the radiographic aspects of dental pathology will be included.", "completed": false}, {"dept_code": "DENHYG", "id": "1247", "course_title": "DENTAL HYGIENE SEMINAR 1", "description": "This course is an extension of the introduction to dental hygiene course. The focus of this course is the special needs and medically compromised patient. It combines lectures, guest presentations and clinical experiences. The students will acquire greater understanding of the psychological and physiological needs of these patients and how to better meet those needs to provide the best patient care.", "completed": false}, {"dept_code": "DENHYG", "id": "1248", "course_title": "DENTAL MATERIALS", "description": "This course introduces the dental hygiene student to the field of dental materials. The methods of instruction include didactic and laboratory components. Lectures will cover basic properties of dental materials; gypsum products, waxes, rigid and elastic impression materials and restorative materials. Laboratory sessions give each student practical experience in the proper manipulation of these materials.", "completed": false}, {"dept_code": "DENHYG", "id": "1249", "course_title": "DENTAL HYGIENE CLINIC 1", "description": "This course is scheduled as clinical sessions in which students utilize the skills necessary to perform an oral prophylaxis on individual patients, and to provide patient education.", "completed": false}, {"dept_code": "DENHYG", "id": "1417", "course_title": "DENTAL HYGIENE SEMINAR 3", "description": "This course is designed to compliment the dental hygiene 3 clinical experience. Students will be exposed to various traditional and non-traditional dental therapeutic techniques including, but not limited to subgingival irrigation with antimicrobial agents, an update of new dental products and devices as well as the presentation of case studies for analyses. The goal of the course is to enhance the clinical and didactic skills of the dental hygienist.", "completed": false}, {"dept_code": "DENHYG", "id": "1421", "course_title": "SPECIAL NEEDS DENTISTRY", "description": "The goals of this course are to introduce the dental/dental hygiene student to common developmental and acquired disabling conditions and issues related to the dental care of patients with special needs. The material presented will aid the student in assessing, planning, implementing and monitoring treatment for the patient with special needs.", "completed": false}, {"dept_code": "DENHYG", "id": "1422", "course_title": "HEALTH PROMOTIONS THROUGH THE LIFE SPAN", "description": "This course will examine common health issues found throughout the human lifespan with the intention of helping students gain a holistic perspective of the clinical patient experience. The course content is designed to provide the student with relevant issues affecting the various physical stages of the human life cycle, with special emphasis on the most under-served populations of pediatrics and geriatrics. The content will be developed using the following themes: biological, psychological, social, environmental, and medical aspects of different age populations and their relationship to dental hygiene care. While there are not specific prerequisites for this course, it is recommended that enrolled students have successfully completed 45 college credits prior to course enrollment. Students not within the Dental Hygiene Program must obtain permission from the course instructor to enroll. Hybrid course format including weekly online synchronous course meetings.", "completed": false}, {"dept_code": "DENHYG", "id": "1544", "course_title": "INTRODUCTION TO RESEARCH ANALYSIS", "description": "The Introduction to Research Analysis course is designed to provide the student with a broad-based understanding of healthcare research with an introduction to concepts of research design, sampling, and statistics. This course will focus on practical application of accessing scholarly sources, critically appraising the literature, and applying this to a clinical question in dental hygiene practice. The students will gain knowledge and skills to analyze research articles through continued practice which will be used to develop a literature review. Students will be aligned in small groups in which a PICO question will be developed, a literature review will be conducted, and a group presentation will be developed. It is recommended that students have a basic knowledge of algebra and the scientific method before enrolling in this course. This course is designed to provide a hybrid learning experience, including both face-to-face, synchronous online instruction, and online activities.", "completed": false}, {"dept_code": "DENHYG", "id": "1545", "course_title": "DENTAL HEALTH EDUCATION, METHODS AND PRACTICUM", "description": "This course is an introduction to classroom teaching for the dental hygienist. It involves the acquisition of knowledge and skills for classroom instruction in dental health education. Emphasis is placed on preparation, implementation and evaluation of lesson plans and the design and selection of effective audio-visual aids. It includes six weeks of dental health presentations in the community exhibiting the skills acquired the first half of the course.", "completed": false}, {"dept_code": "DENHYG", "id": "1547", "course_title": "DENTAL HYGIENE SEMINAR 4", "description": "This course was designed to synthesize pertinent clinical and basic science information. In addition, students will be required to analyze and present a periodontal case study for peer review.", "completed": false}, {"dept_code": "DENHYG", "id": "1549", "course_title": "DENTAL HYGIENE CLINIC 4", "description": "This course was designed to facilitate the synthesis and application of information using a multidisciplinary approach for patient treatment. The clinical environment stimulates and prepares students for a private practice dental setting. All students are afforded the opportunity to participate in internal and external clinical rotations in the capacity of a dental auxiliary. Each student's clinical competency level is assessed and evaluated during all phases of patient treatment.", "completed": false}, {"dept_code": "DENHYG", "id": "1902", "course_title": "ALLIED HEALTH EDUCATION PRACTICUM", "description": "This course provides the student with practical experience in both the dental hygiene classroom and clinical settings.", "completed": false}, {"dept_code": "DENHYG", "id": "1916", "course_title": "PEER TUTORING IN DENTAL HYGIENE EDUCATION", "description": "This selective course will allow participants to develop the skills necessary to provide peer tutoring as part of the School of Dental Medicine Peer Tutoring Program. The course is open to second year dental hygiene students. The course is the second of two consecutive courses to fulfill credits towards the B.S. Degree Completion Program in Dental Hygiene and is highly recommended for those pursuing the education track.", "completed": false}, {"dept_code": "DENHYG", "id": "1922", "course_title": "HEALTH MANAGEMENT PRACTICUM", "description": "This course provides the student through a variety of field experiences with the opportunity to apply the knowledge gained in the health management seminar.", "completed": false}], "links": []}