{"nodes": [{"dept_code": "BUSQOM", "id": "0050", "course_title": "QUANTITATIVE METHODS", "description": "Provides the foundations for two basic business disciplines; optimization and simulation. Various modeling concepts which have origins and have found wide applications in functional areas such as finance, marketing and operations will be studied in depth. The topics studied are linear programming; models of \"go/no go\" decisions and location decisions; \"what if\" analysis; decision analysis and multiple criteria decision making models; queuing models and statistical foundations to simulate business systems-input/output analysis.", "completed": false}, {"dept_code": "BUSQOM", "id": "1070", "course_title": "OPERATIONS MANAGEMENT", "description": "Provides foundations for managing operations technology manufacturing & service & discussion of operations management of conversion process. Field is centered on the fundamental problems of managers taking raw materials & transforming them efficiently/effectively into products resulting in satisfied customers. Topics: bottleneck & capacity analysis, capacity expansion; decoupling workstations-buffers versus internal & external variability; economies of scale in materials distribution; reorder point computations; distribution & logistics; & scheduling res; GT, JIT, CIM & FMS.", "completed": false}, {"dept_code": "BUSQOM", "id": "1085", "course_title": "APPLIED BUSINESS ANALYTICS PROJECT", "description": "", "completed": false}, {"dept_code": "BUSQOM", "id": "1745", "course_title": "SIX SIGMA THEORY AND PRACTICE", "description": "Six Sigma theory and practice has been designed to provide the student with: \"strong theoretical knowledge of the six sigma green belt body of knowledge. Practical, hands-on, experience with the Six Sigma methodology. A Katz Six Sigma green belt certificate, for students earning a grade of \"B\" or better. Six Sigma is a disciplined, data-driven approach to process improvement aimed at the near-elimination of defects from every product, process, and transaction. Lean topics will be included in this course. Six Sigma utilizes the following five-phase problem solving methodology known by the acronym DMAIC: 1. Define the projects, the goals, and the deliverables to customers (internal and external). Describe and quantify both the defect and the expected improvement. 2. Measure the current performance of the process. Validate data to make sure it is credible and set the baseline. 3. Analyze and determine the root cause(s) of the defects. Narrow the causal factors to the vital few. 4. Improve the process to eliminate defects. Optimize the vital few and their interrelationships. 5. Control the performance of the process. Lock down the gains. To integrate theory and practice, students will be grouped in teams and work under the mentorship of a Six Sigma black belt on an industry client field project.", "completed": false}, {"dept_code": "BUSQOM", "id": "1760", "course_title": "DATA MINING", "description": "Data mining is the process of extracting useful information and knowledge from a set of data. Mining is typically done on data sets too large to be analyzed by hand, but the same techniques are applicable to small, complex data. This course is an introduction to the most popular methods used in managerial data mining, and provides experience in using commercial software to explore real data sets. Models considered include those from statistics, machine learning, and artificial intelligence, such as discriminate analysis, logistic regression, clustering, neural nets, tree/rule induction, and association rule modeling. This course is methods-oriented, as opposed to being methodology-oriented, so students learn about when and how to use techniques and how to interpret their output rather than the details about how those techniques work. A laptop computer is required.", "completed": false}], "links": [{"source": "0050", "target": "1070"}]}