{"nodes": [{"dept_code": "ATHLTR", "id": "1811", "course_title": "BASIC ATHLETIC TRAINING", "description": "This course is designed to provide the student with an introduction to the athletic training profession. Topics to include medical terminology, mechanisms of injury, and recognition and treatment of common athletic injuries to major body parts.", "completed": false}, {"dept_code": "ATHLTR", "id": "1812", "course_title": "BASIC ATHLETIC TRAINING LAB", "description": "An introduction to basic taping techniques and injury evaluation techniques used in the profession of athletic training. Basic supportive strappings and paddings for immediate care and competition are presented as well as basic joint evaluation procedures, assessment of vital signs, and crutch fitting.", "completed": false}, {"dept_code": "ATHLTR", "id": "1814", "course_title": "INTRODUCTION TO CLINICAL ATHLETIC TRAINING 2", "description": "This course is designed to help prepare students for the demands associated with experiential learning and future clinical placements in the Athletic Training Education Program (ATP). The course will have a combined in-person meetings and associated class assignments that will include field observations at approved clinical education sites through the University of Pittsburgh. This course is a prerequisite for the Practicum I-IV Courses in the ATP", "completed": false}, {"dept_code": "ATHLTR", "id": "1833", "course_title": "STRENGTH AND CONDITIONING", "description": "Instruction is provided describing the physiological basis for development of pre-season, in-season and off-season strength and conditioning programs. Laboratory experiences will include the theory and technique of operating contemporary isotonic, isokinetic and isometric strength training equipment.", "completed": false}, {"dept_code": "ATHLTR", "id": "1834", "course_title": "SPECIAL TOPICS IN ATHLETIC TRAINING", "description": "The course includes common orthopedic problems encountered by the athletic trainer and orthopedic surgeon. Students are exposed to commonly used techniques of primary and re constructive surgery through lecture, operating room, clinic, and orthopedic rounds experiences.", "completed": false}, {"dept_code": "ATHLTR", "id": "1842", "course_title": "ATHLETIC TRAINING PRACTICUM 4", "description": "Designed to supplement fourth clinical experience presented in seminar fashion to address clinical proficiencies published in the 3rd edition of the NATA athletic training educational competencies introduced in the second semester academic courses. Presented by faculty of the AT program then evaluated in clinical setting in live situations when possible or under simulated conditions when narrated. Specific emphasis placed on these proficiencies that can be grouped into modules and which do not receive broad coverage in an academic course.", "completed": false}, {"dept_code": "ATHLTR", "id": "1843", "course_title": "ADVANCED ORTHOPEDIC ASSESSMENT", "description": "This course will consist of advanced study in the assessment of orthopedic and other sports related injuries to the extremities and spine to include pathophysiology of skeletal and soft tissue insult, proprioception and neuromuscular control and an evidence-based approach to musculoskeletal evaluation, treatment and rehabilitation of sport-related injuries. The content of this course will be presented by practicing clinicians from various disciplines who are also alumni of the Athletic Training Education Program.", "completed": false}, {"dept_code": "ATHLTR", "id": "1866", "course_title": "PSYCHOLOGY OF SPORT", "description": "", "completed": false}], "links": [{"source": "1811", "target": "1812"}]}