{"nodes": [{"dept_code": "JPNSE", "id": "0002", "course_title": "FIRST YEAR JAPANESE 2", "description": "The second term in the systematic presentation of the modern standard language begun in Japanese 0001. Students will continue to develop all four skills--speaking, understanding, reading and writing with continued emphasis on content useful in everyday communications. Writing will include the syllabaries and about 50 selected kanji characters.", "completed": false}, {"dept_code": "JPNSE", "id": "0004", "course_title": "SECOND YEAR JAPANESE 2", "description": "The fourth term in the sequence of Japanese language instruction designed to develop the student's ability to carry on non-technical conversations while continuing to enhance the reading and writing skills. More complex grammatical structures and the study of about 300 additional characters are introduced.", "completed": false}, {"dept_code": "JPNSE", "id": "0010", "course_title": "SPECIAL TOPICS IN EAST ASIAN POP CULTURE", "description": "This 1-credit mini course explores the spread of Asian pop across the world in conjunction with the Asian Studies Center's annual lecture series on Asian pop culture.", "completed": false}, {"dept_code": "JPNSE", "id": "0081", "course_title": "EAST ASIA IN THE WORLD", "description": "To enhance a greater understanding of East Asian cultures; to explore the interactions and relations between the peoples and cultures of East Asia (china and Japan) and the rest of the world, from ancient times to the present. Literary works, memoirs, autobiographies, diaries, historical records and films will be used. Themes involve such topics as the significance of travel in self-understanding, diaspora, immigration, and changing ideas of the homeland.", "completed": false}, {"dept_code": "JPNSE", "id": "1021", "course_title": "THIRD YEAR JAPANESE 2", "description": "The second term of the third year level Japanese language course and a continuation of Japanese 1020. The student further develops competency through speaking and reading materials of academic and cultural interests and through discussion of those materials.", "completed": false}, {"dept_code": "JPNSE", "id": "1035", "course_title": "PRAGMATICS OF JAPANESE", "description": "This course will provide an introduction to the usage aspects of Japanese by reading articles on pragmatic aspects of the language. The instructor will lecture on salient points and lead discussion on specific issues and the appropriate use of the language.", "completed": false}, {"dept_code": "JPNSE", "id": "1040", "course_title": "INTRODUCTION TO CLASSICAL JAPANESE 1", "description": "This classical Japanese language course is studied through readings of prose and poetry texts written during and immediately after the Heian period. Literary and linguistic techniques are discussed and points of contrast with the modern language are analyzed. Also introduced are reference materials dealing with classical Japanese language and literature. Students are encouraged, but not required, to complete JPNSE 1023 Aspects of the Japanese Language before enrolling in this course.", "completed": false}, {"dept_code": "JPNSE", "id": "1056", "course_title": "JAPANESE LITERATURE AND THE WEST", "description": "A critical study of modern Japanese works and selected modern Western literary materials with special emphasis on intensive analysis by means of modern Western criticism. The course is designed to encourage the student to examine significant similarities and differences between Japanese and non-Japanese materials and to judge the content from an oriental as well as a Western perspective.", "completed": false}, {"dept_code": "JPNSE", "id": "1070", "course_title": "WORLD OF JAPAN", "description": "Please see course description listed under \"Class Notes.\"", "completed": false}, {"dept_code": "JPNSE", "id": "1800", "course_title": "SPECIAL TOPICS", "description": "This course aims to deepen the student's understanding of the Japanese language and sharpen language skills in areas which have traditionally been difficult to learn and to understand. This will be accomplished through reading relevant literature, examining linguistic data and by in-class discussions.", "completed": false}, {"dept_code": "JPNSE", "id": "1908", "course_title": "DIRECTED WRITING FOR MAJORS", "description": "In addition to whatever written assignments are required of those enrolled in the course, this directed writing practicum provides students with an opportunity to contribute writing designed in terms of the intellectual strategies of the course.", "completed": false}, {"dept_code": "JPNSE", "id": "1999", "course_title": "CAPSTONE PROJECT", "description": "Goal of course is to plan and complete a student-directed academic project (capstone project) that requires the command and synthesis of the knowledge and skills learned in the undergraduate career in order to analyze an intellectual problem or topic in the student's interest. The students will plan, find and use appropriate resources, make and execute plans to bring a capstone project to fruition in consultation with the course instructor and a faculty mentor.", "completed": false}], "links": [{"source": "0002", "target": "1035"}, {"source": "1021", "target": "1040"}]}