{"nodes": [{"dept_code": "ENGLIT", "id": "0300", "course_title": "INTRODUCTION TO LITERATURE", "description": "This course examines the definitions, functions, and values of literature by reading across a range of genres, styles, historical periods, and cultures. It will also introduce various reading strategies for making sense of plays, poems, novels, short stories, and essays.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0310", "course_title": "THE DRAMATIC IMAGINATION", "description": "This course introduces students to the major dramatic forms and compares the ways playwrights from several centuries use ideas, characters and dramatic techniques. We will consider how social, historical, and dramatic contexts influence our interpretations and evaluation, or may lead to alternative understandings of a play.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0315", "course_title": "READING POETRY", "description": "Poetry is usually the first literary form to evolve in a culture. Yet many today reject it as artificial, overly refined and removed from ordinary human experience. By studying various kinds of poetry, this course aims to help students break down the barriers between classic poems, contemporary poetry, and a more general lyric impulse. As the most highly condensed literary experience, poetry invites very close reading, so we will explore various techniques for making sense of poems.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0325", "course_title": "THE SHORT STORY", "description": "This course studies short stories that explore a variety of themes. It seeks to define the short story as a specific literary genre and to distinguish it from earlier forms of short narrative literature. It then goes on to examine the effects of literary, cultural and historical traditions on these stories and their reception.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0354", "course_title": "WORDS AND IMAGES", "description": "This interdisciplinary course explores the relationships between language and the diverse kinds of images that often accompany it (film, video, photography, book illustration, painting, etc.). The goal is to study the parallels and differences between images and words (as systems of communication) and to understand how they can productively interrelate within creative works such as literature, films, videos, and photographic studies.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0365", "course_title": "IMAGINING SOCIAL JUSTICE", "description": "This course questions the relationship between present and/or \"contemporary\" literature and past literary traditions. It is not a course solely in contemporary literature but a course that compares contemporary texts with texts from other periods. It investigates the contemporary as both a complex reworking of past narratives and traditions and as the production of the experimental and the new.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0506", "course_title": "LITERARY FIELD STUDIES", "description": "In this course, students will learn about and practice the various activities central to literary studies. Students will learn how to frame interesting critical inquiries and conduct original research, which could include historical research or contemporary cultural study. Students will engage with books as historical objects, which will include learning about the history of books and other print media and studying the ways that material factors shape writers' work. This could include visiting the library's Special Collections and/or a creative project around bookmaking. Students will engage in a variety of interpretive practices, including taking creative and inventive approaches to critical work and adapting texts for new purposes. Students will attend live performances and readings by diverse contemporary writers, gaining insight into the process of how great literature is made. Students will have the opportunity to find new intersections between literature and other disciplines. Finally, students will be invited to approach a range of writing projects as active makers, attending carefully to the formal elements of their own writing as well as that of others.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0512", "course_title": "NARRATIVE AND TECHNOLOGY", "description": "This course explores the ways in which new technologies impact how we engage with stories. It examines the relationship between traditional literary forms and contemporary media, such as hypertext, web logs, fan fiction, video games, comics, and interactive fiction. As a writing-intensive course, \"Narrative and Technology\" will ask students to write regularly in response to course texts and class discussions. Students will have opportunities not only to write critically about the relationships among narratives and technologies but also to write creatively, experimenting with interactive, hypermedia, and/or other new media forms.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0515", "course_title": "CONTEMPORARY AFRICAN AMERICAN POETRY", "description": "This course explores the rich and diverse field of contemporary poetry by African Americans, which has witnessed a marked growth over the last three decades. It examines the range of styles, aesthetic projects, and concerns of contemporary black U.S. poets, including the relation of various forms of experimentation to tradition; vernacular, oral, and musical expression; questions of race, culture, and identity; globalization and diasporic movements; the individual and society.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0541", "course_title": "LITERATURE AND MEDICINE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0560", "course_title": "CHILDREN AND CULTURE", "description": "This course studies children's literature through an investigation of the history of childhood through its representations in children's books and other media.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0562", "course_title": "CHILDHOOD'S BOOKS", "description": "This course surveys the field of children's literature from its earliest beginnings to the present.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0570", "course_title": "AMERICAN LITERATURE", "description": "This first course in American literature explores the characteristic features of writings from the colonial period to the present. It emphasizes the interaction between literary texts and their social contexts, and examines the emergence of a national literature.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0573", "course_title": "LITERATURE OF THE AMERICAS", "description": "Literature of the Americas introduces students to important issues in the study of literature and culture by focusing on colonial and postcolonial traditions in regions of the Americas beyond the United States. Beginning with the European \"discovery\" of the \"new world\", it examines comparatively literary and other texts from Britain, the West coast of Africa, the US, Canada, the Caribbean and Latin America, tracing the emergence of distinctive literary traditions and preoccupations of the Americas through to significant modern incarnations.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0580", "course_title": "INTRODUCTION TO SHAKESPEARE", "description": "This course will focus on a number of Shakespeare's major plays from all phases of his career. Class discussion will consider the historical context of the plays, their characterization, theatrical technique, imagery, language and themes. Every attempt will be made to see the plays both as poems and as dramatic events.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0597", "course_title": "BIBLE AS LITERATURE", "description": "This introductory course acquaints students with what is in the bible and provides background information drawn from various disciplines about the elements and issues that give it its distinctive character. Attention is necessarily given to its religious perspectives, since they govern the nature and point of view of the biblical narratives, but no specific religious view is urged.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0601", "course_title": "PROTESTS, POLITICS, AND BLACK LYRICAL TRADITIONS", "description": "Black poetic traditions span print, the spoken word, song lyrics, especially, the Blues, and rap. This course considers the history of Black lyrical traditions in the context of various moments of protest and various political movements. The course examines the mutual influences of Black music-sound, rhythm, voice, and orchestration-and Black poetry-verse, spoken word, and song and rap lyrics. Extending the analytical practice of \"close reading,\" this course asks students to also engage in practices of \"close listening\" to the Blues and rap as well as to the sounds of the written word. Practicing these together, students will gain an intricate understanding of the mutual influences between sonic and print forms of Black lyrical traditions. Additionally, this course will examine the role that Black lyrical traditions play in the cultural movements that address anti-Black racism in American culture.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0610", "course_title": "WOMEN AND LITERATURE", "description": "An exploration of writings by and about women. Through our reading of various literary forms -- poetry fiction, autobiography -- we will explore the aspirations and realities of women's lives. We will consider how social issues -- class, race, etc. -- Affect women writers.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0625", "course_title": "DETECTIVE FICTION", "description": "This course examines detective fiction in terms of its history, its social meaning and as a form of philosophizing. It also seeks to reveal the place and values of popular fiction in our lives.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0626", "course_title": "SCIENCE FICTION", "description": "This course introduces students to the major ideas, themes, and writers in the development of science fiction as a genre. Discussions will help students to understand and use critical methods for the analysis of science fiction. The topics covered include problems describing and defining the genre, contrasting ideologies in soviet and American science fiction, the roles of women as characters, readers and writers of science fiction, etc.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0630", "course_title": "SEXUALITY AND REPRESENTATION", "description": "This course will explore the relations between cultural texts and the shifting conceptualizations and figurations of sexuality and sexual politics over the past 150 years. The main objective of this course will be to understand the necessary but problematic relations between sexuality, cultural expression, and the social.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0636", "course_title": "THE GOTHIC IMAGINATION", "description": "This course examines the genre of gothic fiction, in Britain and the U.S., From its origins in the late 18th century until the present.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0637", "course_title": "HORROR LITERATURE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0655", "course_title": "REPRESENTING ADOLESCENCE", "description": "This course focuses on the question of how adolescence gets represented in a variety of genres, including young adult and children's literature; novels, plays and poetry aimed at adults that take adolescence as a theme; films and television programs; scientific, journalistic, or autobiographical commentaries on the nature of adolescence; and so on. This is one of the core courses for the children's literature certificate program, but all interested students are welcome.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0710", "course_title": "CONTEMPORARY ENVIRONMENTAL LITERATURE", "description": "This course examines the ways in which contemporary writers in English have engaged with the natural environment. We will read a range of authors, from the 1960s to the present day, to consider how they have looked critically at the human effects on ecosystems, and we will also study the interdisciplinary scholarly field of ecocriticism and its responses to such writings. Throughout, we will be attentive both to the literary qualities of writings about the environment and to their historical and political contexts.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0717", "course_title": "FAIRY TRADITION", "description": "Fairies go by many names: the Folk, the Good People, the Other Crowd, Sidhe, fey. Usually beautiful, ethereal, and morally ambiguous, fairies are a staple of western folklore and legend. Once associated with the realm of the dead and lost magic, fairies are now creatures of children's literature and fantasy. The fairy tradition encompasses vital cultural questions about the work of imagination, magic, and vision in our understanding of ourselves and the world around us. Either elusive or non-existent, depending on perspective, fairy lore evokes issues related to: the reliability of witness and of the senses; privileged and discounted perception; the interplay of the imagination and knowledge; and the role of cultural authority. Students will consider the significance of these themes through aspects of fairy folklore, book history, portrayals of childhood, reception studies, and an end-of-term creative project.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0800", "course_title": "WEATHER, CLIMATE, LITERATURE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0812", "course_title": "MEDIA/ECOLOGY", "description": "From the late twentieth century to the present, ecology as a scientific discipline and set of cultural narratives has risen to the forefront of knowledge production as a way to study and understand complex biological systems, their environments, and their internal dynamics. During the same period, media systems have grown exponentially in complexity until they too have begun to exhibit some of the behaviors of ecological systems, including self-organization, feedback, evolution, and emergent properties. The term \"media ecology\" captures both this new, nonlinear systems approach to understanding media itself as well as the intersection between natural ecosystems and the technological assemblages with which they are intertwined. This course will explore both media that interface with natural ecosystems and works that engage contemporary media systems at different scales. The secret life of information, contagious media, and the post-natural ecologies of our present and future will challenge us to conceive of Media and Ecology as a single coupled system: the emblem of our contemporary environment. Students will have the option to produce collaborative media projects that explore the themes of the course. These can take the form of simulations, games, network graphing, film or video projects, local ecosystem analysis and/or visualization, or the mapping and analysis of a media ecosystem that interfaces with the environment.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0815", "course_title": "IRISH LITERATURE", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0850", "course_title": "THE FEMALE HERO", "description": "This course studies heroism as a gendered concept as it has evolved over time. The hero is a commonly understood archetype across genres but is most often associated with masculinity. This course seeks to define, authenticate, and analyze the female hero as a powerful figure in her own right. This course will take into account the tropes of classical heroism but consider modern and contemporary texts in which the image of the hero is redefined in line with the concept of the \"female hero.\" Issues we will investigate include: the role of the masculine gaze in the construction of female heroes; feminist versions of heroism and strength; and the role race, class, and gender play in the making of a hero. We will also consider the ways that the female hero inflects or alters traditional feminine roles. And we will consider how the binary constructions of masculinity and femininity are impacted by stories with female heroes. Through analysis of fiction, film, and criticism, we will begin to define the female hero.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "0880", "course_title": "SHAKESPEARE AND SOCIAL JUSTICE", "description": "When Shakespeare's King Lear finally turns his attention to the plight of \"poor naked wretches\" who have no clothing to protect them from a \"pitiless\" storm, he realizes he has taken \"too little care\" of human suffering in his kingdom. Departing from scenes such as this one, this course explores the work of artists and critics who have used Shakespeare's plays to confront a range of social injustices, including US persecution of Native Americans, the legacies of white settler colonialism across the globe, and intimate partner violence. Examining adaptations, remediations, and appropriations of Shakespeare plays, such as Toni Morrison's Desdemona or Aimé Césaire's A Tempest, students will be invited to consider what Shakespeare signifies in different cultural contexts and to examine related contests of cultural authority and ownership. Focusing on scholarship, performances, poetry, and art by people from various marginalized groups, students will explore the histories and futures of Black Shakespeare, Indigenous Shakespeare, Trans Shakespeare, Chicano Shakespeare, and many others. Several short writing assignments will build students' skills in a range of critical and creative practices that can contribute to social justice and diversity: archival research, critical fabulation, social network mapping, oppositional reading, comparative analysis of two or more productions, and personal reflection.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1009", "course_title": "J.R.R. TOLKIEN AND COUNTERCULTURE", "description": "This course studies the persona, work, and critical and popular reception of J.R.R. Tolkien (1892-1973) from his initial publication of The Hobbit in 1937 through today. In the 1960s and '70s, people were scribbling \"Frodo Lives\" on subway walls and getting married dressed like Aragorn and Arwen. Less than half a century later, The Lord of the Rings repeatedly beat out the Bible as \"best-loved\" book in British polls, and Peter Jackson's adaptations made history both for their box-office earnings and for their groundbreaking contributions to film-making. Widely recognized as the father of modern fantasy and touted as the \"Author of the [Twentieth] Century\" by scholars, Tolkien continues to exert a panoramic influence on culture, particularly in his ability to speak to and for the marginalized. From Comic Con to Elder Scrolls to Game of Thrones, his sub-creation of Middle-earth embodies and fuels \"nerd\" culture now just as it did for the hippies of the previous century. Yet, Tolkien \" war veteran, Oxford professor of Medieval languages and literature, devout Catholic \" was a man of his time and quite conservative, at least publicly. While he famously said that his wife \"should be satisfied by devotion to her children\" and not \"enter the intellectual side of life,\" the female characters in his stories, while small in number, are arguably great in power, assertiveness, and heroism. Tolkien's writing argues for the importance of a community where all cultures coexist: Elves, Dwarfs, Men, Hobbits go to war against Sauron and the \"One Ring\" designed to \"rule them all.\" In this course we will read Tolkien's major works, The Hobbit and The Lord of the Rings in their entirety, as well as excerpts from what he considered to be his master work, The Silmarillion. We will explore Tolkien materials housed in Special Collections at Hillman Library and online. Our reading list will include reviews and scholarship on Tolkien's life and work, as well as on the ways in which his mythology continues to resonate and be reimagined in the twenty-first century. Ultimately, we will analyze the relationship between Tolkien and the counterculture as a way of understanding the ways in which myth, fantasy, and literature more broadly represent, shape, and interrogate complex social and political systems.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1100", "course_title": "MEDIEVAL IMAGINATION", "description": "This course explores some of the ways people in the middle ages saw the world around them. We will try to understand those perceptions by reading a variety of literary works, by comparing those works to other art forms and by examining similar kinds of experience in the modern world.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1135", "course_title": "LITERATURE, MEDIA, AND SCIENCE IN THE AGE OF SHAKESPEARE", "description": "This course will introduce students to the broad range of styles, genres, and concerns of literature written in English in the early modern period, particularly the 17th century. The designation \"early modern\" is capacious enough to straddle the renaissance as well as the early enlightenment. Readings could include English writers, writers from the Americas, and writers who composed in English but wrote about countries other than England, Ireland or new England.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1142", "course_title": "ANCIENT EPIC", "description": "Study of selected Greek and Roman epics in English translation. Among the works that may be read are Homer's Iliad and Odyssey, Apollonius' Argonautica, Virgil's Aeneid, and Ovid's metamorphoses.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1150", "course_title": "ENLIGHTENMENT TO REVOLUTION", "description": "This course focuses on literature and culture of the late 17th and 18th centuries--a period of revolutionary changes in the way writers and readers viewed their world. We will read widely in the important texts of the period in order to explore the interplay of enlightenment and revolution.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1180", "course_title": "HUMANS, ANIMALS, MACHINES IN VICTORIAN LITERATURE", "description": "This course studies the poetry and prose produced during the reign of queen Victoria, and places these works in relation to changing practices of science, industry, empire and culture.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1201", "course_title": "DIGITAL NARRATIVE AND INTERACTIVE DESIGN", "description": "How are computational artifacts currently designed, and how can they be designed differently? What stories can be told by collaborating with computers? What stories can't be told? This project-based course will enable students to engage with and create computational narratives and interactive projects with data, hardware and algorithms. Each collaboratively taught iteration of the course will include 3-4 of these units, such as: fabrication, interactive hardware, computational narrative, interactive data, and prototyping. Students will consider what it means to compose with computers for human audiences, and with humans for computer audiences. Designed for Digital Narrative and Interactive Design (DNID) majors to take midway through the major, it will help students consolidate the interdisciplinary knowledge they have obtained in their prerequisite courses, introduce them to examples of interdisciplinary work that will inform their later capstone projects, and give them practice in working on collaborative projects that span the humanities and information/computing fields.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGLIT", "id": "1230", "course_title": "20TH CENTURY AFRICAN AMERICAN LITERATURE", "description": "The first half of this course begins by examining some of the major authors from the 1920s who were a part of what came to be known as the 'new negro renaissance' or 'Harlem renaissance,' such as Langston Hughes, Nella Larsen, Countee Cullen, Claude McKay, and Zora Neale Hurston. We will then study a range of modernist and naturalist writers of the 1930s and 1940s, such as Richard Wright, Ann Petry, and Gwendolyn Brooks. In the second half of the course we will focus on several post-WWII writers that were associated with the civil rights and black arts movements, from the 1950s to the 1970s, including such figures as Ralph Ellison, James Baldwin, and Toni cade Bambara. Finally, we will consider the recent wave of African American writers that emerged with the popularization, in the 1980s, of several new genres of African American literature.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1262", "course_title": "AFRICAN AMERICAN SCIENCE FICTION", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1325", "course_title": "MODERNISM", "description": "This course examines major works in the modernist tradition poetry, fiction, drama--to determine the role these texts have played in creating the world that seems so familiar to us now.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1355", "course_title": "VIRTUAL REALITY", "description": "Can there be more than one reality? Is there even one? What relationship do the senses and the mind bear to the physical environment? From the dawn of human society, no topic has been more fiercely debated than the nature of reality. In narrative, philosophy, and media, virtual reality has always been with us. This course dives deep into the rabbit hole of the real and the virtual, an adventure that includes philosophy, literature, film, and, of course, VR headsets aplenty! In addition to exploring the history of the real and the virtual, we will consider the relationship of virtual reality to the body, to space, to human gesture and communication, and to code. We will also explore the role of the imagination and creativity in the generation of new worlds. You will learn to think historically, theoretically, and critically about VR. You will have the option of either writing critical papers or creating your own virtual environment or game as your final project. This course assumes no prior experience with VR or coding, but those skills can optionally be put to use in final projects. Come prepared to question your reality!", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1382", "course_title": "PRIZED BOOKS", "description": "How do metropolitan taste and recognition affect dominant and emergent literatures and nations? How do particular contexts and award-winning texts exert pressure on existing criteria and values? How does the category \"prized books\" also implicitly constitute and comment upon a body of literature that is \"unprized\"? How do prized books redefine notions of readership and citizenship in the world of globalization and electronic access? Such questions will open up the idea of \"world literature\" not as an afterthought to the canon of \"English\" literature, but as an integral and definitive part of it. Students will read literature, speeches, and essays by winners of the nobel and other global literary prizes such as the booker and the commonwealth.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1600", "course_title": "COMPUTATIONAL METHODS IN THE HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. The goals of this course are to learn how to identify research questions in the humanities that are amenable to computational analysis and processing, along with designing and implementing xml-based computational systems to explore those questions.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1645", "course_title": "CRITL APPRCH TO CHILDREN'S LIT", "description": "This course examines a variety of children's books from a number of theoretical perspectives; historical, feminist, transactional, structuralist, etc. The implications of theory will be emphasized. We will place children's books and reading in the wider context of the emotional, cognitive, and moral development of the child, the popular culture of childhood, and contemporary multicultural society.", "completed": false, "prereq_count": 1}, {"dept_code": "ENGLIT", "id": "1900", "course_title": "PROJECT SEMINAR", "description": "The junior seminar, required for English literature majors, offered in varied versions, will investigate methods and goals of literary historical study by directing attention to broad historical and theoretical issues and to long-durational developments and transformations of literacy cultural practices. Will include a range of literary, theoretical and historical texts selected to enable exploration of issues and problems that cut across traditional designations of literary historical periods.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1910", "course_title": "SENIOR SEMINAR", "description": "Intensive study of a single topic or figure that assumes previous work in related literary historical and critical areas. Each seminar moves toward a final paper that integrates earlier literary study with the specific critical perspective developed in this course.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1913", "course_title": "ADVANCED RESEARCH IN LITERATURE", "description": "Working closely with faculty members on her/his senior thesis committee to do the primary reading, foundational research, and exploratory writing for the senior thesis, the student will read a majority of the primary literary works and a significant amount of criticism and complete a minimum of 20 pages of exploratory writing or a draft of the thesis.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1914", "course_title": "SENIOR HONORS THESIS", "description": "In this course, the student will complete all remaining research for the senior thesis and will work closely with the faculty members on his/her committee to plan, write, and revise the senior thesis.", "completed": false, "prereq_count": 0}, {"dept_code": "ENGLIT", "id": "1925", "course_title": "UNDERGRAD TEACHING IN LITERATURE", "description": "Students enrolled in this course will work with an instructor as an assistant to any upper-level course being offered to English majors. They will help with course materials and generate class discussion.", "completed": false, "prereq_count": 0}], "links": [{"source": "0512", "target": "1201"}, {"source": "0560", "target": "1645"}]}