{"nodes": [{"dept_code": "SOC", "id": "0002", "course_title": "SOCIOLOGY OF EVERYDAY LIFE", "description": "This course takes as its object of inquiry the ordinary, familiar, routine, and unremarkable stuff of everyday life, beginning from the premise that, rather than being insignificant or inconsequential, what happens in everyday life crucially structures the world. As well, daily life is structured by larger social phenomena. As such, the study of everyday life provides a lens through which to explore such themes as the workings and effects of power, social change or the lack thereof, social inequality, quiescence and resistance, ideology, identity and difference, norms and normativity, subject formation and subjectivity, and practices of meaning making. Our mode of analysis will be to bring sociological concepts and theory to the sites and practices of everyday life to refine our sociological thinking and our understandings of the world. Along with exposing students to different schools of thought with regard to the study of everyday life, this course will provide students with the necessary tools to defamiliarize and denaturalize that which might seem natural, obvious, and axiomatic. It also is designed to help students think about the relationship between social processes and the individual and about what is at stake in understanding how they mutually affect one another in any given context.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0005", "course_title": "SOCIETIES", "description": "This introductory course is devoted to furthering an understanding of life in America today by comparing it to a variety of societies worldwide. Among the societal aspects explored; political and economic systems, cultural styles, major religions and religious trends.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0007", "course_title": "SOCIAL PROBLEMS", "description": "The major aims of this course are to understand the nature of important social problems in American society and analyze their causes and consequences. The two competing perspectives, one, that social problems are created when individuals fail to conform to societal norms, and two, that social problems are caused when institutions fail to meet changing needs and aspirations of individuals will be used in our analysis. Future trends and policy alternatives toward amelioration will be examined.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0010", "course_title": "INTRODUCTION TO SOCIOLOGY", "description": "This course introduces the student to the discipline of sociology, its development, theories, major findings, and to the sociological interpretation of modern society. Emphasis will be given to the importance of careful empirical investigation for the understanding of recent social and cultural changes. Students should be prepared to encounter basic issues in sociological method and in theory; an inclination toward systematic and abstract reasoning will help.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0140", "course_title": "CLASSICAL SOCIOLOGICAL THEORIES", "description": "This course will deal with the foundations of modern sociological theory through a study of major social theorists of the 19th and early 20th centuries.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0150", "course_title": "SOCIAL THEORY", "description": "The aim of this course is to provide a survey of major developments in sociological theory in recent times. The classic background for these developments is included as part of the course. Lectures, readings and discussions help the student to acquire a grasp of the significance of theoretical analysis in sociology and of basic sociological problems addressed by a variety of theorists.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0230", "course_title": "SOCIAL RESEARCH METHODS", "description": "Students begin to learn to do social research in this course. They learn how to define an appropriate problem, select an appropriate method, collect and analyze data, discuss their results, and draw conclusions. Students study both quantitative and qualitative methods.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0317", "course_title": "GLOBALIZATION", "description": "The aim is to analyze the dynamics of civilization in today's interconnected world. How is people's social and cultural life shaped by their position in the world, by local traditions and distant forces? How have the independently coexisting civilizations of earlier centuries become incorporated into a global civilization in which colonial empires and the communist regime have given way to wider democracy and a capitalist regime with global dynamics? How is Western culture (beliefs, values and symbols) disseminated and embraced, modified or resisted in non-Western societies?", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0339", "course_title": "SOCIOLOGY OF RELIGION", "description": "This course will compare and contrast major classical and modern sociological theories of religion, including discussion of the renewed focus on religion in mainstream, general theory. Attention will be narrowed to a focus on relation between religions, states and individuals in comparative and historical perspective.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0352", "course_title": "SOCIAL MOVEMENTS", "description": "This course offers ideological, structural, and functional treatment of dominant American movements for social and cultural change in our contemporary world.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0432", "course_title": "WEALTH AND POWER", "description": "In this course we aim to understand the fundamental structure and workings of modern capitalist society. We will examine the distribution of wealth, income, and power in both the US and globally, and consider the notions of democracy and imperialism in the context of what we broadly call, \"globalization\". Can we have political equality in societies with high degrees of economic inequality? Are corporations too powerful? Whose side does government usually take the little guys' or the corporations'? Why? How is it possible that the richest nation in the world also has more poverty than any other \"democratic\" country? We will explore these and many other topics from the macro- to the micro- levels of analysis", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0434", "course_title": "POLITICAL SOCIOLOGY", "description": "This course examines the relationship between political institutions and the institutions of the economy, family, education, religion, and stratification. With a major focus on American society and the conditions underlying stable democracy, these relationships are studied in historical and cross-societal comparative perspective as well as in terms of a society's location in the system of international relations.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0446", "course_title": "SOCIOLOGY OF GENDER", "description": "This course will analyze the various processes and institutions through which gender roles are defined and shaped in our society. It will analyze the interaction between individual conceptions of gender and larger social institutions such as the family, the workforce, the media, religion, etc. The current changes in these roles will be related to changes in other social institutions. We will also examine the multiple forms of inequality in our society--based on sex, race, class, and sexual preference--and see how they interact.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0460", "course_title": "RACE AND ETHNICITY", "description": "This is a course presenting the central sociological interpretations of majority/minority relations. The course begins with a consideration of minorities around the world. With world minorities as a frame of reference, the course turns to the United States and its special opportunities and problems.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "0477", "course_title": "MEDICAL SOCIOLOGY", "description": "This is a course on socio-cultural aspects of health, illness, disease and (medical) treatment in American society. The historical transformation of American medicine into a powerful sovereign profession with unparalleled authority, autonomy and control over all aspects of health and illness will be examined. On the basis of this historical survey, recent empirical studies of distribution of health, disease and medical care will be examined as well as specific substantive issues and contemporary debates.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1312", "course_title": "PITTSBURGH, DIASPORA, MIGRATION: SLAVIC AND EAST EUROPEAN COMMUNITIES", "description": "This course provides an overview of the diverse experiences of migration to Pittsburgh from Eastern and Central Europe, extending from the early twentieth century through the current moment. An interdisciplinary selection of readings is supplemented by opportunities for extensive fieldwork in English and in a range of relevant languages throughout western Pennsylvania, as well as in Eastern and Central Europe (the latter via electronic means during the semester, and through possible study abroad in the summer). Focused both on Pittsburgh and on Eastern and Central Europe in the twentieth and twenty-first centuries, the course surveys the experiences of the following communities in and near Pittsburgh: Bosnian, Croatian, Czech, Hungarian, Jewish, Montenegrin, Polish, Russian, Serbian, Slovak, Ukrainian, among others. Students are introduced to the aims and methods of the public humanities and social sciences, learning research and technical skills in support of podcast, website, and short video production.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1362", "course_title": "REVOLUTIONARY SOCIAL MOVEMENTS", "description": "A broad survey of social revolutionary movements of the past, such as those leading to the French and Russian revolutions, and their influence on various movements taking place in third world countries of today. Emphasis will be placed on movements presently underway in Latin America.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1364", "course_title": "RACE AROUND THE WORLD", "description": "Beginning with colonialization, race has had a profound influence on local and global socioeconomic relations. This seminar explores the historical roots of race, the role race played in colonization and the transatlantic slave trade, how colonial legacies and globalization perpetuate the racial hierarchy in nations with little racial diversity, and how migration and international relations continue to shape and reshape a global conception of the racial order. As students explore race around the world, they will be encouraged to consider how the fight for racial justice can be both local and global.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1365", "course_title": "RACE, CLASS, AND GENDER", "description": "This comparative course draws together a multidisciplinary set of readings to examine the intersection of race, gender and social and economic development in Latin America and the USA. Readings include theories of inequality and case studies.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1445", "course_title": "SOCIETY AND ENVIRONMENT", "description": "The state of the environment reaches the pages of our newspapers every day. How did we get to this state? Throughout history, human societies have made use of the environment as all human activity is dependent on through puts of energy and materials. The course will seek to understand the social, economic, and political processes as they lead to impacts on the environment. Far from being 'out there', the state of the environment is integrally related to the ways societies work.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1450", "course_title": "HEALTH AND ILLNESS", "description": "This upper-level course investigates selected concepts in health, illness and medical care. We will examine the impact of medicalization, stratification, and the transformation of healthcare provision.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1488", "course_title": "HISTORY MEDICINE AND HEALTH CARE", "description": "Provides an overview of the social history of medicine from prehistory to the present. Focuses on the emergence of medical institutions, education, theories, practices and the orthodox and irregular medical sects. Describes the growth of the separate disciplines of nursing, pharmacy and public health. Examines the impact of socioeconomic factors, religions and war on the evolution of medical science. Discusses the changing roles of government in the development of the American health care system.", "completed": false, "prereq_count": 0}, {"dept_code": "SOC", "id": "1500", "course_title": "CAPSTONE RESEARCH PRACTICUM FOR MAJORS", "description": "", "completed": false, "prereq_count": 1}, {"dept_code": "SOC", "id": "1504", "course_title": "ISLAM AND BRITAIN", "description": "This course examines how multiethnic diversity shapes and defines our understanding of modern Britain, through a specific focus on Muslim communities in London and the nature of their interactions with wider society. Students analyze the ways in which imperialism and its legacy, as well as Britain's global relationships, have influenced political policies and social attitudes toward multiculturalism and Muslim groups in particular.", "completed": false, "prereq_count": 0}], "links": [{"source": "0150", "target": "1500"}]}