{"nodes": [{"dept_code": "BUSHRM", "id": "1050", "course_title": "HUMAN RESOURCES MANAGEMENT", "description": "Provides an introduction to the management of human resources at the organizational level. HRM is viewed as an integral part of the basic management process and the orientation of the course is toward developing managerial skills useful in establishing organizational personnel policy. Specific topics include the role of HR in the management process, HR planning and forecasting, job information systems, recruitment and selection, HR development, compensation, legal framework and evaluation.", "completed": false}, {"dept_code": "BUSHRM", "id": "1680", "course_title": "COMPENSATION AND PERFORMANCE MANGEMENT", "description": "Examines the general structure of an organization and the rewards employees seek in exchange for the efforts and contributions they provide. Topics include: rewards and motivating work environment; government and union influences; job content analysis, description and evaluation; determining competitive relationships, developing pay structures; measuring performance and paying for performance; employee benefits; administration of the compensation plan; executive, managerial, professional, and sales compensation.", "completed": false}, {"dept_code": "BUSHRM", "id": "1685", "course_title": "EMPLOYMENT AND LABOR RELATIONS", "description": "Provides a close examination of the day-to-day labor-management relationship and processes. Considers contract negotiations, contract administration, discipline and grievance procedures, and third-party conflict resolution assistance such as mediation, fact-finding and arbitration. Emphasis is placed on the structure, organization, and objectives of the parties. The similarities and differences between private and public-sector bargaining are also considered.", "completed": false}, {"dept_code": "BUSHRM", "id": "1686", "course_title": "SPORTS MANAGEMENT PROJECT COURSE", "description": "The objective of this course is to provide the student a meaningful experience with a real-world client and problem. Each project is distinct and generally will afford opportunities for a team of students to apply conceptual and analytical skills taught in the CBA major and core classes and to report to the client the result of all assessments. While particular projects may have a primary focus on one functional area (marketing, finance, accounting, human resources, supply chain, business information systems or global management), each will also feature cross functional dimensions.", "completed": false}, {"dept_code": "BUSHRM", "id": "1688", "course_title": "HUMAN RESOURCE ANALYTICS", "description": "Three credit elective in the College of Business Administration. The course is designed to acquaint students with this rapidly expanding area in the human resource field. Using simulations from a variety of human resource analytics packages common in HR departments, students will learn to critically assess data and metrics for human resource problem solving and examine the manner in which such data is organized and reported. The class will also provide opportunity to interpret and report results from statistical and predictive analysis to aid decision making in the firm.", "completed": false}, {"dept_code": "BUSHRM", "id": "1689", "course_title": "SPORTS MANAGEMENT", "description": "Many students aspire to careers in the NFL, NBA, and major league baseball. But, as we all know, employment prospects in those organizations are decidedly limited. However, a February, 2014 forbes.Com post indicates that the sports industry as a whole will grow by $145.3 billion between 2010 and 2015. This course recognizes that the sports industry is much broader than just professional sports teams including firms in sports clothing, sports equipment, sports drink, sports medicine, venue management, food and beverage, sports media, and sports marketing. The sports industry is a labor intensive industry with human resource and project management skills as key success factors. This class is designed to examine these administrative skills which will serve well you in any of your career pursuits while satisfying your passion for sports. Planned topics, exercises and activities in the course include a look at game day preparations, facilities management including a behind the scenes tour of a facility, player selection (through a draft simulation) and retention, coaching, licensing, sports media, and sports marketing.", "completed": false}, {"dept_code": "BUSHRM", "id": "1690", "course_title": "HUMAN RESOURCES MANGEMENT INTERNSHIP", "description": "The human resources management internship provides business credits for project assignments that augment a professional HRM work experience.", "completed": false}], "links": [{"source": "1050", "target": "1680"}, {"source": "1050", "target": "1685"}, {"source": "1050", "target": "1690"}]}