{"nodes": [{"dept_code": "NPHS", "id": "1510", "course_title": "FEDERAL AND INTERNATIONAL FRAMEWORK FOR EMERGENCY PREPAREDNESS", "description": "NPHS 1510 covers overarching frameworks for the federal government's planning and response to crises. These include the National Response Framework (NRF) and the National Incident Management Systems (NIMS), which establishes the Incident Command System (ICS) and the Emergency Support Functions (ESFs). Because the federal government is the interface with foreign governments for events with transnational elements, international aspects of crisis management and the international context for threat assessment are covered in this course.", "completed": false}, {"dept_code": "NPHS", "id": "1540", "course_title": "CAPSTONE COURSE IN EMERGENCY PREPAREDNESS", "description": "Along the lines of workshops conducted by the Defense Advanced Research Projects Agency (DARPA), the capstone course is dedicated to exploring a variety of solutions to a single, complex, interdisciplinary problem - a \"wicked\" problem - in emergency management. \"Wicked\" problems are complex problems for which there is an unlimited number of potential solutions, but choosing among them is difficult because they have huge impacts and there are no immediate or ultimate tests of their worth - they are neither true nor false but good or bad. The \"wicked\" problem considered in NPHS 1540 may change from term to term to meet emerging demands or class composition.", "completed": false}, {"dept_code": "NPHS", "id": "1900", "course_title": "INTERNSHIP", "description": "Students registered for NPHS 1900 pursue an internship involving work related to national preparedness and emergency management. Students are responsible for securing internships and a faculty member to sponsor the internship. Students should produce academic work in conjunction with their internship, which the faculty sponsor will evaluate and grade. Faculty permission is required prior to enrollment. Consult an advisor for further information.", "completed": false}, {"dept_code": "NPHS", "id": "1901", "course_title": "INDEPENDENT STUDY", "description": "Students registered for NPHS 1901 pursue research on a project related to national preparedness and emergency management under the direction of a faculty member. Students develop a study plan with the faculty member, typically working independently on a paper or report, with occasional meetings. Faculty permission is required prior to enrollment. Consult an advisor for further information.", "completed": false}], "links": [{"source": "1510", "target": "1540"}]}