{"nodes": [{"dept_code": "HI", "id": "1231", "course_title": "TALENT MANAGEMENT AND HUMAN RESOURCES", "description": "This course discusses the principles and methods practiced in human resource management in the health care environment. The role of the supervisor is emphasized, and practical applications in conjunction with theory are presented to the student. This course is a practical guide to human resource management in health care and covers topics such as recruitment, compensation and benefits, training, discipline, termination, legal issues, labor unions, and multi-human interactions that emerge in the workplace. It is also an overview of the laws and regulations that guide every decision related to managing people in the complex society in which we exist today.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1431", "course_title": "REVENUE CYCLE MANAGEMENT", "description": "This course will provide an introduction into revenue cycle management which includes the process of when the patient first makes an appointment, checking patient insurance eligibility, understanding payment methodologies, revenue, payment cycle management, claims audits, compliance, value-based purchasing and outpatient prospective payment systems. Clinical Documentation Improvement Programs and the increased use of CAC programs will also be explored as well as minimizing healthcare fraud.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1437", "course_title": "CLASSIFICATION SYSTEMS IN HEALTHCARE", "description": "This course will enable the student to apply the principles of taxonomy as well as understand the purposes of classifying diseases and operations. An in-depth study of ICD-10-CM, ICD-10-PCS and CPT-4 will be undertaken along with an introduction to ICD-11. The interaction of Diagnosis Related Groups (DRG's) with classification systems will be emphasized. Data quality, the Uniform Hospital Discharge Data Set as well as coding/sequencing guidelines for both inpatient and outpatient coding will be examined.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1451", "course_title": "DATABASE DESIGN AND BIG DATA ANALYTICS", "description": "This course will provide students with the theoretical and technical aspects of database, specifically in data modeling, design of database, as well as learning the \"language\" to manage database. The second section will address advanced topics in database and big data, including transforming data, data warehousing and data mining, and analysis and visualization of data. Students will work extensively with Microsoft Excel, Access, and SQL server to gain practical experience in design and implementation of health-related databases. Students will also learn important healthcare business/consulting skills that include presenting data as information, writing executive summaries, and preparing professional reports that highlight healthcare data findings.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1452", "course_title": "DIGITAL HEALTH AND ELECTRONIC HEALTH RECORD SYSTEM", "description": "Digital health technologies include solutions for both health care providers and patients, ranging from Electronic Health Records, Telemedicine, Mobile Health, Wearable Devices, as well as many emerging Internet-of-Things devices and sensors. This course will provide students with opportunities to explore; analyze, and discuss key issues, principles and policies surrounding digital health. The responsibilities of the health informatics and information management professional, as well as the requirements of accrediting and licensing agencies related to digital health technologies will also be discussed. The final assignment of this course will task students to work with key health service stakeholders (who will share their knowledge throughout the course as well) to investigate and propose a practical digital health solution to tackle a specific health issue.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1454", "course_title": "DATA SCIENCE IN HEALTH INFORMATICS", "description": "This is an introductory course to health data science and will cover data sources, types, collection methods, processing and analysis methods, and analysis result interpretation with an emphasis in health-related data. Assigned hands-on projects will enable students to have the skills to analyze various types of health data sets using different methods and have the ability to interpret the meaning of the results.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1471", "course_title": "INTRO TO HEALTHCARE IT AND EMERGING TECHNOLOGIES", "description": "This course will cover important health IT standards for clinical document and healthcare data exchange & interoperability such as Consolidated-Clinical Document Architecture (C-CDA), Fast Healthcare Interoperability Resource (FHIR). This course will also survey emerging health technologies such as cloud computing, artificial intelligence in healthcare, wearable devices and block chain technologies. The contents of the course can change and evolve as new standards and new technologies emerge.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1497", "course_title": "CLINICAL INTERNSHIP", "description": "This clinical experience involves a six-week clinical affiliation at contracted health care sites or health-related organizations under the supervision of data science, health informatics or health information management professionals. Student assignments are structured to provide actual experiences in the administrative, managerial, technical and project-oriented areas of health informatics and information management, such as electronic health records development and training, project management, systems analysis, human resource management, health information systems, database management, data science, data analytics and other similar experiences.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1650", "course_title": "INTRO TO STATISTICS AND RESEARCH DESIGN", "description": "This course is designed to provide students with a practical understanding of the use of statistics in health informatics and information management (HIIM). Descriptive statistics, inferential statistics, and some non-parametric statistics will be discussed and utilized with healthcare data or concepts. The use of Excel and SPSS will be used to run statistical tests and understand the meaning of the output generated. Research articles and statistical projects will be used to learn the meaning of statistics and its use in the field of HIIM. Epidemiology and epidemiologic research design and methods for the HIIM student will also be included. Types and purposes of epidemiology, measures of risk, and sources of data will be discussed.", "completed": false, "prereq_count": 0}, {"dept_code": "HI", "id": "1651", "course_title": "CAPSTONE PROJECT", "description": "This is the final capstone course where the faculty will assess students' attainment of all the required professional competencies in health informatics and information management (HIIM). This will be determined by completing the senior project, an independent project in which the student serves as a consultant to a particular health care facility in order to solve a problem. It will also be determined by completing a poster presentation of the senior project, the study preparation, taking both a mock exam developed by the HIM department based upon its curriculum and taking an entry-level nationally validated exam administered by AHIMA, the RHIA.", "completed": false, "prereq_count": 0}], "links": []}