{"nodes": [{"dept_code": "PETE", "id": "1204", "course_title": "ENHANCED OIL RECOVERY PROCESSES", "description": "This course covers different topics on enhance oil recovery processes (co2, thermal, miscible fluids and surfactants); coal-bed methane, enhanced methane recovery, and underground coal gasification; surface and in-situ heavy oil, tar sand and oil shale production; and co2 capture, sequestration and disposal. The fundamentals, thermodynamics, reaction kinetics and transport phenomena as well as the environmental issues and regulations related to these topics are also covered.", "completed": false}, {"dept_code": "PETE", "id": "1205", "course_title": "PETROLEUM PRODUCTION ENGINEERING", "description": "This course covers principles of oil and gas production from hydrocarbon-bearing formations. Topics include: flow through porous media of incompressible, compressible and slightly compressible fluids; reservoir, producing formation, vertical lift, and chock performances; principles of gas lift, gas lift valves and design; and sucker rod pumping design; and design project on artificial gas lift.", "completed": false}, {"dept_code": "PETE", "id": "1208", "course_title": "PETROLEUM DRILLING AND WELL COMPLETION", "description": "This course covers different topics related to drilling operations; directional drilling techniques; completion operations; and work-over operations. The drilling operations encompass drilling rig components, bit selection program, drilling fluid types, cementing program design and well control/safety. The directional drilling techniques include: well-path design/applications, downhole motor components, directional surveys, and logging while drilling. The well completion operations contain: formation evaluation tools, open-hole log interpretation, coring tools, flow testing, perforating, hydraulic fracturing and other stimulation techniques. The work-over operations comprise work-over rig components, cased hole log interpretation, plugs/packers/fishing tools, squeeze job design, casing integrity tests and stimulation evaluation. A special project on casing design is also included.", "completed": false}, {"dept_code": "PETE", "id": "1209", "course_title": "HYDRAULIC FRACTURING MECHANICS AND APPLICATIONS", "description": "Course description: this class will prepare students to wisely and critically design hydraulic fracturing treatments as well as make informed recommendations to employers, governments, and communities about the risks and benefits of hydraulic fracturing methods. Upon completion of this course, students will be equipped to use engineering formulae to estimate hydraulic fracture dimensions, evaluate strengths and weaknesses of various modeling approaches, characterize subsurface conditions from wellbore pressure analysis, make sound recommendations for monitoring, and compare and contrast approaches and risks for a range of application domains.", "completed": false}], "links": []}