{"nodes": [{"dept_code": "BIOSC", "id": "0057", "course_title": "FOUNDATIONS OF BIOLOGY RESEARCH LABORATORY 1", "description": "This research-focused first-semester introductory biology lab uses real research projects to introduce biology as an experimental science. Students learn current laboratory techniques through an inquiry-based project or set of projects throughout the semester. Experiments can focus on genetics, molecular biology, evolution, and ecology. Topic for each section is listed under Meeting Information.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0067", "course_title": "FOUNDATIONS OF BIOLOGY RESEARCH LABORATORY 2", "description": "This research-focused second-semester introductory biology lab uses real research projects to introduce biology as an experimental science. Students learn current laboratory techniques through an inquiry-based project or set of projects throughout the semester. Experiments can focus on genetics, molecular biology, evolution, and ecology. Topic for each section is listed under Meeting Information.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0068", "course_title": "FOUNDATIONS OF BIOLOGY SEA-PHAGES LABORATORY 2", "description": "This is the second half of a two-part introductory biology lab that uses bacteriophage discovery to introduce biology as an experimental science. Students learn current computational biological techniques through annotation and characterization of novel viral genomes and current lab techniques through advanced phage biology experiments. Students will be introduced to concepts in bioinformatics, microbiology, evolution, and molecular biology through hands-on experiments driven by results obtained during class.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0150", "course_title": "FOUNDATIONS OF BIOLOGY 1", "description": "This introductory course in biology is divided into two parts. The first part covers the cellular basis of life including a discussion of simple chemistry; cells as units of structure and function; and energy transformations. The second part includes an examination of those functions common to all organisms such as nutrition, gas and fluid transport, and hormonal and neuronal control. Throughout, the emphasis is on the mechanisms used to accomplish these basic functions.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0160", "course_title": "FOUNDATIONS OF BIOLOGY 2", "description": "This introductory course covers the basic principles of genetics, evolution, and ecology. Emphasis will be placed on the experimental and observational basis for our knowledge of these subjects.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "0165", "course_title": "HONORS FOUNDATIONS OF BIOLOGY 2", "description": "This course will cover the cell cycle, DNA replication, transcription, translation, molecular biology, biotechnology, genomics and bioinformatics, plant development, and animal development. The experimental basis supporting our understanding of these processes will be introduced.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0350", "course_title": "GENETICS", "description": "This course is designed to examine the gene in the following dimensions: the gene as a unit of transmission, a unit of function, and a unit of mutation. In addition, the distribution and activity of genes in populations will be considered in the context of current theories of evolution.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "0351", "course_title": "GENETICS LABORATORY", "description": "Laboratory exercises designed to illustrate the major principles of genetics.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "0352", "course_title": "INTRODUCTION TO MOLECULAR GENETICS LABORATORY", "description": "Molecular genetics uses precise genome engineering to address increasingly sophisticated biological questions. In this course students will participate in an authentic research project, for example creating new mutations using current recombinant techniques and testing the biological consequences.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "0370", "course_title": "ECOLOGY", "description": "The objective of the course is to provide a broad introduction to the study of ecology at the undergraduate level, through the presentation of lectures dealing with organismal, population, community, and ecosystem levels of hierarchical organization. The contributions of laboratory and field investigations to the development of ecological knowledge will be considered.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "0815", "course_title": "GENES AND DISEASES FOR NON- MAJORS", "description": "This course is designed to give students not majoring in biology the essential background in genetics and evolution to understand human disease. The material covered includes the fundamental principles of genetics, the role of genes and environment in various diseases, genomics, and the role of evolution. An essential part of the course is the discussion of current issues, such as genetic diseases, genetic screening, reproductive cloning, gene therapy, genetic basis of cancer, and emerging and reemerging diseases.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1000", "course_title": "BIOCHEMISTRY", "description": "This course is designed to provide students with a basic understanding of the principles and underlying themes of modern biochemistry. The course includes all the major topics in biochemistry in considerable depth including thermodynamics and enzymology, protein and nucleic acid structure, function, and synthesis, lipids and membranes as well as metabolic pathways. This course will require that you master a new vocabulary including chemical structures, and there is an emphasis throughout on experimental approaches, molecular mechanisms, and problem solving. Although the same topics will be covered as in the two semester biochemistry series (BIOSC 1810-1820), no one topic in BIOSC 1000 will be covered in as much detail.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1010", "course_title": "COMMUNICATING IN THE BIOLOGICAL SCIENCES", "description": "Conventions of scientific communication will be taught in this junior/senior level course as students learn to locate, read, and analyze primary literature in preparation for writing and revising a clear and concise review article. Students also prepare and revise an oral presentation of their review topic. Attention to document design, argument construction, verbal communication, and presenting skills will be taught and practiced. In addition to instructor led workshops, extensive peer review exercises are incorporated to help students develop evaluation skills and learn to incorporate feedback.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1120", "course_title": "BIOSTATISTICS", "description": "This course provides students the knowledge on applications of statistical technique to biological problems. The data fit, regression analysis, significance of correlation coefficient and of standard error of estimate will be discussed. The binomial, normal, and Poisson distributions, the student's t-distribution and the chi-squared distribution will be introduced. Hypothesis testing, significance levels, confidence limits for large and small samples and non-para metric statistics will be covered. Basic computer programming (use of BMDP and statview) will be introduced.", "completed": false, "prereq_count": 2}, {"dept_code": "BIOSC", "id": "1130", "course_title": "EVOLUTION", "description": "This course is an introduction to biological evolution. The theory, process and pattern of evolutionary change are presented. This course will encompass both micro evolutionary and macro evolutionary concepts. Lecture topics will include inheritance and variation, population genetics, natural selection, speciation, adaptation, the fossil record, and phylogenetic.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1250", "course_title": "HUMAN PHYSIOLOGY", "description": "After a general introduction on cell biology, physiology of nerves and muscle, and intercellular communication, this course will survey the function of the following systems: cardiovascular, respiratory, renal, and gastrointestinal. Each system discussed will be integrated into the larger function of homeostatic and their adaptation during pathology and challenges (e.g., exercise).", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1255", "course_title": "PHYSIOLOGY LABORATORY", "description": "This laboratory course complements BIOSC 1250 human physiology. Students will spend the first half of the semester developing their skills by measuring homeostatic parameters of the human body (blood pressure, blood chemistry, muscle response, etc.). They will then use that knowledge to design and perform experiments modeled after conditions of both eustress (exercise) and distress (disease). In addition to weekly assignments, students will be required to present the results of their research projects.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1275", "course_title": "GENOMICS", "description": "The sequencing of the human genome has revolutionized the way in which we think about diverse biological topics. This course will explore how advances in our understanding of such subjects have been made possible by innovative sequencing technologies. This course will combine lecture, roundtable discussions and group presentations to explore how such technologies have allowed scientists to analyze genome-wide correlations between species to ultimately provide deeper insight into genome structure and function, the evolution of genomes, and the greater roles of genome analysis and editing in modern medicine.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1285", "course_title": "GENOMICS LABORATORY", "description": "This course guides students through the design and evaluation of a data-driven research project in the area of genomics and metagenomics. In the first half of the course students apply methods of molecular biology to collect data about the studied system that are used as the starting point for scientific questions and hypotheses. In the second half they analyze the data and test their hypotheses using comparative and functional genomics approaches", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1435", "course_title": "ENVIRONMENTAL PHYSIOLOGY OF ANIMALS", "description": "This course in ecophysiology is a physiology course taught from an ecological and evolutionary perspective. The organismal, ecological, and evolutionary significance of physiological function will be emphasized along with molecular and cellular mechanisms. BIOSC 1430 and 1435 are considered course repeats with similar material covered as a field course or a lecture course, respectively.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1440", "course_title": "ANIMAL BEHAVIOR", "description": "This course examines the diversity of animal behavior from evolutionary and ecological points of view. We will examine how animals decide what to eat, where to live, how to compete with each other, and how to avoid predators. We also will investigate how animals choose who to mate with, when they should offer parental care, the conditions that favor social living, and how to best communicate. The lecture and recitation material is appropriate for more advanced students that have been trained in introductory biology and ecology.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1455", "course_title": "HUMAN ENDOCRINOLOGY", "description": "This course will focus on the physiology and anatomy of the human endocrine system. The molecular mechanisms of the synthesis, distribution, action, and regulation of hormones will be covered. Endocrine disorders including diabetes, Cushing's disease, Addison's disease, and parathyroid and calcium diseases will be studied to provide context. Additionally, we will cover the endocrine milieu of the developing embryo to adulthood and developmental disturbances during reproduction.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1470", "course_title": "BIOPHYSICAL CHEMISTRY", "description": "This course will deal with fundamental physical chemical principles especially applicable in the study of molecular biology. Topics will include (1) thermodynamics and chemical equilibrium; (2) kinetic theory and transport; and (3) chemical and enzyme kinetics. These subjects will be richly highlighted with numerous examples from biological systems, and techniques for studying these systems will be described. The topics covered will be developed from a physical chemical point of view.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1520", "course_title": "DEVELOPMENTAL BIOLOGY", "description": "The mechanisms of animal development will be analyzed. The first half of the course will emphasize classic embryological investigations focusing on how the embryonic body plan becomes organized, while the second half will deal primarily with the genetic and molecular regulation of development. The experimental analysis of such processes as fertilization, morphogenetic movements, tissue interactions, pattern formation, and gene expression will be discussed using examples from a variety of animal embryos, and by discussion of the current research literature.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1530", "course_title": "DEVELOPMENTAL BIOLOGY LABORATORY", "description": "This laboratory course is designed to provide students with practical experience in the scientific method of experimental research with regard to animal development. Initial labs will stress observational skills, but the goal of each will be to understand the careful and deliberate process of experimental design, execution, and the interpretation of results. The importance of establishing and interpreting controls in experimental procedure will also be emphasized.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1531", "course_title": "DEVELOPMENTAL BIOLOGY LABORATORY WRITING PRACTICUM", "description": "Course is a writing practicum for developmental biology laboratory, BIOSC 1530. Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 1530.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1542", "course_title": "COMPUTATIONAL GENOMICS", "description": "This course will explore the use of computer-aided methods to generate and test biological hypotheses at whole-genome scales. Students will gain both a theoretical and practical understanding of working with genomic data typical of high-throughput sequencing technologies.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1550", "course_title": "ECOLOGY AND EVOLUTION SEMINAR", "description": "In this seminar course, a single topic is developed by student presentations of research articles from the original scientific literature as chosen by the instructor. Topics might include, for example, \"cladistics controversies\", \"molecular phylogeny\", or \"wetlands conservation\".", "completed": false, "prereq_count": 2}, {"dept_code": "BIOSC", "id": "1551", "course_title": "ECOLOGY AND EVOLUTION SEMINAR WRITING PRACTICUM", "description": "This course is a writing practicum for the ecology and evolution seminar. Students will write one paper, with several revisions, based on the topic of their oral presentation in the co-requisite course BIOSC 1550. Topics will be chosen by the instructor for BIOSC 1550.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1560", "course_title": "CELL AND DEVELOPMENTAL BIOLOGY SEMINAR", "description": "In this seminar course, a single topic each term is developed by student presentations of research articles from the original scientific literature, as chosen by the instructor. Possible topics might include genes encoding major developmental switch proteins, the cytoskeletal basis of morphological movements in development, or establishing and subdividing body axes in development.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1561", "course_title": "CELL DEVELOPMENTAL BIOLOGY SEMINAR WRITNG PRACTICUM", "description": "This course is a writing practicum for the cell and developmental biology seminar. Topics will be chosen by the instructor for BIOSC 1560.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1570", "course_title": "MICROBIOLOGY SEMINAR", "description": "In this seminar course, a single topic each term will be chosen in which the instructor is experienced and knowledgeable, and in which a suitable collection of primary research articles is available for student presentation. The papers to be discussed will be drawn primarily from the recent literature, and will reflect current concepts in microbiology.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1571", "course_title": "MICROBIOLOGY SEMINAR WRITING PRACTICUM", "description": "This course is a writing practicum for the microbiology seminar. Topics will be chosen by the instructor for BIOSC 1570.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1580", "course_title": "BIOCHEMISTRY SEMINAR", "description": "In this seminar course, a single topic each term is developed by student presentations of research articles from the original scientific literature, as chosen by the instructor. Recent topics have included biosynthesis of peptide hormones, recombinant DNA technology, processing of mRNA precursors, protein folding with emphasis on the molecular biology and biochemistry of chaperonins, and protein translocation within cells.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1581", "course_title": "BIOCHEMISTRY SEMINAR WRITING PRACTICUM", "description": "This course is a writing practicum for the biochemistry seminar. Topics will be chosen by the instructor for BIOSC 1580.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1640", "course_title": "COMPUTATIONAL BIOLOGY RESEARCH", "description": "This course will use computational biology methods to address an authentic research question.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1730", "course_title": "VIROLOGY", "description": "This course presents the concepts and methods of modern molecular virology. Principles of bacteriophage and animal virus replication are covered. Particular emphasis is placed on the use of viruses as model systems to approach basic problems in molecular biology. Applications of virological knowledge to medicine and biotechnology will be discussed.", "completed": false, "prereq_count": 2}, {"dept_code": "BIOSC", "id": "1740", "course_title": "VIROLOGY LABORATORY", "description": "This course is designed to give each student practical experience with the methods and techniques used in the study of viruses while conducting original research using bacteriophages.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1741", "course_title": "VIROLOGY LABORATORY WRITING PRACTICUM", "description": "Course is a writing practicum for virology laboratory, BIOSC 1740. Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 1740.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1760", "course_title": "IMMUNOLOGY", "description": "Course will describe the role of the immune system invertebrates. The molecular and cellular basis of immunity will be emphasized. The roles of antigens, antibodies and immunocompetent cells in pathogenesis and immunity will be covered. The applications of immunology in the design of vaccines, immunotherapeutic, immunodiagnostics, organ transplantation, cancer therapy, and immune system diseases will be discussed, as will the use of immunology in biological research.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1820", "course_title": "METABOLIC PATHWAYS AND REGULATION", "description": "The primary focus of this course will be on the pathways of intermediary metabolism by which all cells and organisms synthesize and degrade carbohydrates, lipids (fats), nitrogenous compounds, and nucleotides. Specifically, we will examine the chemistry of the reactions that constitute these pathways, and discuss how energy is derived from the breakdown of nutrients. A strong emphasis will be placed on how the pathways are regulated by specific molecules and hormones in living systems. Finally, we will consider how several human diseases arise from defects in metabolic pathways, and will review papers in the current scientific literature on new techniques by which the components of metabolic pathways are characterized in the laboratory.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1830", "course_title": "BIOCHEMISTRY LABORATORY", "description": "Course introduces several basic experimental techniques of biochemistry including spectrophotometry, ion-exchange and gel-permeation chromatography, radio-chemical methods, gel electrophoresis, enzyme isolation, and nucleic acid purification. Lecture will concern the techniques under study.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1831", "course_title": "BIOCHEMISTRY LABORATORY WRITING PRACTICUM", "description": "Course is a writing practicum for biochemistry laboratory, BIOSC 1830. Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 1830.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1850", "course_title": "MICROBIOLOGY", "description": "This course will introduce students to the basic biology, diversity in types, and survival strategies of microorganisms. We will study basic topics, including microbial growth, metabolism, nutrition and genetics, as well as the relevance of microorganisms to human disease, biotechnology and environmental science.", "completed": false, "prereq_count": 1}, {"dept_code": "BIOSC", "id": "1855", "course_title": "INTRODUCTION TO MICROBIOLOGY LABORATORY", "description": "Students in this course will culture microorganisms from natural samples such as soil, vegetables, and their own skin, and learn various methods in the process of studying the organisms they have cultured. The topics for the course include (a) survey types of microorganisms, including bacteria, fungi, protozoa, algae, and bacterial viruses, (b) types of methods used to culture and study these microorganisms, (c) some practical applications of microbiology such as microbiological analysis of wastewater, and identification of clinical isolates.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1900", "course_title": "BIOLOGICAL SCIENCES PEER ADVISING", "description": "Students in the Department of Biological Sciences will be trained as Peer Advisors who are able to share their experiences and offer appropriate advice on scheduling, studying, and extracurricular activities. Peer Advisors will meet with current and prospective BIOSC majors to help with course requirements, career preparation, and work-life balance while also helping to develop a stronger sense of community within our large department. Students must have permission from the Biological Sciences Advising Office to enroll. This course does not satisfy elective credits towards majors within the Department of Biological Sciences.", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1905", "course_title": "HONORS RESEARCH WRITING PRACTICUM", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "BIOSC", "id": "1907", "course_title": "RESEARCH DECONSTRUCTION: UNDER THE HOOD OF LIFE SCIENCES RESEARCH", "description": "This course takes an in depth look into how scientific research is done by studying where research is done, who does it, how questions are developed, how approaches and techniques are chosen, and how data is analyzed and presented. Students listen to a research seminar aimed at an expert audience, and then dissect the work throughout the semester. At the end of term, pieces from studying the research project are reassembled, a video of the seminar critiqued, and the course concludes with a Q+A session with the seminar speaker. The course is for students enrolled in the research certificate in biological and biomedical sciences.", "completed": false, "prereq_count": 1}], "links": [{"source": "0150", "target": "0160"}, {"source": "0160", "target": "0350"}, {"source": "0160", "target": "0370"}, {"source": "0160", "target": "1000"}, {"source": "0160", "target": "1120"}, {"source": "0160", "target": "1250"}, {"source": "0160", "target": "1470"}, {"source": "0160", "target": "1850"}, {"source": "0160", "target": "1907"}, {"source": "0350", "target": "0352"}, {"source": "0350", "target": "1010"}, {"source": "0350", "target": "1120"}, {"source": "0350", "target": "1130"}, {"source": "0350", "target": "1275"}, {"source": "0350", "target": "1285"}, {"source": "0350", "target": "1520"}, {"source": "0350", "target": "1730"}, {"source": "0350", "target": "1740"}, {"source": "0350", "target": "1760"}, {"source": "0370", "target": "1435"}, {"source": "0370", "target": "1440"}, {"source": "0370", "target": "1550"}, {"source": "1000", "target": "1730"}, {"source": "1130", "target": "1550"}, {"source": "1250", "target": "1455"}]}