{"nodes": [{"dept_code": "KOREAN", "id": "0002", "course_title": "FIRST YEAR KOREAN 2", "description": "At the end of the second term of the first year of study the student should be able to produce all the significant sound patterns of the language, to recognize and use the major grammatical structures within a limited core vocabulary. The student should be able a) to engage in simple conversations with native speakers about a limited number of everyday situations and b) to read and write simple material related to the situations presented.", "completed": false}, {"dept_code": "KOREAN", "id": "0004", "course_title": "SECOND YEAR KOREAN 2", "description": "At the end of the second term of the second year the student should be able to converse comfortably with a native speaker on a variety of non-specialized subjects. The student will be offered an opportunity to experience and more fully understand the culture of the people who use the language through readings of various types. More complex writing tasks will be expected at this level.", "completed": false}, {"dept_code": "KOREAN", "id": "0006", "course_title": "THIRD YEAR KOREAN 2", "description": "Students will build on previously learned material and learn increasingly complex grammar patterns and build more sophisticated vocabulary suitable for everyday interactions, and apply them in all language skill areas (speaking, listening, reading, and writing). By reading texts that focus on Korean society and history, students will learn some representative aspects of Korean culture. Approximately two hours per week to develop aural/oral skills using a communicative method.", "completed": false}, {"dept_code": "KOREAN", "id": "0007", "course_title": "INTRODUCTION TO KOREAN CULTURE AND CIVILIZATION", "description": "", "completed": false}, {"dept_code": "KOREAN", "id": "0010", "course_title": "SPECIAL TOPICS IN EAST ASIAN POP CULTURE", "description": "This 1-credit mini course explores the spread of Asian pop across the world in conjunction with the Asian Studies Center's annual lecture series on Asian pop culture.", "completed": false}, {"dept_code": "KOREAN", "id": "0075", "course_title": "INTRODUCTION TO KOREA THROUGH FILMS", "description": "Introduces Korean cinema to students in broader (and at times narrow) cultural, social, and aesthetic contexts to investigate transnational media production and circulation, globalization, consumer culture, commercialization, and construction of national, ethnic and gender identities. Through this course, students will learn more about specific issues pertaining to Korea and its people, as well as gain familiarity with some prominent film directors of Korea's. They will develop a critical and historical consciousness of Korean visual culture, assessing the worth and content of the films.", "completed": false}, {"dept_code": "KOREAN", "id": "1051", "course_title": "FOURTH YEAR KOREAN 2", "description": "Goals: advance students to greater strengths in reading and writing skills and socio-cultural knowledge of Korean beyond high intermediate level; develop skills in reading and listening to authentic materials; enhance speaking and writing skills to discuss issues of contemporary Korean society and culture; furthering aural comprehension of contemporary television documentaries, news and drama with decreased reliance on pedagogical aids. Course is student centered class and students will develop their knowledge of Korean lexicon (including Chinese characters of Sino-Korean) and grammar. Class will be conducted in Korean exclusively.", "completed": false}, {"dept_code": "KOREAN", "id": "1080", "course_title": "CONTEMPORARY KOREAN CULTURE", "description": "This course aims to help the students achieve in-depth understanding of major cultural developments in Korean society in the past two decades or so. To that end, this course is arranged around some questions intimately tied to recent changes in Korean society such as (re)construction and consumption of tradition, collective traumas and unfinished mourning, political activism in the postauthoritarian era, post-division imagination, the hallyu-new media nexus, sports-sexuality-nationalism, Korean cuisine, homogeneity to multiculturalism, queer Korea, Korean diaspora, and North Korea in transition. This course will examine these issues from various angles by engaging with a wide range of fields and diverse forms of texts such as literature, theater, music, cinema, TV show, new media, food, and sports. Thereby, this course seeks to help the students gain more competence in comparative and interdisciplinary analysis of our culture.", "completed": false}], "links": []}