{"nodes": [{"dept_code": "BUS", "id": "0020", "course_title": "YOUR CAREER SUCCESS", "description": "In this course, you will: learn and practice a variety of tools used in the exploration of career paths (e.g., StrengthsFinder, Skill Clusters, informational interviewing, job shadowing, etc.); Explore your skills, abilities, and preferred roles and environments; develop and implement a personal strategy for career goal setting and planning; learn the internship and job search processes; learn and practice communication tools necessary throughout the job application process (e.g., resume, cover letter, social media, networking, interviewing, and accepting job offers).", "completed": false, "prereq_count": 0}, {"dept_code": "BUS", "id": "1392", "course_title": "PERSONAL FINANCIAL PLANNING", "description": "This course deals with the basics of personal financial planning. Students will create personal financial plans based on projected horizons of 1, 3, and 5 years. The primary focus is on near term planning with emphasis on: initial savings, paying off student debt, judicious use of credit, and investing for short and long term goals. Students will prioritize and codify their plans based on personal, professional, and lifestyle objectives projected over the plans stated horizons.", "completed": false, "prereq_count": 0}, {"dept_code": "BUS", "id": "1904", "course_title": "CBA FULL-TIME CO-OP", "description": "CBA students who participate in a full-time career-developing internship experience as an integral part of their CBA academic program may register for this course. Students must have completed at least 60 credits, be in good academic standing, and plan to return to campus the first spring or fall term immediately following the internship term. Internships for this course are designated by the offering organization as full-time and lasting the duration of the term. Internship agreements specifying the academic work to be completed as part of the internship are required.", "completed": false, "prereq_count": 0}, {"dept_code": "BUS", "id": "1906", "course_title": "CAREER EXPLORATION INTERNSHIP", "description": "This internship course is designed to help students improve self-awareness of personal preferences with respect to career interests in the context of a work experience. Incorporates readings, self-assessment instruments and exercises, job analysis, journal entries and two performance appraisals. May be used for internships, summer jobs, part time jobs and full-time positions that involve work related to a possible career interest. The internship site may be located anywhere in the world.", "completed": false, "prereq_count": 0}], "links": []}