{"nodes": [{"dept_code": "ARC", "id": "0110", "course_title": "APPROACHES TO THE BUILT ENVIRONMENT", "description": "This foundational course for architectural studies majors seeks to acquaint students with contemporary ideas that affect our understanding of the built environment across the globe through a series of units dealing with different architectural issues and building types. The course engages in intensive reading of canonical texts in the field and current studies of issues shaping the built environment today.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "0114", "course_title": "ART AND ARCHITECTURE OF THE MUSLIM WORLD", "description": "This course examines the art and architecture of the Muslim world as it developed through centuries of adoption, adaptation, and innovation which emerged as Islam spread throughout Eurasia, and Muslim communities came into contact with other Muslim and non-Muslim societies. Focusing on a number of prominent sites, buildings, and art objects, this course introduces students to the plurality of traditions and artistic practices labeled as Islamic Art and Architecture. Furthermore, students will learn about various sources of influence that came from the center and peripheries of the Muslim world. Exploring these concepts will take the class on a journey through time and space: starting in the 7th-century from the birthplace of Islam in the Arabian Desert, we will move through a vast territory that expands from southern Spain to China, with a final stop in 21st-century Dubai. All along the way, buildings and art objects will serve as snapshots that open a window into the social, cultural, economic, and political life of these Muslim societies.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "0116", "course_title": "GLOBAL ARCHITECTURE 2: MODERN", "description": "Major social, political and cultural changes are reflected in ways humans build and shape their environments. Since the Industrial Revolution, the rapid transformation of regimes, the remaking of social classes, the development of new technologies and the emergence of new methods of production have marked a distinctive era of accelerating modernization that ushered in new ways of interacting in and with the world. In this course we will examine buildings and landscapes from about 1750 CE to the present, including the development of infrastructures for transportation, communication and energy production that transformed the ways people live and work, the ways products are made and distributed, the ways territories are planned and resources exploited. The emergence of modern nation-states in the 19th-century and decolonization in the 20th were accompanied by concepts of citizenship, human rights and political ideologies that required new types of buildings, cities and borders. Global organizations including colonial empires, world's fairs, sports associations, and the United Nations required buildings that project and shape identities while accommodating new publics. Countering the effects of relentless modernization, the development of museums, historic preservation and world heritage redefine sites and monuments and how we relate to past and remote cultures. The scale and violence of global wars and on-going regional conflicts necessitate temporary and improvised construction and redefined the idea and purpose of commemorative monuments. Through the lens of the built environment, the priorities, potentials, failures and novelties of the modern world emerge in all their awesome, terrible complexity.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "0180", "course_title": "WORLD CITIES", "description": "Cities have existed all over the world for millennia, and their inhabitants have used these urban conglomerations to connect themselves, their ideas, and their goods to a much wider audience - often well beyond their geographic and political boundaries. Cities have also been sites of dramatic demographic changes throughout human history, leading to productive contact as well as structural inequalities between diverse peoples. In this course, students will explore how cities all over the world and through time have grappled with the potentials and problems of a growing, diversifying, and increasingly interconnected world. We will pay particular attention to the cities' heterogeneous inhabitants, their built and natural environments, their interconnectivity, and their different and changing identities as \"world cities.\" Designed around guest lectures by faculty from the Department of History of Art and Architecture, this course will introduce students to a wide array of world cities. Weekly lectures will explore examples of cities across time and space, including Timbuktu, Mexico City, Beijing, Chicago, Istanbul, Cairo, Paris, and other sites; and through a variety of visual media, including architecture, public sculpture, photography, and film. Class sessions will be specifically devoted to comparing the ideas that formed these cities and how their identities and built environments have changed over time.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "0201", "course_title": "FOUNDATIONS STUDIO 1", "description": "The architectural studies seminar is intended to provide experience working on an advanced level with a specialized topic in architecture. In some years the seminar will deal with history or theory, in others with conceptual issues. For this offering it will focus on several particular problems in the development of Frank Lloyd wright's career in architecture.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "0210", "course_title": "SPECIAL TOPICS-ARCHITECTURE", "description": "Special topics in architecture. Course varies from term to term.", "completed": false, "prereq_count": 1}, {"dept_code": "ARC", "id": "0901", "course_title": "ARCHITECTURAL STUDIES PROSEMINAR 1", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1138", "course_title": "BLACK BUILT AMERICA: ARCHITECTURES OF BLACK RESISTANCE IN THE UNITED STATES", "description": "This course offers a critical history of the Black labor, creativity, craftsmanship, engineering, and activism that built the United States of America. It is undeniable that Black Americans and African Americans have been brutally marginalized by the instruments of systemic racism including segregation, redlining, eviction, and more recently gentrification. In this class, however, that very real and continuing history of oppression is studied as the fuel for the creative agency of Black individuals and communities. Appropriating, intervening, and shaping the built environment became one of the many forms of Black resistance to racism and systemic injustices. In doing so, Black hands and Black minds shaped the very fabric of America's landscape. Our class begins and ends in Washington DC, posing important questions about the hidden and overt symbols of Black heritage in the nation's capital.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1152", "course_title": "ROMAN ARCHITECTURE", "description": "The course will examine the development of Roman architecture from its origins in Etruria and Central Italy to the Middle Empire (ca. 150 AD). Special attention will be given to the relationship of architectural forms, types and functions to changes in Roman politics and society and the significance of materials and outside influences on the development of local Italian traditions and forms. The interaction between Roman architectural forms and local traditions in the provinces to create a Roman imperial \"Koine\" will be treated only in passing.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1201", "course_title": "ARCHITECTURE DESIGN STUDIO 1", "description": "At the core of every nationally accredited school of architecture is the design studio. The design studio integrates skills learned in other architecture courses in the production of a design project. This course prepares students for the rigor of the architectural design process and exposes them to the unique pedagogical experience of a design studio. This course is designed to give students who are majoring in architectural studies and who intend to pursue a professional degree in architecture at the graduate level exposure to a sophisticated conceptual framework for thinking about three-dimensional composition and architectural problem solving. The course is also intended to emphasize the necessity of excellent graphic skills and technical skills in model-making to communicating design ideas. This course is meant to serve as an intermediary step between the /architectural studies seminar/ (HAA 1913) and the studio arts requirements for the architectural studies major, and the more advanced architectural design work in HAA 1917.", "completed": false, "prereq_count": 1}, {"dept_code": "ARC", "id": "1203", "course_title": "DESIGN STUDIO 3", "description": "This course is designed to give students who are majoring in architectural studies and who intend to pursue a professional degree in architecture at the graduate level exposure to a sophisticated conceptual framework for thinking about three-dimensional composition and architectural problem solving known as /system-based design/. The course is also intended to emphasize the necessity of excellent graphic skills and technical skills in model-making to communicating design ideas. This course is meant to serve as a capstone for the architectural studies major.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1912", "course_title": "ARCHITECTURE AND DIGITAL MEDIA 2", "description": "The architecture, engineering, construction and operations industry has well documented inefficiencies stemming primarily from fragmentation in the project delivery process. At the same time, the industry faces significant challenges such as the demand to deliver projects more economically, the desire for more environmentally responsible projects, and the expectation of more predictability in performance -- all of which call for more integration and collaboration throughout a project's lifecycle. New technologies such as building information modeling (BIM) are revolutionizing architecture and construction, providing a platform that allows project information to be captured, structured and analyzed throughout the entire lifecycle of a project, enabling a more integrated, collaborative process that supports more informed decision making and higher levels of efficiency. In this course, students will learn the principles of BIM using Revit software.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1990", "course_title": "ARCHITECTURAL STUDIES INTERNSHIP", "description": "Academic credit is awarded for practical professional experience gained through a directed internship. The internship is arranged by the student through the university internship office in consultation with the director of architectural studies.", "completed": false, "prereq_count": 0}, {"dept_code": "ARC", "id": "1999", "course_title": "SENIOR THESIS", "description": "In this course a senior major in the history of art will research and write a research paper and present it as if for publication. The area and topic will be decided upon in consultation with a specific faculty member.", "completed": false, "prereq_count": 0}], "links": [{"source": "0201", "target": "0210"}, {"source": "0201", "target": "1201"}]}