{"nodes": [{"dept_code": "ASTRON", "id": "0086", "course_title": "OBSERVATIONAL ASTRONOMY", "description": "This course is for students who have a desire to become familiar with the nature and motions of celestial objects in the night sky and techniques to observe them. The course will be given at a level suitable for both science and non-science majors who want to learn how to use a telescope and enjoy observational and practical astronomy.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "0087", "course_title": "BASICS OF SPACE FLIGHT", "description": "Intended for non-science majors, this course focuses on identifying and understanding the general concepts associated with space flight.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "0088", "course_title": "STONEHENGE TO HUBBLE", "description": "A course focusing on practical astronomy and providing a historical perspective of our place in the universe. Phenomena that can be readily observed with the unaided eye or a small telescope are discussed. The historical perspective starts with the earliest views, and discusses scientific discovery as a process leading up to modern ideas of the expanding universe of galaxies.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "0089", "course_title": "STARS, GALAXIES AND THE COSMOS", "description": "This is a self-contained course for students not majoring in the physical sciences. The Universe in which we live is an unimaginably vast and rich place that is understandable through the same physical laws that govern our existence here on Earth. By exploring topics from our nearest neighboring stars to the farthest galaxies newly formed after the Big Bang, this course will engage your mind to better understand our Universe and your everyday world. Through active and engaged participatory lectures, we will observe the cosmos and learn about the birth, life, and death of stars and their mysterious remnants: pulsars and black holes. From studying stars and our own Milky Way Galaxy, we will expand our vision to cosmology and investigate the origin and ultimate fate of the Universe.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "0113", "course_title": "INTRODUCTION TO ASTROPHYSICS", "description": "An introduction to the physics of the solar system, stars, galaxies, extragalactic objects and the Universe at large. Topics include: size scales of the Universe, some review of basic physics, telescopes, the evolution and deaths of stars, the interstellar medium, star clusters, our Milky Way galaxy, external galaxy formation and evolution, active galactic nuclei and quasars, dark matter, dark energy, and cosmology. This course is intended for students majoring in the natural sciences. Although calculus is not used in this course, algebra and trigonometry are used extensively. Students who are not majoring in the natural sciences and/or who are not comfortable with algebra and trigonometry-based problem solving are advised to take ASTRON 0089. Although there are no formal physics prerequisites for ASTRON 0113, experience with at least high school physics is recommended.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "0413", "course_title": "HONORS INTRODUCTION TO ASTRONOMY", "description": "This course will be an introduction to astronomy and astrophysics. The 4-credit honors course will consists of all aspects of the 3-credit course, including lectures and homework with additional problems tailored for this course. ASTRON 0413 includes an additional 50-minute class session each week. In these extra sessions, basic topics will be covered in more detail than in ASTRON 0113. These extra sessions will also involve significant problem solving and discussions of the derivations of fundamental results in astronomy and astrophysics. Students considering a major in physics, astronomy, or physics and astronomy are strongly encouraged to take ASTRON 0413 instead of ASTRON 0113.", "completed": false, "prereq_count": 0}, {"dept_code": "ASTRON", "id": "1121", "course_title": "GALAXIES AND COSMOLOGY", "description": "Topics covered include: the milky way galaxy and its properties; external galaxies and their properties; evolution of galaxies; the expansion of the universe (Hubble Law) and the Extragalactic Distance Scale; Clustering of Galaxies; Dark Matter; Active Galaxies and Quasars (models with supermassive black holes); General Relativity, Cosmology, and the Big Bang Model; the Age and fate of the Universe; the History of the Early Universe (Inflation, Nucleosynthesis of Light Elements, 3 degree background radiation; the IgM and Galaxy Formation.", "completed": false, "prereq_count": 1}], "links": [{"source": "0113", "target": "1121"}]}