{"nodes": [{"dept_code": "ENGR", "id": "0012", "course_title": "INTRO TO ENGINEERING COMPUTING", "description": "In this course, we will learn basic programming skills using MATLAB and C. In addition, we will address teamwork and professional integrity, both important aspects of engineering. This is a team-based, hands-on course, in which most of our class time will be spent working in teams to develop programs, solve problems, and participate in discussions, using what we learn in the course.", "completed": false}, {"dept_code": "ENGR", "id": "0015", "course_title": "INTRODUCTION TO ENGINEERING ANALYSIS", "description": "This course will provide an introduction to Excel and an introduction to design and entrepreneurship. In addition, we will address teamwork and professional integrity, both important aspects of engineering. This is a team-based, hands-on course, in which most of our class time will be spent working in teams to solve problems and participate in discussions, using what we learn in the course.", "completed": false}, {"dept_code": "ENGR", "id": "0020", "course_title": "PROBABILITY AND STATISTICS FOR ENGINEERS 1", "description": "An introductory course in statistics. Topics covered include: data analysis, probability, random variables, selected discrete and continuous probability distributions, one sample and two sample estimation, hypothesis testing, experiments with two factors and introduction to regression analysis.", "completed": false}, {"dept_code": "ENGR", "id": "0022", "course_title": "MATERIALS STRUCTURE AND PROPERTIES", "description": "An introduction to the basic concepts of materials science and engineering. The concepts of atomic, crystal, micro- and macro-structure, their control and effects on chemical, electrical, magnetic, optical, and mechanical properties. Modification of properties by heat treatment and control of processing. Fundamental considerations in materials selection.", "completed": false}, {"dept_code": "ENGR", "id": "0082", "course_title": "FRESHMAN ENGINEERING SEMINAR 2", "description": "An in-depth orientation in the various areas of engineering and the related fields of employment. Includes small group meetings with departmental representatives and special freshman academic advisors. A formal departmental choice is made at the conclusion of these courses.", "completed": false}, {"dept_code": "ENGR", "id": "0087", "course_title": "TRANSFER SEMINAR", "description": "A 9 week seminar course for first semester regional and external engineering transfer students. The course discusses the transition to the Swanson School of Engineering and resources available to students at the University of Pittsburgh.", "completed": false}, {"dept_code": "ENGR", "id": "0090", "course_title": "SWANSON SUCCESS PROGRAM: A FRAMEWORK FOR ACADEMIC SUCCESS", "description": "The Swanson success class provides students with a series of academically-focused workshops critical to success within the Swanson School of Engineering and at the University of Pittsburgh. In this course, students will explore a variety of personal development topics including goal-setting, time prioritizing, motivation, and learning strategies. Students who invest the time and energy into this course, which is just one component of the student retention program, can expect to enhance their academic and personal efficiency as well as their performance in the classroom.", "completed": false}, {"dept_code": "ENGR", "id": "0135", "course_title": "STATICS & MECHC OF MATERIALS 1", "description": "First of a two course sequence covering statics and strength of materials. Topics covered include: concurrent force systems, equilibrium, axial loading, stress, strain, deformation, moments, equivalent systems, centroids, centers of mass, and distributed loads, free-body diagrams, equilibrium of rigid and deformable bodies, plane trusses, frames and machines, equilibrium in 3D, torsion and friction. Use is made of computers for problem solving.", "completed": false}, {"dept_code": "ENGR", "id": "0141", "course_title": "MECHANICS OF MATERIALS CIVIL AND ENVIRONMENTAL ENGINEERS", "description": "An introductory course in the mechanics of deformable bodies, with special application to the range of topics needed by civil engineers. The course material covers internal strains, stresses and deformations which occur when a structure is subjected to applied loads. Problems with tie-in to practical design issues will be covered.", "completed": false}, {"dept_code": "ENGR", "id": "0145", "course_title": "STATICS & MECHC OF MATERIALS 2", "description": "Second of a two course sequence covering statics and strength of materials. Topics include: flexure; second moment of areas, shear force and bending moment diagrams, composite beams, shearing stresses, beam deflections, energy methods, Castigliano's methods, moment area method, combined static loading and columns.", "completed": false}, {"dept_code": "ENGR", "id": "0501", "course_title": "MUSIC ENGINEERING LABORATORY", "description": "A course directed toward development of basic skills in recording engineering through expanded understanding of the science and engineering of music. The course will use the music engineering laboratory (MEL) located in Benedum hall. The MEL is a state of the art sound recording facility with research and educational capabilities for sound recording and music engineering. Students are expected to have prior musical experience, working knowledge of Fourier transforms, and working knowledge of basic electronics. Topics covered: recording engineering (microphones, amplifiers, and mixing, filtering, special effects). Physics, mathematics, and psychophysics of sound and music (acoustics, speech and singing, hearing, pitch, stereo perception). Musical instrument function (mechanical and electronic)", "completed": false}, {"dept_code": "ENGR", "id": "0712", "course_title": "ADVANCED ENGINEERING APPLICATIONS FOR FRESHMAN", "description": "This is an honors course and a continuation of ENGR 0711. Students will be introduced to engineering research and various special topics.", "completed": false}, {"dept_code": "ENGR", "id": "0716", "course_title": "ART OF HANDS-ON SYSTEM DESIGN AND ENGINEERING", "description": "Engineering is fundamentally a creative process in which ideas are generated and transformed into new systems and devices in the world to meet human needs. The term engineer shares its origins with ingenious: one definition of engineer is 'a skillful inventor.' In this course, we will explore tools and techniques for inventing, designing and prototyping systems. Through discussion, small-team activities, workshops and hands-on projects, students will obtain an introduction to design thinking, 'maker culture' and systems engineering. We will explore user-centric design principles; sketch modeling; basic building elements for systems such as sensors, computer controllers, actuators and displays; materials and methods for prototyping; and ways to analyze and troubleshoot systems. Students will gain an introduction to 'smart systems': automated systems that can sense the world and automatically respond in useful ways. We will also focus on the user interface: how to create control and display interfaces that enhance users' ability to operate systems effectively and efficiently.", "completed": false}, {"dept_code": "ENGR", "id": "1000", "course_title": "LAB EXPERIENCES", "description": "Provide opportunities to students to volunteer in a research lab to determine if undergraduate research is an area that the student would like to further engage in for course credits, for payment from a PI, or for summer research experience.", "completed": false}, {"dept_code": "ENGR", "id": "1050", "course_title": "PRODUCT REALIZATION", "description": "This interdisciplinary course will focus on product analysis, product redesign and product development. Student teams will work with industrial sponsors to develop product plans for emerging and existing products.", "completed": false}, {"dept_code": "ENGR", "id": "1060", "course_title": "SOCIAL ENTREPRENEURSHIP- ENGINEERING FOR HUMANITY", "description": "The course will explore the concepts of social entrepreneurship through the three tenets of sustainability: environment, economy, and equity in the context of complex or `wicked' problems. An introduction will provide a foundation in sustainability and social entrepreneurship while exploring the impact of innovative business models, such as disruptive innovation and Prahalad and Hart's fortune at the bottom of the pyramid. Additional class time will explore different examples and challenges in the developed and developing worlds. Through weekly readings, the course will focus on classroom discussions about the tenets of sustainability and the relevance of engineering in crafting `solutions'. The course project will provide students with an opportunity to work with a multi-disciplinary team to design an engineering-based business plan targeting a specific challenge either locally or in the developing world.", "completed": false}, {"dept_code": "ENGR", "id": "1062", "course_title": "START UP FUNDAMENTALS", "description": "This course is offered within the Swanson School of Engineering to undergraduate and graduate students. At the undergraduate level, the class is part of the new Certificate in Innovation, Product Design and Entrepreneurship. The class is designed to introduce the student to the core business concepts behind innovation and entrepreneurship. The class is highly interactive, and students will be required to participate in groups and individually. Grading is heavily weighted around participation in the group project which will be ongoing throughout the semester. The class is taught by Babs Carryer, Director of Education & Outreach, Innovation Institute at Pitt. Guest speakers, who are experts in their fields, will supplement the core teaching. Topics covered will include: ideation, problem/solution, market opportunity, competitive analysis, customer discovery, pitching, funding, finance, legal issues, team building, and innovation within existing companies.", "completed": false}, {"dept_code": "ENGR", "id": "1080", "course_title": "LEAN LAUNCHPAD: EVIDENCE-BASED ENTREPRENEURSHIP", "description": "Conventional wisdom regarding starting a business is dead wrong. This conclusion led Steve Blank and others to develop the lean startup method, an approach for systematically exploring the business model needed to make an idea into a success. In Blank's own words: 'existing companies execute a business model, startups search for one. This distinction shapes the lean definition of a startup: a temporary organization designed to search for a repeatable and scalable business model.' In this course, we discuss the basic elements of the lean startup method and apply them to the domain of engineering product and customer development. Students are expected to come to the class with their own idea(s) for potential product offering(s), which they will then test using the lean startup approach over the course of the term.", "completed": false}, {"dept_code": "ENGR", "id": "1090J", "course_title": "ENGINEERING COOPERATIVE PROGRAM - UPJ", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1090P", "course_title": "ENGINEERING COOPERATIVE PROGRAM - PITTSBURGH", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1091", "course_title": "SCHOOL OF ARTS AND SCIENCES COOPERATIVE EDUCATION", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1092", "course_title": "ENGRG INT'L COOPERATIVE PROGRAM", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1093", "course_title": "CMP SCI COOPERATIVE PROGRAM", "description": "", "completed": false}, {"dept_code": "ENGR", "id": "1098", "course_title": "INTERNATIONAL SENIOR DESIGN EXPERIENCE", "description": "This one credit course is focused on understanding globalization and technology with a particular emphasis on sustainability design and international experience. By the end of this course, students should understand the basic history, government, and economic strategies, related to their country; produce a final design that is the most cost-effective design possible, as funding for construction is limited and repairs in the future would be undertaken by members of the community; be able to define 'globalization' and 'sustainability' and identify how it is impacting their respective fields of study and future employment; gain awareness of differences in the business environments of the U.S. In relationship to the rest of the world.", "completed": false}, {"dept_code": "ENGR", "id": "1453", "course_title": "DATA SCIENCE: STATISTICAL LEARNING, MODELING & PREDICTION", "description": "In this course, we will use an open data science tool chain to develop reproducible data analyses useful for inference, modeling and prediction of the behavior of complex systems. In addition to the standard data cleaning, assembly and exploratory data analysis steps essential to all data analyses, we will identify statistically significant relationships from datasets derived from population samples, and infer the reliability of these findings. We will use regression methods to model a number of both real-world and lab-based systems producing predictive models applicable in comparable populations. We will assemble and explore real-world datasets, use pair-wise plots to explore correlations, perform clustering, self-similarity, and logistic regression develop both fixed-effect and mixed-effect predictive models. We will introduce machine-learning approaches for classification and tree-based methods. Results will be interpreted, visualized and discussed. We will introduce the basic elements of data science and analytics using R Project open source software. R is an open-source software project with broad abilities to access machine-readable open-data resources, data cleaning and assembly functions, and a rich selection of statistical packages, used for data analytics, model development, prediction, inference and clustering. With this background, it becomes possible to start performing variable transformations for linear regression fitting and developing structural equation models, fixed-effects and mixed-effects models along with other statistical learning techniques, while exploring for statistically significant relationships. The class will be structured to have a balance of theory and practice. We'll split class into Foundation and Practicum a) Foundation: lectures, presentations, discussion b) Practicum: coding, demonstrations and hands-on data science work.", "completed": false}, {"dept_code": "ENGR", "id": "1601", "course_title": "INTERNATIONAL TECHNOLOGY: INNOVATION AND LEADERSHIP (NON-PITT)", "description": "Globalization and innovation will be studied with a particular emphasis on china in conjunction with the Innovate 2012 conference. As such the course provides both the preparation for the conference and the post-conference synthesis of what was learned during the conference. The course will be jointly taught by university of Pittsburgh and rice university faculty exclusively for those students who will be delegates to the innovate conference. Guest lecturers will be invited from the two participating universities who will discuss the history, government, religion, business climate and culture of china. This course requires participation in the Innovate 2012 symposium that will visit Beijing, Suzhou, and Shanghai China from March 1- 11.", "completed": false}, {"dept_code": "ENGR", "id": "1627", "course_title": "CHINA TODAY: INDUSTRY, INNOVATION, EDUCATION", "description": "This short course will educate students on the impact of modern china on engineering solutions in a global and societal context, improve student's knowledge of contemporary issues relating to the engineering and business profession. At the end of the course, students will have a general understanding of the corporate, geo-political, cultural and social factors that define the Chinese landscape at the present time. An in-depth paper exploring one of these factors will be required. This short course will explore how these three factors interact in china and in the perceived position of china as a world economy.", "completed": false}, {"dept_code": "ENGR", "id": "1701", "course_title": "FUNDAMENTALS OF NUCLEAR REACTORS", "description": "Nuclear physics, fission and fusion; cross-sections; neutron flux and slowing-down; diffusion and transport; criticality condition and calculations; reactor kinetics and shielding; heat generation, transfer and cooling; reactor materials; reactor structure.", "completed": false}, {"dept_code": "ENGR", "id": "1907", "course_title": "SUSTAINABILITY CAPSTONE", "description": "Building upon students' previous experience and skills, this course will focus on enabling interdisciplinary student teams to synthesize comprehensive solutions to complex real-world Sustainability challenges. This is a project-based course. Project topics will be developed in consultation with instructors and sustainability stakeholders. Innovative solutions will require the application of critical thinking and collaboration to resolve. By the end of the course the students will have a deeper understanding of 1) the multi-faceted nature of Sustainability solutions 2) approaches to problem solving across fields and 3) how to communicate sustainable solutions and concepts in an interdisciplinary team environment.", "completed": false}, {"dept_code": "ENGR", "id": "1933", "course_title": "SCIENCE, TECHNOLOGY, & CULTURE OF CRAFT BREWING", "description": "This course will introduce students to the science of brewing and technology needed to design and operate a craft brewery. Students will learn and apply biology, chemistry, and foundational engineering concepts and equipment needed to convert grain, water, yeast, and hops into craft beer. Students will also develop product analysis and product design skills to justify brewing choices based upon brewing science, technology, economic, and cultural considerations. Judging craft beer quality is a sensory experience that draws upon technical, cultural, and geographic aspects of each beer style; different styles will be highlighted throughout the course. Student must be 21 years of age with government-issued photo ID by the first day of class in the term taken.", "completed": false}], "links": [{"source": "0012", "target": "0082"}, {"source": "0135", "target": "0145"}]}