{"nodes": [{"dept_code": "THEA", "id": "0115", "course_title": "THE ALEXANDER TECHNIQUE", "description": "", "completed": false}, {"dept_code": "THEA", "id": "0505", "course_title": "ENJOY PERFORMANCES", "description": "We are always and everywhere performing. We produce plays and inhabit other places and times. We participate in religious rituals. We occupy public and virtual spaces to protest political injustice. We invest significant time, labor, and energy in managing our social identities. And when we work, if we work, we receive performance reviews. This course engages performance as lens for exploring embodiment, representation, identity, and history. Drawing upon the breadth and depth of performance studies as an interdisciplinary field of inquiry over the past half-century, this course will introduce students to performance as both a subject and method of humanistic inquiry. Through lectures, discussions, and performance analysis exercises we will explore what a performance studies perspective enables us to understand anew.", "completed": false}, {"dept_code": "THEA", "id": "0810", "course_title": "INTRODUCTION TO DRAMATIC ART", "description": "This course focuses on script analysis (the examination of how a dramatic text is put together). Exploring a diverse range of dramatic forms spanning histories and geographies, we will study how a play and its structural characteristics offer possible meaning on the page and on the stage. What different analytical tools help us interpret a play text or production? How does a play's dramatic structure and historical circumstances inform its visualization and staging in a specific time and space for an intended audience? The course will evaluate written texts as well as live performances.", "completed": false}, {"dept_code": "THEA", "id": "0830", "course_title": "INTRODUCTION TO PERFORMANCE", "description": "This course is designed to develop the students' awareness of the actor's process and to foster a general sense of theatre as an area of human endeavor. Students will be introduced to basic communication skills, including physical and vocal presence in front of an audience. The course will also develop an introductory level of acting skill through the use of regular warm-ups, theater games, improvisation, and simple scene study. The class will culminate in the performance of a final scene. Scenes will be selected from a diverse range of playwrights and students will examine the political, cultural and social context of each play. The course will also provide an introduction to basic theater terminology, and foster the ability to respond to and reflect on theatrical performances. Each student is required to buy a semester pass and attend university theatre productions.", "completed": false}, {"dept_code": "THEA", "id": "0840", "course_title": "INTRODUCTION TO THEATRE DESIGN", "description": "This course is an introduction to the design of scenery, costumes and lights used in theatre. Class work consists of several design projects focusing on design development, drawing and rendering, and drafting. This course will create an awareness of the role of the designer within the scope of the total collaborative process of theatre production. Students may be required to purchase a semester pass and attend university theatre productions.", "completed": false}, {"dept_code": "THEA", "id": "0842", "course_title": "INTRODUCTION TO STAGECRAFT", "description": "This is a production-oriented course involving the study and application of the process and skills utilized in the realization of theatrical scenery, props, and lighting. This includes standard scenic construction techniques, materials and equipment of the scene shop, an introduction to scenic painting, drafting, properties design and construction, and basic lighting practices. An introduction to basic lighting equipment and stage electrics will also be addressed. This will be emphasized through experience working in the scene shop, on stage, and on department running crews. 45 Hours of work in one of these areas is required for the course.", "completed": false}, {"dept_code": "THEA", "id": "0880", "course_title": "THEATRICAL PRODUCTION", "description": "A practical application course which gives the student hands-on experience in university theatre productions in one or more of the following areas: scenery/props, costume, lighting, sound, and/or stage management. The goal is to expand the student's knowledge and understanding of production processes through team participation in the presenting of a full production. A student must complete at least 45 hours of work in an assigned area to receive 1 credit. Students must usher for 2 performances during the semester enrolled. Note: this course is offered by appointment.", "completed": false}, {"dept_code": "THEA", "id": "1101", "course_title": "VOICE AND MOVEMENT 2", "description": "This course will build on the practices introduced in Voice & Movement 1 including presence, healthy and expressive vocal use, and effective communication. It will introduce the international phonetic alphabet, accents and dialects. Methods of accent and dialect acquisition will include vocal viewpoints, imagery, phonetics, and physical exercises. Students will research dialects and accents using such sources as: the international dialects of English archive, the visual accent archive, audio and visual recordings. Research and techniques will then be expressed through performances of monologues, scenes and poetry. This course culminates with each student's creation and development of a solo dialect performance.", "completed": false}, {"dept_code": "THEA", "id": "1102", "course_title": "ACTING 1", "description": "This course is designed to build foundational acting skills using Stanislavski-based exercises such as those devised by Sanford Meisner, Stella Adler and/or Uta Hagen. These exercises aim to develop the actor's ability to listen and respond truthfully in the moment, be present and connect, work with spontaneity, build concentration, and incite the imagination. Students will learn to craft behavior by working on contemporary text and engaging in improvisational exercises with partners as well as a series of solo projects. Students will also explore given circumstances and actions/objectives while working on audition techniques with a monologue. Students will then apply textual analysis skills and build rehearsal technique by bringing him/her-self to life in a role in a scene. This course is a building block and prerequisite for other performance courses in the theatre department. Students interested in the Theater major or minor or who have theatre experience are encouraged to audition into this course (in lieu of Introduction to Performance).", "completed": false}, {"dept_code": "THEA", "id": "1104", "course_title": "ACTING 3", "description": "This course focuses on preparing and presenting roles from classical plays. Using heightened text from diverse textual sources including ancient and modern plays and poetry, students will explore language as it applies to character and intention. Actors will build on their foundational acting craft with advanced vocal and physical acting exercises to enhance character, will develop textual analysis and rehearsal skills, and will apply those techniques to performing scenes (ancient Greek playwrights, Elizabethan playwrights and other lyrical writers). Students will perform three scenes from various historical periods, at least one of which will be from a Shakespearean text. In addition, students will examine the political, cultural and social context of each play.", "completed": false}, {"dept_code": "THEA", "id": "1110", "course_title": "DIRECTING 1", "description": "This course intends to discover, explore, and develop the directorial crafts of the student/director. It addresses the theoretical, analytical, and practical skills requisite to the craft of directing plays for the theatre. Plays of the realistic style will be its primary focus, although some discussion may range over other styles and periods in order to provide the proper context for approaching realistic plays. The student's directing ability will be developed through class discussion and exercises, written assignments, outside reading, and the direction of scenes from realistic plays. Students will learn methods to analyze plot, character and theme in scripts as well as techniques to translate that analysis into clear, vivid stage action.", "completed": false}, {"dept_code": "THEA", "id": "1230", "course_title": "STAGE LIGHTING 1", "description": "An introduction to Stage Lighting including awareness of light, instrumentation, color theory, texture, control, basic theatrical electricity and artistic design, with an emphasis on the organization of theatrical lighting. This course will reflect the study of lighting as an art form, including design concepts, light plots, artistic elements of theatre, sequential cue relationships, and script analysis.", "completed": false}, {"dept_code": "THEA", "id": "1240", "course_title": "COSTUME PRODUCTION AND TECHNOLOGY", "description": "This course is a production-oriented studio course involving the processes and skills utilized in the realization of theatrical costumes. The student will develop an understanding of the costume production process in addition to acquiring the skills necessary in the aid of the construction and completion of theatrical costumes. The student will learn basic hand sewn stitches and fasteners, proper use and operation of the sewing machinery. The student will also learn basic functions of the personnel in the costume shop, health and safety, fabric and textiles, draping, commercial and drafted patterning and costume finishing. Lectures, demonstrations and projects will supplement work done in class. Practical experience is obtained through lab hours which are obtained by working outside of class time in the costume shop on departmental theatre productions (30 hours) or get involved backstage on the wardrobe run crew. These experiences provide the students opportunities to practice skills learned in the classroom.", "completed": false}, {"dept_code": "THEA", "id": "1338", "course_title": "MUSICAL THEATRE PERFORMANCE", "description": "This course is designed to introduce students to the foundational elements of the musical theatre performer's process and to examine the use of song in a theatrical context as a mode of human expression. Students will be introduced to the fundamentals of vocal structure and technique as well as physical and vocal presence in front of an audience within the context of specific genres/ style periods of musical theatre. Fundamental acting techniques will be developed in the context of musical theatre practice through the use of regular warm-ups, theater games, improvisation, and study of song texts. Each of the three main units of the course, ensembles, duets and solo songs, will culminate in a public performance of the pieces studied in class. Standard professional practices for musical preparation and auditions will also be addressed and will include a mock audition process at the end of the term. Students will be required to attend a full production of a musical and will develop critical analytical skill through written reflection on that production as well as on their own development throughout the term.", "completed": false}, {"dept_code": "THEA", "id": "1342", "course_title": "WORLD THEATRE: 1640 TO 1890", "description": "This course is the second in a world theatre history sequence designed to explore the development of dramatic forms and theatre practices from the 5th century B.C.E. to the present. In World Theatre: 1640 to 1890 we will discuss the history of theatre arts 'which includes looking at drama, design, performance traditions and audiences--from the comedies of Restoration England to emerging realism of Buchner, Zola and Ibsen. Framed by questions of documentary interpretation and historical causation, the course will analyze the larger contexts of theatrical events, including social and political history, as well as the development of non-theatrical art forms. In addition, we will discuss some contemporary scholarship examining these theatrical events.", "completed": false}, {"dept_code": "THEA", "id": "1365", "course_title": "PLAYWRITING 1", "description": "This is a beginning course in the craft of playwriting. Students will read eight outside plays, will write seven scripts--the last of which is a one-act--and will critique, read aloud, and discuss the work of others in the class. Seminar/workshop style. Attendance is mandatory. Recommended: two courses from among the following three areas performance, dramatic literature, creative writing.", "completed": false}, {"dept_code": "THEA", "id": "1391", "course_title": "SPECIAL TOPICS: THEATRE DESIGN", "description": "This course covers a specialized topic in Theatre Arts. Topics vary every semester. Current course descriptions can be found in the notes section.", "completed": false}, {"dept_code": "THEA", "id": "1392", "course_title": "SPECIAL TOPICS IN PERFORMANCE", "description": "This course covers a specialized topic in Theatre Arts. Topics vary every semester. Current course descriptions can be found in the notes section.", "completed": false}], "links": [{"source": "0830", "target": "1102"}, {"source": "0830", "target": "1110"}, {"source": "1102", "target": "1104"}]}