{"nodes": [{"dept_code": "CHEM", "id": "0100", "course_title": "INTRODUCTION TO GENERAL CHEMISTRY", "description": "This non-lab, 3-credit course develops fundamental concepts, basic calculations, and problem-solving skills in General Chemistry. This course is designed for those who seek to gain knowledge and ability as a foundation to subsequently taking General Chemistry 1, or those students desiring to fill a Natural Science GER with a Chemistry experience without plans of taking additional Chemistry courses. Topics typically introduced include Measurement, Matter, Energy, Atoms, Elements, Molecules, Chemical Composition, Chemical Reactions, Stoichiometry, Periodic Properties of the Elements, and Bonding. A background in chemistry is not necessary while a fundamental knowledge of math is required and facility with basic algebraic concepts is recommended. Students concerned about their ultimate success in Chem 0110 are encouraged to talk to their advisor about the benefits of completing the Introduction to Chemistry course prior to enrolling in General Chemistry I.", "completed": false}, {"dept_code": "CHEM", "id": "0110", "course_title": "GENERAL CHEMISTRY 1", "description": "Chemistry 0110 and 0120 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize applications to industrial and environmental chemistry and biochemistry. CHEM 0110 covers stoichiometry, the properties of solids, liquids and gases, thermochemistry and the electronic structure of atoms and molecules.", "completed": false}, {"dept_code": "CHEM", "id": "0120", "course_title": "GENERAL CHEMISTRY 2", "description": "Chemistry 0110 and 0120 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize applications to industrial and environmental chemistry and biochemistry. CHEM 0110 covers stoichiometry, the properties of solids, liquids and gases, thermochemistry and the electronic structure of atoms and molecules.", "completed": false}, {"dept_code": "CHEM", "id": "0250", "course_title": "INTRODUCTION TO ANALYTICAL CHEMISTRY", "description": "This course is concerned with the rigorous treatment of equilibria that are of analytical importance and with an introduction into electroanalytical methods, emission and absorption spectrophotometry, and modern separation methods, particularly chromatography.", "completed": false}, {"dept_code": "CHEM", "id": "0260", "course_title": "INTRODUCTION TO ANALYTICAL CHEMISTRY LAB", "description": "The primary objectives of this course are to introduce the student to current analytical methods and to cultivate sound experimental technique. Laboratory work includes ion exchange separations, complexometric and potentiometric acid-base titrations, and absorption spectrophotometry.", "completed": false}, {"dept_code": "CHEM", "id": "0310", "course_title": "ORGANIC CHEMISTRY 1", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0320", "course_title": "ORGANIC CHEMISTRY 2", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0330", "course_title": "ORGANIC CHEMISTRY LABORATORY 1", "description": "Chemistry 0330 is devoted to the purification, characterization, and identification of organic molecules using the techniques of recrystallization, distillation, thin-layer, column and gas-liquid chromatography, melting point determination, and infrared and nuclear magnetic resonance spectroscopy.", "completed": false}, {"dept_code": "CHEM", "id": "0345", "course_title": "ORGANIC LABORATORY", "description": "This single semester two-credit Organic Laboratory course will provide an introduction to modern organic laboratory techniques used routinely in both industry and academics. The lab will emphasize practical applications of the reactions covered in the Organic 1 and Organic 2 lectures. The goals of the course are to provide students with practical experience in executing and analyzing organic transformations as well as practical experience in modern laboratory techniques.", "completed": false}, {"dept_code": "CHEM", "id": "0410", "course_title": "GENERAL CHEMISTRY 1", "description": "See chemistry 0110. This course is for students who need to take lecture without lab.", "completed": false}, {"dept_code": "CHEM", "id": "0420", "course_title": "GENERAL CHEMISTRY 2", "description": "See chemistry 0120. This course is for students who must take lecture without lab.", "completed": false}, {"dept_code": "CHEM", "id": "0430", "course_title": "GENERAL CHEMISTRY 1 LABORATORY", "description": "Laboratory that accompanies CHEM 0110.", "completed": false}, {"dept_code": "CHEM", "id": "0440", "course_title": "GENERAL CHEMISTRY 2 LABORATORY", "description": "Laboratory that accompanies chemistry 0120.", "completed": false}, {"dept_code": "CHEM", "id": "0720", "course_title": "UHC GENERAL CHEMISTRY 2", "description": "Chemistry 0710 and 0720 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize the fundamental principles of chemistry as exemplified by applications to industrial and environmental chemistry. CHEM 0720 covers the properties of solids, liquids and gases, chemical dynamics and chemical kinetics.", "completed": false}, {"dept_code": "CHEM", "id": "0740", "course_title": "UHC ORGANIC CHEMISTRY 2", "description": "An introduction to theory and practice of organic chemistry through study of structural principles, reaction mechanisms, and synthesis leading toward end of second term, when complex molecules of biological interest are discussed. Basic goals of course are to develop appreciation and skill in methods of molecular analysis which have made organic chemistry such a powerful intellectual discipline. Course will prepare student for work in advanced topics of organic chemistry, biochemistry, chemical engineering and health related sciences.", "completed": false}, {"dept_code": "CHEM", "id": "0745", "course_title": "ORGANIC LABORATORY: ANTIBIOTIC DISCOVERY", "description": "This two-credit CURE Organic Chemistry Laboratory Course (CHEM 0745) meets the same requirements as the Organic Chemistry Laboratory Course (CHEM 0345). It also serves as an independent research experience. One major goal of this course is to offer undergraduate students an opportunity to perform authentic scientific research in the laboratory course. This course engages students in learning approaches towards antibiotic discovery in order to address the world¿s current antibiotic crisis. Throughout the semester, students develop strategies for antibiotic compounds isolation and purification using chemical separation techniques, and then characterize these unknown antibiotics using spectroscopic techniques commonly used in organic chemistry.", "completed": false}, {"dept_code": "CHEM", "id": "0755", "course_title": "ORGANIC CHEMISTRY LAB: RESEARCH EXPLORATION", "description": "In this course students will work in teams to write original research proposals. They will then design and carry out appropriate experiments, collect and interpret data and ultimately report results in both oral and written formats.", "completed": false}, {"dept_code": "CHEM", "id": "0780", "course_title": "UHC GENERAL CHEMISTRY FOR ENGINEERS 2", "description": "Chemistry 0710 and 0780 comprise a two-term introduction to the fundamental properties of matter. The courses emphasize the fundamental principles of chemistry as exemplified by applications to industrial and environmental chemistry. CHEM 0780 covers the properties of solids, liquids and gases, chemical dynamics and chemical kinetics.", "completed": false}, {"dept_code": "CHEM", "id": "0910", "course_title": "CHEMICAL PRINCPL HEALTH PROFESSN", "description": "This is a one term course covering general and biological chemistry designed primarily for students enrolled in the school of nursing or preparing for health related professions. The course covers aspects of general chemistry including atomic structure and bonding and equilibria. A brief introduction to organic chemistry including physical properties and representative reactions of common functional groups and finally the chemistry of the major classes biomolecules and metabolism.", "completed": false}, {"dept_code": "CHEM", "id": "0970", "course_title": "GENERAL CHEM FOR ENGINEERS 2", "description": "Essentially the same as CHEM 0120, but a total of 3 credits only. Has lab, but only two lectures per week in contrast to CHEM 0120, which has 3. Enrollment limited to school of engineering.", "completed": false}, {"dept_code": "CHEM", "id": "1000", "course_title": "MATHEMATICS FOR CHEMISTRY", "description": "", "completed": false}, {"dept_code": "CHEM", "id": "1130", "course_title": "INORGANIC CHEMISTRY", "description": "Modern bonding theories are developed to the level that permits some understanding of the effects of structure and bonding on chemical properties. Periodic relationships are discussed and applied to selected families of elements. Emphasis is placed on those aspects of structure, bonding and periodic relationships that are helpful in unifying a large body of chemical knowledge. Selected topics of current interest in inorganic chemistry are discussed.", "completed": false}, {"dept_code": "CHEM", "id": "1140", "course_title": "ADVANCED INORGANIC LABORATORY", "description": "Introduces practical techniques for the synthesis and characterization of inorganic and organometallic complexes and materials. Special emphasis on the preparation and characterization of air- and water-sensitive compounds.", "completed": false}, {"dept_code": "CHEM", "id": "1250", "course_title": "INSTRUMENTAL ANALYSIS", "description": "The basic principles and instrumentation of important methods and their application to analysis and research problems. The coverage includes spectroscopic and electrochemical methods and chromatography. Equilibrium and dynamic aspects of each are considered.", "completed": false}, {"dept_code": "CHEM", "id": "1255", "course_title": "INSTRUMENTAL ANALYSIS LAB", "description": "The laboratory component of CHEM 1250. Students will be introduced to state of the art instrumentation being used in contemporary analytical chemistry.", "completed": false}, {"dept_code": "CHEM", "id": "1380", "course_title": "TECHNIQUES OF ORGANIC RESEARCH", "description": "A course which serves as a guide to the interpretation of ultraviolet, infrared, nuclear magnetic resonance and mass spectra of organic compounds.", "completed": false}, {"dept_code": "CHEM", "id": "1410", "course_title": "PHYSICAL CHEMISTRY 1", "description": "Basic lecture course dealing with quantum theory, atomic and molecular structure, symmetry, spectroscopy and diffraction methods.", "completed": false}, {"dept_code": "CHEM", "id": "1420", "course_title": "PHYSICAL CHEMISTRY 2", "description": "Basic lecture course dealing with gases, kinetic theory, chemical thermodynamics, equilibria, and chemical kinetics.", "completed": false}, {"dept_code": "CHEM", "id": "1430", "course_title": "PHYSICAL CHEMISTRY LABORATORY 1", "description": "Approximately 8 experiments are performed during the term. Experiments are selected to illustrate important principles of physical chemistry and to make the student familiar with important experimental methods. The course is intended to make the student think critically about reliability of experimental results and to attempt to interpret them in the light of his previous chemical experience.", "completed": false}, {"dept_code": "CHEM", "id": "1431", "course_title": "TOPICS IN PHYSCL CHEM WRIT PRAC", "description": "This course provides an opportunity for students to explore a current physical chemistry research topic and create a \"journal ready\" manuscript. The research topic will be chosen during the first two weeks of classes in consultation with the professor. A comprehensive outline and first draft will be prepared then reviewed with the professor. The paper is revised at least once before final submission and is a minimum of 15 pages. Conferences will be by appointment.", "completed": false}, {"dept_code": "CHEM", "id": "1440", "course_title": "PHYSICAL CHEMISTRY LABORATORY 2", "description": "This course has one four hour lab each week. Approximately 7 experiments are performed during the term, with an emphasis on the macroscopic properties of matter. The course is designed to expand upon the principles and techniques covered in Chem 1430 as well as to introduce the student to other scientific methods for investigating properties of materials. There is a lab fee.", "completed": false}, {"dept_code": "CHEM", "id": "1480", "course_title": "INTERMEDIATE PHYSICAL CHEMISTRY", "description": "A lecture course emphasizing application of principles of thermodynamics to solutions of electrolytes and non-electrolytes, electrochemical cells, physical chemistry of surfaces and macromolecules.", "completed": false}, {"dept_code": "CHEM", "id": "1600", "course_title": "SYNTHESIS & CHARCTRZTN POLYMERS", "description": "Synthesis and characterization of polymers is focus of course. Current methods of polymer synthesis will be surveyed, practical implementation of reactions and kinetic consequences of reaction strategies in homopolymer, copolymer and block copolymer synthesis. Techniques for characterization of polymer molecular weight, chemical composition, and stereochemistry (Ft-IR, NMR, other spectroscopic and chemical methods) will be discussed. Brief treatment of polymer solution thermodynamics and selected topics in polymer chemistry will be discussed.", "completed": false}, {"dept_code": "CHEM", "id": "1605", "course_title": "SYNTH & CHARCTRZTN POLYMERS LAB", "description": "This course is the laboratory component of CHEM 1600. Students will gain practical experience in the synthesis of polymers and the use of modern techniques used in the characterization of the polymers they synthesize.", "completed": false}, {"dept_code": "CHEM", "id": "1700", "course_title": "UNDERGRADUATE RESEARCH SEMINAR", "description": "Seminar given by faculty on undergraduate research opportunities in chemistry. Open to all students regardless of departmental affiliation, but is designed especially to help those students who may take chemistry 1710 in their selection of a research project.", "completed": false}, {"dept_code": "CHEM", "id": "1701", "course_title": "UNDERGRAD RES SEMINAR WRIT PRAC", "description": "This course, in conjunction with chemistry 1700, will allow students to write a major research paper based on a seminar given by a departmental faculty member. Extensive library work will be required. At lEast one revision of the paper will also be expected. This course will fulfill the CAS Departmental Writing requirement.", "completed": false}, {"dept_code": "CHEM", "id": "1711", "course_title": "UNDGR RESEARCH WRITING PRACTICUM", "description": "Chem 1711 will require the student to write a report in the form of a major research paper and will include a historical background to the project, an experimental or methods sections and a discussion of the results and their meaning.", "completed": false}, {"dept_code": "CHEM", "id": "1810", "course_title": "CHEMICAL BIOLOGY", "description": "Revolutionary transformations in chemistry and biology have led to the merging of these disciplines where contributions from both fields impact our molecular and quantitative understanding of biology. Rapid growth in this area has been driven in part by students and researchers applying synthesis, quantitative analysis, and theoretical reasoning to the study complex cellular processes. This course focuses on enzyme mechanisms in biological pathways, kinetics and thermodynamics, and chemical tools to probe and screen components of the cell. Some other topics include DNA/RNA processing, macromolecular interactions, chemical signaling, posttranslational modifications, chemical syntheses of biomolecules, and development of assays for high throughput drug screening.", "completed": false}], "links": [{"source": "0110", "target": "0120"}, {"source": "0110", "target": "0720"}, {"source": "0110", "target": "0780"}, {"source": "0110", "target": "0970"}, {"source": "0120", "target": "0250"}, {"source": "0120", "target": "0310"}, {"source": "0120", "target": "1410"}, {"source": "0120", "target": "1480"}, {"source": "0250", "target": "0260"}, {"source": "0250", "target": "1250"}, {"source": "0260", "target": "1255"}, {"source": "0310", "target": "0320"}, {"source": "0310", "target": "0330"}, {"source": "0310", "target": "0345"}, {"source": "0310", "target": "0740"}, {"source": "0310", "target": "0745"}, {"source": "0320", "target": "1380"}, {"source": "0320", "target": "1600"}, {"source": "0320", "target": "1605"}, {"source": "0320", "target": "1810"}, {"source": "0410", "target": "0720"}, {"source": "0410", "target": "0780"}, {"source": "1000", "target": "1410"}, {"source": "1130", "target": "1140"}, {"source": "1410", "target": "1420"}, {"source": "1420", "target": "1440"}, {"source": "1480", "target": "1600"}]}