{"nodes": [{"dept_code": "SLAV", "id": "0660", "course_title": "SCI-FI: EAST AND WEST", "description": "This course compares Slavic and Anglophone science fiction to assess how a given culture's dominant values are articulated in a popular genre that enjoys different status in East and West. Those values emerge in works that imaginatively posit \"fantastic\" situations rooted in biological, spatial, and temporal explorations beyond those verified by science. On the basis of films, film clips, TV shows, stories, novellas, and novels we shall discuss such topics as utopia, progress, human perfectibility, the limits of science, and the nature of knowledge.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "0880", "course_title": "VAMPIRE: BLOOD AND EMPIRE", "description": "This course examines the phenomenon of vampirism in verbal and visual texts from different time periods in various cultures (Russia, Poland, France, England, America). We will analyze stories, novels, and films focusing on vampires from a variety of critical perspectives, contextualizing the works in the cultures that produced them.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "1050", "course_title": "COMPUTATIONAL METHODS IN HUMANITIES", "description": "This course introduces students to the use of computational modeling and programming to conduct text-based research in the humanities. Course goals include 1) learning how to identify research questions in the humanities that are amenable to computational analysis and processing and 2) designing and implementing xml-based computational systems to explore those questions. No prior programming experience or knowledge of foreign languages required.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "1135", "course_title": "ORTHODOX CHRISTIANITY", "description": "This course is designed as an overview of the history, teachings and rituals of Eastern Orthodox Christianity in its multinational context. Geographically, this context refers primarily to southeastern Europe, Russia and the coastal areas of the eastern Mediterranean, but there is also a significant Orthodox diaspora in the western hemisphere and in other parts of the world. We shall examine specific historical experience of Orthodox Christians in its Byzantine context, under Ottoman rule, in the Russian Empire, under communism, and beyond. We consider the broader context of Eastern Christianity (including Oriental Orthodoxy, the Church of the East, and Eastern Catholicism), as well as relations with Western Catholic and Protestant Christianity, and other religions and systems of belief (e.g., Judaism, Islam, atheism). Through lectures, readings, discussions, films, and a field trip to a local Orthodox church, students will gain an insight into multifaceted world of Orthodox Christianity: its spiritual practices, rich artistic, musical and ritual expressions.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "1225", "course_title": "BEHIND BARS: CROSS CULTURAL REPRESENTATIONS OF PRISON IN THE 20TH CENTURY", "description": "This course examines cultural works produced in and about prison in the 20th century, addressing the function of art within the context of incarceration. In structure the course is composed of three parts: prison writings and criminal culture in America, memoirs from the forced-labor camps of the soviet gulag, and narratives of holocaust concentration camps. This structure allows for a comparison of cultures-- American, Russian, and European--as well as identities-- racial, gender, and religious.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "1320", "course_title": "PITTSBURGH, DIASPORA, MIGRATION: SLAVIC & EAST EUROPEAN COMMUNITIES", "description": "This course provides an overview of the diverse experiences of migration to Pittsburgh from Eastern and Central Europe, extending from the early twentieth century through the current moment. An interdisciplinary selection of readings is supplemented by opportunities for extensive fieldwork in English and in a range of relevant languages throughout western Pennsylvania, as well as in Eastern and Central Europe (the latter via electronic means during the semester, and through possible study abroad in the summer). Focused both on Pittsburgh and on Eastern and Central Europe in the twentieth and twenty-first centuries, the course surveys the experiences of the following communities in and near Pittsburgh: Bosnian, Croatian, Czech, Hungarian, Jewish, Montenegrin, Polish, Russian, Serbian, Slovak, Ukrainian, among others. Students are introduced to the aims and methods of the public humanities and social sciences, learning research and technical skills in support of podcast, website, and short video production. In a future iteration the course will include additional language study through a 1-credit trailer. Students are encouraged to enroll in one of the following languages: HUN, POLISH, RUSS, SERCRO, SLOVAK, UKRAIN.", "completed": false, "prereq_count": 0}, {"dept_code": "SLAV", "id": "1850", "course_title": "UNDERSTANDING THE BALKANS: INTRODUCTION TO BALKAN CULTURE AND LITERATURE", "description": "Introduction to Balkan Culture and Literature course will be offered for the first time alongside the current Slavic department offerings and it comes at a very exciting moment of approving a minor in Bosnian/Croatian/Serbian. This course is an introduction to the Slavic countries of the Balkans (Bosnia and Hercegovina, Bulgaria, Croatia, Montenegro, North Macedonia, Serbia, Slovenia), focusing on the period from the 14th century up to the modern days. Students will study Balkan culture, literature and film (classic and modern), and through these and other readings learn about Balkan history, politics, literature and culture. In addition, they will come to appreciate the cultural nuances in the Balkans and gain an understanding of the various regional subjectivities and points of view. Trough this course, students will learn -to understand the term \"Balkan\" as both a construct and a geographical region -to become familiar with major authors of the region and their works -to gain a basic understanding of the cultural specificity of Balkan countries -to develop an appreciation for the literature and film of the region -to engage in productive dialogue and writing about cultural texts This class will appeal not only to the major and minors in Slavic but also to students from all areas of the Dietrich School of Arts and Sciences with an emphasis on those who are interested in pursuing certificates in the Russian and East European Studies, European Studies and Global Studies. Since this course is taught in English, students may learn about the region in a manner that best suits their interests and capabilities.", "completed": false, "prereq_count": 0}], "links": []}