{"nodes": [{"dept_code": "PHYS", "id": "0087", "course_title": "PHYSICS AND SOCIETY", "description": "This course introduces students to the physical ideas underlying the role of nuclear science in modern life.", "completed": false}, {"dept_code": "PHYS", "id": "0088", "course_title": "THE PHYSICS OF ENERGY", "description": "This is an introductory course on energy. The course will describe both qualitatively and quantitively energy use, energy generation, and sources of energy. In this course, we will explore potential energy sources and the limitations of potential energy sources for specific practical applications. The course will also describe many of the basic physical considerations related to climate change as this phenomenon has now become intimately connected with energy use.", "completed": false}, {"dept_code": "PHYS", "id": "0091", "course_title": "CONCEPTUAL PHYSICS", "description": "", "completed": false}, {"dept_code": "PHYS", "id": "0110", "course_title": "INTRODUCTION TO PHYSICS 1", "description": "This is the first term of a two-term, algebra-based sequence in introductory physics. This term deals with mechanics, heat and thermodynamics, and waves.", "completed": false}, {"dept_code": "PHYS", "id": "0111", "course_title": "INTRODUCTION TO PHYSICS 2", "description": "This is the second term of a two-term, algebra-based sequence in introductory physics. This term deals with electricity and magnetism, optics, and modern physics.", "completed": false}, {"dept_code": "PHYS", "id": "0174", "course_title": "BASIC PHYSICS, SCIENCE AND ENGINEERING 1 (INTEGRATED)", "description": "The integrated curriculum version of PHYS 0104, the first part of a two-term sequence (0174-0175) introduces students to the basic principles of mechanics. An effort has been made to achieve a better integration of physics with the first term of calculus, engineering, and chemistry. The theory of waves and the kinetic theory of gases will be discussed.", "completed": false}, {"dept_code": "PHYS", "id": "0175", "course_title": "BASIC PHYSICS, SCIENCE AND ENGINEERING 2 (INTEGRATED)", "description": "The integrated curriculum version of PHYS 0105, the second part of a two-term sequence (0174-0175), introduces students to the basic principles of physics. An effort has been made to achieve a better integration of physics with the first term of calculus, engineering, and chemistry. Modern physics (special relativity, elementary quantum mechanics, and atomic structure) will be discussed.", "completed": false}, {"dept_code": "PHYS", "id": "0212", "course_title": "INTRODUCTION TO LABORATORY PHYSICS", "description": "This is an introductory physics laboratory associated with the physics 0110-0111 sequence.", "completed": false}, {"dept_code": "PHYS", "id": "0219", "course_title": "BASIC LABORATORY PHYSICS SCIENCE AND ENGINEERING", "description": "This is an introductory physics laboratory associated with the physics 0104-0105-0106 sequence.", "completed": false}, {"dept_code": "PHYS", "id": "0476", "course_title": "INTRODUCTION TO PHYSICS, SCIENCE AND ENGINEERING 2", "description": "This is the second term of a two-term honors version of the physics 0104-0105-0106 sequence. This term deals with electricity and magnetism, relativity, and an introduction to modern physics and quantum phenomena.", "completed": false}, {"dept_code": "PHYS", "id": "0481", "course_title": "PRINCIPLES OF MODERN PHYSICS 2", "description": "This is the second term of a two-term intermediate-level course in modern physics. This term deals with further applications of quantum mechanics to atoms, molecules, and solids, as well as an introduction to the physics of nuclei and particles.", "completed": false}, {"dept_code": "PHYS", "id": "0525", "course_title": "ANALOG AND DIGITAL ELECTRONICS", "description": "A laboratory course designed to introduce the student to contemporary analog and digital electronics techniques used in basic science and engineering research. Topics include the study of measurement instruments, passive circuits, diode and transistor circuits, operational amplifiers and feedback, digital gates, analog to digital and digital to analog circuits. The course consists of a lecture and a lab.", "completed": false}, {"dept_code": "PHYS", "id": "1310", "course_title": "UNDERGRADUATE SEMINAR", "description": "The undergraduate seminar provides a venue for students to discuss topics of interest in physics and astronomy. It gives students experience presenting research in the form of a poster presentation. The seminar will give the students a taste of what conducting scientific research and presenting scientific results is all about.", "completed": false}, {"dept_code": "PHYS", "id": "1331", "course_title": "MECHANICS", "description": "This is an intermediate-level course dealing with classical mechanics.", "completed": false}, {"dept_code": "PHYS", "id": "1341", "course_title": "THERMODYNAMICS AND STATISTICAL MECHANICS", "description": "This course deals with the basic ideas of equilibrium thermodynamics and statistical mechanics.", "completed": false}, {"dept_code": "PHYS", "id": "1371", "course_title": "INTRODUCTION TO QUANTUM MECHANICS 2", "description": "This is the second-term of a two-term introduction to quantum mechanics. The quantum formalism developed in the first term will be applied in a variety of physical situations.", "completed": false}, {"dept_code": "PHYS", "id": "1372", "course_title": "ELECTROMAGNETIC THEORY", "description": "This is an advanced course in which Maxwell's equations are applied to a variety of electromagnetic phenomena.", "completed": false}, {"dept_code": "PHYS", "id": "1378", "course_title": "INTRODUCTION TO NUCLEAR AND PARTICLE PHYSICS", "description": "This course gives an introduction into the theory concepts and the experimental methods used for nuclear and particle physics research. While some of the basic principles will be discussed from a historical perspective, the emphasis of this course is on modern developments, such as the standard model and the Higgs Boson, supersymmtry, extra dimensions, dark matter, CP-violation and baryogenesis, and neutrino oscillations. The main aspects of physics processes will be understood and calculated from symmetry principles and kinematics.", "completed": false}, {"dept_code": "PHYS", "id": "1426", "course_title": "MODERN PHYSICS LABORATORY", "description": "This is an advanced laboratory course that introduces students to the experimental techniques and equipment used in research laboratories.", "completed": false}, {"dept_code": "PHYS", "id": "1626", "course_title": "MODERN PHYSICS LAB/WRIT PRAC", "description": "This is a writing practicum to accompany physics 1226.", "completed": false}], "links": [{"source": "0110", "target": "0111"}, {"source": "0111", "target": "0212"}, {"source": "0174", "target": "0175"}, {"source": "0174", "target": "0476"}, {"source": "0175", "target": "0219"}, {"source": "0175", "target": "1331"}, {"source": "0219", "target": "0525"}, {"source": "0219", "target": "1310"}, {"source": "0525", "target": "1426"}, {"source": "1426", "target": "1626"}]}