{"nodes": [{"dept_code": "HONORS", "id": "0001", "course_title": "UNIVERSITY ORIENTATION", "description": "An informational seminar open to honors-qualified freshmen. Students gain a better understanding of university services, functions and policies as well as the opportunities available through the honors college.", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "0010", "course_title": "CHANCELLOR SCHOLAR ORIENTATION", "description": "An informational seminar open to freshmen chancellor scholars. Students will gain a better understanding of university services, functions and policies as well as the opportunities available through the honors college.", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "0021", "course_title": "SEMINAR: HUMANITIES", "description": "An informational seminar open to honors-qualified sophomores considering majors in the humanities. Students will explore majors in greater depth, how to conduct research in the disciplines, and preparation for post-graduate opportunities.", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "0080", "course_title": "BRACKENRIDGE RESEARCH SEMINAR", "description": "This seminar will provide Brackenridge research fellows with the opportunity to develop their summer research projects further, culminating in an abstract, a research paper and a poster.", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "0082", "course_title": "SEMINAR IN CONDUCTING RESEARCH", "description": "This seminar is intended for students wishing to learn about research, particularly the kind of research intended to result in a significant project, e.g., A research monograph, a thesis written for a senior project for the BPhil degree. Students at any point of their research process will benefit from this seminar. Topics will include how to do research from an interdisciplinary perspective, how to focus in on a suitable research topic, how to approach faculty to engage their assistance, and the various research opportunities available.", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "0083", "course_title": "SEMINAR IN COMMUNITY-BASED RESEARCH", "description": "", "completed": false, "prereq_count": 0}, {"dept_code": "HONORS", "id": "1010", "course_title": "SPECIAL TOPICS SEMINAR", "description": "", "completed": false, "prereq_count": 0}], "links": []}